Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
    volatile    uint32_t    LUT314L;
    volatile    uint32_t    LUT314H;
    volatile    uint32_t    LUT315L;
    volatile    uint32_t    LUT315H;
    volatile    uint32_t    LUT316L;
    volatile    uint32_t    LUT316H;
    volatile    uint32_t    LUT317L;
    volatile    uint32_t    LUT317H;
    volatile    uint32_t    LUT318L;
    volatile    uint32_t    LUT318H;
    volatile    uint32_t    LUT319L;
    volatile    uint32_t    LUT319H;
    volatile    uint32_t    LUT320L;
    volatile    uint32_t    LUT320H;
    volatile    uint32_t    LUT321L;
    volatile    uint32_t    LUT321H;
    volatile    uint32_t    LUT322L;
    volatile    uint32_t    LUT322H;
    volatile    uint32_t    LUT323L;
    volatile    uint32_t    LUT323H;
    volatile    uint32_t    LUT324L;
    volatile    uint32_t    LUT324H;
    volatile    uint32_t    LUT325L;
    volatile    uint32_t    LUT325H;
    volatile    uint32_t    LUT326L;
    volatile    uint32_t    LUT326H;
    volatile    uint32_t    LUT327L;
    volatile    uint32_t    LUT327H;
    volatile    uint32_t    LUT328L;
    volatile    uint32_t    LUT328H;
    volatile    uint32_t    LUT329L;
    volatile    uint32_t    LUT329H;
    volatile    uint32_t    LUT330L;
    volatile    uint32_t    LUT330H;
    volatile    uint32_t    LUT331L;
    volatile    uint32_t    LUT331H;
    volatile    uint32_t    LUT332L;
    volatile    uint32_t    LUT332H;
    volatile    uint32_t    LUT333L;
    volatile    uint32_t    LUT333H;
    volatile    uint32_t    LUT334L;
    volatile    uint32_t    LUT334H;
    volatile    uint32_t    LUT335L;
    volatile    uint32_t    LUT335H;
    volatile    uint32_t    LUT336L;
    volatile    uint32_t    LUT336H;
    volatile    uint32_t    LUT337L;
    volatile    uint32_t    LUT337H;
    volatile    uint32_t    LUT338L;
    volatile    uint32_t    LUT338H;
    volatile    uint32_t    LUT339L;
    volatile    uint32_t    LUT339H;
    volatile    uint32_t    LUT340L;
    volatile    uint32_t    LUT340H;
    volatile    uint32_t    LUT341L;
    volatile    uint32_t    LUT341H;
    volatile    uint32_t    LUT342L;
    volatile    uint32_t    LUT342H;
    volatile    uint32_t    LUT343L;
    volatile    uint32_t    LUT343H;
    volatile    uint32_t    LUT344L;
    volatile    uint32_t    LUT344H;
    volatile    uint32_t    LUT345L;
    volatile    uint32_t    LUT345H;
    volatile    uint32_t    LUT346L;
    volatile    uint32_t    LUT346H;
    volatile    uint32_t    LUT347L;
    volatile    uint32_t    LUT347H;
    volatile    uint32_t    LUT348L;
    volatile    uint32_t    LUT348H;
    volatile    uint32_t    LUT349L;
    volatile    uint32_t    LUT349H;
    volatile    uint32_t    LUT350L;
    volatile    uint32_t    LUT350H;
    volatile    uint32_t    LUT351L;
    volatile    uint32_t    LUT351H;
    volatile    uint32_t    LUT352L;
    volatile    uint32_t    LUT352H;
    volatile    uint32_t    LUT353L;
    volatile    uint32_t    LUT353H;
    volatile    uint32_t    LUT354L;
    volatile    uint32_t    LUT354H;
    volatile    uint32_t    LUT355L;
    volatile    uint32_t    LUT355H;
    volatile    uint32_t    LUT356L;
    volatile    uint32_t    LUT356H;
    volatile    uint32_t    LUT357L;
    volatile    uint32_t    LUT357H;
    volatile    uint32_t    LUT358L;
    volatile    uint32_t    LUT358H;
    volatile    uint32_t    LUT359L;
    volatile    uint32_t    LUT359H;
    volatile    uint32_t    LUT360L;
    volatile    uint32_t    LUT360H;
    volatile    uint32_t    LUT361L;
    volatile    uint32_t    LUT361H;
    volatile    uint32_t    LUT362L;
    volatile    uint32_t    LUT362H;
    volatile    uint32_t    LUT363L;
    volatile    uint32_t    LUT363H;
    volatile    uint32_t    LUT364L;
    volatile    uint32_t    LUT364H;
    volatile    uint32_t    LUT365L;
    volatile    uint32_t    LUT365H;
    volatile    uint32_t    LUT366L;
    volatile    uint32_t    LUT366H;
    volatile    uint32_t    LUT367L;
    volatile    uint32_t    LUT367H;
    volatile    uint32_t    LUT368L;
    volatile    uint32_t    LUT368H;
    volatile    uint32_t    LUT369L;
    volatile    uint32_t    LUT369H;
    volatile    uint32_t    LUT370L;
    volatile    uint32_t    LUT370H;
    volatile    uint32_t    LUT371L;
    volatile    uint32_t    LUT371H;
    volatile    uint32_t    LUT372L;
    volatile    uint32_t    LUT372H;
    volatile    uint32_t    LUT373L;
    volatile    uint32_t    LUT373H;
    volatile    uint32_t    LUT374L;
    volatile    uint32_t    LUT374H;
    volatile    uint32_t    LUT375L;
    volatile    uint32_t    LUT375H;
    volatile    uint32_t    LUT376L;
    volatile    uint32_t    LUT376H;
    volatile    uint32_t    LUT377L;
    volatile    uint32_t    LUT377H;
    volatile    uint32_t    LUT378L;
    volatile    uint32_t    LUT378H;
    volatile    uint32_t    LUT379L;
    volatile    uint32_t    LUT379H;
    volatile    uint32_t    LUT380L;
    volatile    uint32_t    LUT380H;
    volatile    uint32_t    LUT381L;
    volatile    uint32_t    LUT381H;
    volatile    uint32_t    LUT382L;
    volatile    uint32_t    LUT382H;
    volatile    uint32_t    LUT383L;
    volatile    uint32_t    LUT383H;
    volatile    uint32_t    LUT384L;
    volatile    uint32_t    LUT384H;
    volatile    uint32_t    LUT385L;
    volatile    uint32_t    LUT385H;
    volatile    uint32_t    LUT386L;
    volatile    uint32_t    LUT386H;
    volatile    uint32_t    LUT387L;
    volatile    uint32_t    LUT387H;
    volatile    uint32_t    LUT388L;
    volatile    uint32_t    LUT388H;
    volatile    uint32_t    LUT389L;
    volatile    uint32_t    LUT389H;
    volatile    uint32_t    LUT390L;
    volatile    uint32_t    LUT390H;
    volatile    uint32_t    LUT391L;
    volatile    uint32_t    LUT391H;
    volatile    uint32_t    LUT392L;
    volatile    uint32_t    LUT392H;
    volatile    uint32_t    LUT393L;
    volatile    uint32_t    LUT393H;
    volatile    uint32_t    LUT394L;
    volatile    uint32_t    LUT394H;
    volatile    uint32_t    LUT395L;
    volatile    uint32_t    LUT395H;
    volatile    uint32_t    LUT396L;
    volatile    uint32_t    LUT396H;
    volatile    uint32_t    LUT397L;
    volatile    uint32_t    LUT397H;
    volatile    uint32_t    LUT398L;
    volatile    uint32_t    LUT398H;
    volatile    uint32_t    LUT399L;
    volatile    uint32_t    LUT399H;
    volatile    uint32_t    LUT400L;
    volatile    uint32_t    LUT400H;
    volatile    uint32_t    LUT401L;
    volatile    uint32_t    LUT401H;
    volatile    uint32_t    LUT402L;
    volatile    uint32_t    LUT402H;
    volatile    uint32_t    LUT403L;
    volatile    uint32_t    LUT403H;
    volatile    uint32_t    LUT404L;
    volatile    uint32_t    LUT404H;
    volatile    uint32_t    LUT405L;
    volatile    uint32_t    LUT405H;
    volatile    uint32_t    LUT406L;
    volatile    uint32_t    LUT406H;
    volatile    uint32_t    LUT407L;
    volatile    uint32_t    LUT407H;
    volatile    uint32_t    LUT408L;
    volatile    uint32_t    LUT408H;
    volatile    uint32_t    LUT409L;
    volatile    uint32_t    LUT409H;
    volatile    uint32_t    LUT410L;
    volatile    uint32_t    LUT410H;
    volatile    uint32_t    LUT411L;
    volatile    uint32_t    LUT411H;
    volatile    uint32_t    LUT412L;
    volatile    uint32_t    LUT412H;
    volatile    uint32_t    LUT413L;
    volatile    uint32_t    LUT413H;
    volatile    uint32_t    LUT414L;
    volatile    uint32_t    LUT414H;
    volatile    uint32_t    LUT415L;
    volatile    uint32_t    LUT415H;
    volatile    uint32_t    LUT416L;
    volatile    uint32_t    LUT416H;
    volatile    uint32_t    LUT417L;
    volatile    uint32_t    LUT417H;
    volatile    uint32_t    LUT418L;
    volatile    uint32_t    LUT418H;
    volatile    uint32_t    LUT419L;
    volatile    uint32_t    LUT419H;
    volatile    uint32_t    LUT420L;
    volatile    uint32_t    LUT420H;
    volatile    uint32_t    LUT421L;
    volatile    uint32_t    LUT421H;
    volatile    uint32_t    LUT422L;
    volatile    uint32_t    LUT422H;
    volatile    uint32_t    LUT423L;
    volatile    uint32_t    LUT423H;
    volatile    uint32_t    LUT424L;
    volatile    uint32_t    LUT424H;
    volatile    uint32_t    LUT425L;
    volatile    uint32_t    LUT425H;
    volatile    uint32_t    LUT426L;
    volatile    uint32_t    LUT426H;
    volatile    uint32_t    LUT427L;
    volatile    uint32_t    LUT427H;
    volatile    uint32_t    LUT428L;
    volatile    uint32_t    LUT428H;
    volatile    uint32_t    LUT429L;
    volatile    uint32_t    LUT429H;
    volatile    uint32_t    LUT430L;
    volatile    uint32_t    LUT430H;
    volatile    uint32_t    LUT431L;
    volatile    uint32_t    LUT431H;
    volatile    uint32_t    LUT432L;
    volatile    uint32_t    LUT432H;
    volatile    uint32_t    LUT433L;
    volatile    uint32_t    LUT433H;
    volatile    uint32_t    LUT434L;
    volatile    uint32_t    LUT434H;
    volatile    uint32_t    LUT435L;
    volatile    uint32_t    LUT435H;
    volatile    uint32_t    LUT436L;
    volatile    uint32_t    LUT436H;
    volatile    uint32_t    LUT437L;
    volatile    uint32_t    LUT437H;
    volatile    uint32_t    LUT438L;
    volatile    uint32_t    LUT438H;
    volatile    uint32_t    LUT439L;
    volatile    uint32_t    LUT439H;
    volatile    uint32_t    LUT440L;
    volatile    uint32_t    LUT440H;
    volatile    uint32_t    LUT441L;
    volatile    uint32_t    LUT441H;
    volatile    uint32_t    LUT442L;
    volatile    uint32_t    LUT442H;
    volatile    uint32_t    LUT443L;
    volatile    uint32_t    LUT443H;
    volatile    uint32_t    LUT444L;
    volatile    uint32_t    LUT444H;
    volatile    uint32_t    LUT445L;
    volatile    uint32_t    LUT445H;
    volatile    uint32_t    LUT446L;
    volatile    uint32_t    LUT446H;
    volatile    uint32_t    LUT447L;
    volatile    uint32_t    LUT447H;
    volatile    uint32_t    LUT448L;
    volatile    uint32_t    LUT448H;
    volatile    uint32_t    LUT449L;
    volatile    uint32_t    LUT449H;
    volatile    uint32_t    LUT450L;
    volatile    uint32_t    LUT450H;
    volatile    uint32_t    LUT451L;
    volatile    uint32_t    LUT451H;
    volatile    uint32_t    LUT452L;
    volatile    uint32_t    LUT452H;
    volatile    uint32_t    LUT453L;
    volatile    uint32_t    LUT453H;
    volatile    uint32_t    LUT454L;
    volatile    uint32_t    LUT454H;
    volatile    uint32_t    LUT455L;
    volatile    uint32_t    LUT455H;
    volatile    uint32_t    LUT456L;
    volatile    uint32_t    LUT456H;
    volatile    uint32_t    LUT457L;
    volatile    uint32_t    LUT457H;
    volatile    uint32_t    LUT458L;
    volatile    uint32_t    LUT458H;
    volatile    uint32_t    LUT459L;
    volatile    uint32_t    LUT459H;
    volatile    uint32_t    LUT460L;
    volatile    uint32_t    LUT460H;
    volatile    uint32_t    LUT461L;
    volatile    uint32_t    LUT461H;
    volatile    uint32_t    LUT462L;
    volatile    uint32_t    LUT462H;
    volatile    uint32_t    LUT463L;
    volatile    uint32_t    LUT463H;
    volatile    uint32_t    LUT464L;
    volatile    uint32_t    LUT464H;
    volatile    uint32_t    LUT465L;
    volatile    uint32_t    LUT465H;
    volatile    uint32_t    LUT466L;
    volatile    uint32_t    LUT466H;
    volatile    uint32_t    LUT467L;
    volatile    uint32_t    LUT467H;
    volatile    uint32_t    LUT468L;
    volatile    uint32_t    LUT468H;
    volatile    uint32_t    LUT469L;
    volatile    uint32_t    LUT469H;
    volatile    uint32_t    LUT470L;
    volatile    uint32_t    LUT470H;
    volatile    uint32_t    LUT471L;
    volatile    uint32_t    LUT471H;
    volatile    uint32_t    LUT472L;
    volatile    uint32_t    LUT472H;
    volatile    uint32_t    LUT473L;
    volatile    uint32_t    LUT473H;
    volatile    uint32_t    LUT474L;
    volatile    uint32_t    LUT474H;
    volatile    uint32_t    LUT475L;
    volatile    uint32_t    LUT475H;
    volatile    uint32_t    LUT476L;
    volatile    uint32_t    LUT476H;
    volatile    uint32_t    LUT477L;
    volatile    uint32_t    LUT477H;
    volatile    uint32_t    LUT478L;
    volatile    uint32_t    LUT478H;
    volatile    uint32_t    LUT479L;
    volatile    uint32_t    LUT479H;
    volatile    uint32_t    LUT480L;
    volatile    uint32_t    LUT480H;
    volatile    uint32_t    LUT481L;
    volatile    uint32_t    LUT481H;
    volatile    uint32_t    LUT482L;
    volatile    uint32_t    LUT482H;
    volatile    uint32_t    LUT483L;
    volatile    uint32_t    LUT483H;
    volatile    uint32_t    LUT484L;
    volatile    uint32_t    LUT484H;
    volatile    uint32_t    LUT485L;
    volatile    uint32_t    LUT485H;
    volatile    uint32_t    LUT486L;
    volatile    uint32_t    LUT486H;
    volatile    uint32_t    LUT487L;
    volatile    uint32_t    LUT487H;
    volatile    uint32_t    LUT488L;
    volatile    uint32_t    LUT488H;
    volatile    uint32_t    LUT489L;
    volatile    uint32_t    LUT489H;
    volatile    uint32_t    LUT490L;
    volatile    uint32_t    LUT490H;
    volatile    uint32_t    LUT491L;
    volatile    uint32_t    LUT491H;
    volatile    uint32_t    LUT492L;
    volatile    uint32_t    LUT492H;
    volatile    uint32_t    LUT493L;
    volatile    uint32_t    LUT493H;
    volatile    uint32_t    LUT494L;
    volatile    uint32_t    LUT494H;
    volatile    uint32_t    LUT495L;
    volatile    uint32_t    LUT495H;
    volatile    uint32_t    LUT496L;
    volatile    uint32_t    LUT496H;
    volatile    uint32_t    LUT497L;
    volatile    uint32_t    LUT497H;
    volatile    uint32_t    LUT498L;
    volatile    uint32_t    LUT498H;
    volatile    uint32_t    LUT499L;
    volatile    uint32_t    LUT499H;
    volatile    uint32_t    LUT500L;
    volatile    uint32_t    LUT500H;
    volatile    uint32_t    LUT501L;
    volatile    uint32_t    LUT501H;
    volatile    uint32_t    LUT502L;
    volatile    uint32_t    LUT502H;
    volatile    uint32_t    LUT503L;
    volatile    uint32_t    LUT503H;
    volatile    uint32_t    LUT504L;
    volatile    uint32_t    LUT504H;
    volatile    uint32_t    LUT505L;
    volatile    uint32_t    LUT505H;
    volatile    uint32_t    LUT506L;
    volatile    uint32_t    LUT506H;
    volatile    uint32_t    LUT507L;
    volatile    uint32_t    LUT507H;
    volatile    uint32_t    LUT508L;
    volatile    uint32_t    LUT508H;
    volatile    uint32_t    LUT509L;
    volatile    uint32_t    LUT509H;
    volatile    uint32_t    LUT510L;
    volatile    uint32_t    LUT510H;
    volatile    uint32_t    LUT511L;
    volatile    uint32_t    LUT511H;
    volatile    uint32_t    LUT512L;
    volatile    uint32_t    LUT512H;
    volatile    uint32_t    LUT513L;
    volatile    uint32_t    LUT513H;
    volatile    uint32_t    LUT514L;
    volatile    uint32_t    LUT514H;
    volatile    uint32_t    LUT515L;
    volatile    uint32_t    LUT515H;
    volatile    uint32_t    LUT516L;
    volatile    uint32_t    LUT516H;
    volatile    uint32_t    LUT517L;
    volatile    uint32_t    LUT517H;
    volatile    uint32_t    LUT518L;
    volatile    uint32_t    LUT518H;
    volatile    uint32_t    LUT519L;
    volatile    uint32_t    LUT519H;
    volatile    uint32_t    LUT520L;
    volatile    uint32_t    LUT520H;
    volatile    uint32_t    LUT521L;
    volatile    uint32_t    LUT521H;
    volatile    uint32_t    LUT522L;
    volatile    uint32_t    LUT522H;
    volatile    uint32_t    LUT523L;
    volatile    uint32_t    LUT523H;
    volatile    uint32_t    LUT524L;
    volatile    uint32_t    LUT524H;
    volatile    uint32_t    LUT525L;
    volatile    uint32_t    LUT525H;
    volatile    uint32_t    LUT526L;
    volatile    uint32_t    LUT526H;
    volatile    uint32_t    LUT527L;
    volatile    uint32_t    LUT527H;
    volatile    uint32_t    LUT528L;
    volatile    uint32_t    LUT528H;
    volatile    uint32_t    LUT529L;
    volatile    uint32_t    LUT529H;
    volatile    uint32_t    LUT530L;
    volatile    uint32_t    LUT530H;
    volatile    uint32_t    LUT531L;
    volatile    uint32_t    LUT531H;
    volatile    uint32_t    LUT532L;
    volatile    uint32_t    LUT532H;
    volatile    uint32_t    LUT533L;
    volatile    uint32_t    LUT533H;
    volatile    uint32_t    LUT534L;
    volatile    uint32_t    LUT534H;
    volatile    uint32_t    LUT535L;
    volatile    uint32_t    LUT535H;
    volatile    uint32_t    LUT536L;
    volatile    uint32_t    LUT536H;
    volatile    uint32_t    LUT537L;
    volatile    uint32_t    LUT537H;
    volatile    uint32_t    LUT538L;
    volatile    uint32_t    LUT538H;
    volatile    uint32_t    LUT539L;
    volatile    uint32_t    LUT539H;
    volatile    uint32_t    LUT540L;
    volatile    uint32_t    LUT540H;
    volatile    uint32_t    LUT541L;
    volatile    uint32_t    LUT541H;
    volatile    uint32_t    LUT542L;
    volatile    uint32_t    LUT542H;
    volatile    uint32_t    LUT543L;
    volatile    uint32_t    LUT543H;
    volatile    uint32_t    LUT544L;
    volatile    uint32_t    LUT544H;
    volatile    uint32_t    LUT545L;
    volatile    uint32_t    LUT545H;
    volatile    uint32_t    LUT546L;
    volatile    uint32_t    LUT546H;
    volatile    uint32_t    LUT547L;
    volatile    uint32_t    LUT547H;
    volatile    uint32_t    LUT548L;
    volatile    uint32_t    LUT548H;
    volatile    uint32_t    LUT549L;
    volatile    uint32_t    LUT549H;
    volatile    uint32_t    LUT550L;
    volatile    uint32_t    LUT550H;
    volatile    uint32_t    LUT551L;
    volatile    uint32_t    LUT551H;
    volatile    uint32_t    LUT552L;
    volatile    uint32_t    LUT552H;
    volatile    uint32_t    LUT553L;
    volatile    uint32_t    LUT553H;
    volatile    uint32_t    LUT554L;
    volatile    uint32_t    LUT554H;
    volatile    uint32_t    LUT555L;
    volatile    uint32_t    LUT555H;
    volatile    uint32_t    LUT556L;
    volatile    uint32_t    LUT556H;
    volatile    uint32_t    LUT557L;
    volatile    uint32_t    LUT557H;
    volatile    uint32_t    LUT558L;
    volatile    uint32_t    LUT558H;
    volatile    uint32_t    LUT559L;
    volatile    uint32_t    LUT559H;
    volatile    uint32_t    LUT560L;
    volatile    uint32_t    LUT560H;
    volatile    uint32_t    LUT561L;
    volatile    uint32_t    LUT561H;
    volatile    uint32_t    LUT562L;
    volatile    uint32_t    LUT562H;
    volatile    uint32_t    LUT563L;
    volatile    uint32_t    LUT563H;
    volatile    uint32_t    LUT564L;
    volatile    uint32_t    LUT564H;
    volatile    uint32_t    LUT565L;
    volatile    uint32_t    LUT565H;
    volatile    uint32_t    LUT566L;
    volatile    uint32_t    LUT566H;
    volatile    uint32_t    LUT567L;
    volatile    uint32_t    LUT567H;
    volatile    uint32_t    LUT568L;
    volatile    uint32_t    LUT568H;
    volatile    uint32_t    LUT569L;
    volatile    uint32_t    LUT569H;
    volatile    uint32_t    LUT570L;
    volatile    uint32_t    LUT570H;
    volatile    uint32_t    LUT571L;
    volatile    uint32_t    LUT571H;
    volatile    uint32_t    LUT572L;
    volatile    uint32_t    LUT572H;
    volatile    uint32_t    LUT573L;
    volatile    uint32_t    LUT573H;
    volatile    uint32_t    LUT574L;
    volatile    uint32_t    LUT574H;
    volatile    uint32_t    LUT575L;
    volatile    uint32_t    LUT575H;
    volatile    uint32_t    LUT576L;
    volatile    uint32_t    LUT576H;
    volatile    uint32_t    LUT577L;
    volatile    uint32_t    LUT577H;
    volatile    uint32_t    LUT578L;
    volatile    uint32_t    LUT578H;
    volatile    uint32_t    LUT579L;
    volatile    uint32_t    LUT579H;
    volatile    uint32_t    LUT580L;
    volatile    uint32_t    LUT580H;
    volatile    uint32_t    LUT581L;
    volatile    uint32_t    LUT581H;
    volatile    uint32_t    LUT582L;
    volatile    uint32_t    LUT582H;
    volatile    uint32_t    LUT583L;
    volatile    uint32_t    LUT583H;
    volatile    uint32_t    LUT584L;
    volatile    uint32_t    LUT584H;
    volatile    uint32_t    LUT585L;
    volatile    uint32_t    LUT585H;
    volatile    uint32_t    LUT586L;
    volatile    uint32_t    LUT586H;
    volatile    uint32_t    LUT587L;
    volatile    uint32_t    LUT587H;
    volatile    uint32_t    LUT588L;
    volatile    uint32_t    LUT588H;
    volatile    uint32_t    LUT589L;
    volatile    uint32_t    LUT589H;
    volatile    uint32_t    LUT590L;
    volatile    uint32_t    LUT590H;
    volatile    uint32_t    LUT591L;
    volatile    uint32_t    LUT591H;
    volatile    uint32_t    LUT592L;
    volatile    uint32_t    LUT592H;
    volatile    uint32_t    LUT593L;
    volatile    uint32_t    LUT593H;
    volatile    uint32_t    LUT594L;
    volatile    uint32_t    LUT594H;
    volatile    uint32_t    LUT595L;
    volatile    uint32_t    LUT595H;
    volatile    uint32_t    LUT596L;
    volatile    uint32_t    LUT596H;
    volatile    uint32_t    LUT597L;
    volatile    uint32_t    LUT597H;
    volatile    uint32_t    LUT598L;
    volatile    uint32_t    LUT598H;
    volatile    uint32_t    LUT599L;
    volatile    uint32_t    LUT599H;
    volatile    uint32_t    LUT600L;
    volatile    uint32_t    LUT600H;
    volatile    uint32_t    LUT601L;
    volatile    uint32_t    LUT601H;
    volatile    uint32_t    LUT602L;
    volatile    uint32_t    LUT602H;
    volatile    uint32_t    LUT603L;
    volatile    uint32_t    LUT603H;
    volatile    uint32_t    LUT604L;
    volatile    uint32_t    LUT604H;
    volatile    uint32_t    LUT605L;
    volatile    uint32_t    LUT605H;
    volatile    uint32_t    LUT606L;
    volatile    uint32_t    LUT606H;
    volatile    uint32_t    LUT607L;
    volatile    uint32_t    LUT607H;
    volatile    uint32_t    LUT608L;
    volatile    uint32_t    LUT608H;
    volatile    uint32_t    LUT609L;
    volatile    uint32_t    LUT609H;
    volatile    uint32_t    LUT610L;
    volatile    uint32_t    LUT610H;
    volatile    uint32_t    LUT611L;
    volatile    uint32_t    LUT611H;
    volatile    uint32_t    LUT612L;
    volatile    uint32_t    LUT612H;
    volatile    uint32_t    LUT613L;
    volatile    uint32_t    LUT613H;
    volatile    uint32_t    LUT614L;
    volatile    uint32_t    LUT614H;
    volatile    uint32_t    LUT615L;
    volatile    uint32_t    LUT615H;
    volatile    uint32_t    LUT616L;
    volatile    uint32_t    LUT616H;
    volatile    uint32_t    LUT617L;
    volatile    uint32_t    LUT617H;
    volatile    uint32_t    LUT618L;
    volatile    uint32_t    LUT618H;
    volatile    uint32_t    LUT619L;
    volatile    uint32_t    LUT619H;
    volatile    uint32_t    LUT620L;
    volatile    uint32_t    LUT620H;
    volatile    uint32_t    LUT621L;
    volatile    uint32_t    LUT621H;
    volatile    uint32_t    LUT622L;
    volatile    uint32_t    LUT622H;
    volatile    uint32_t    LUT623L;
    volatile    uint32_t    LUT623H;
    volatile    uint32_t    LUT624L;
    volatile    uint32_t    LUT624H;
    volatile    uint32_t    LUT625L;
    volatile    uint32_t    LUT625H;
    volatile    uint32_t    LUT626L;
    volatile    uint32_t    LUT626H;
    volatile    uint32_t    LUT627L;
    volatile    uint32_t    LUT627H;
    volatile    uint32_t    LUT628L;
    volatile    uint32_t    LUT628H;
    volatile    uint32_t    LUT629L;
    volatile    uint32_t    LUT629H;
    volatile    uint32_t    LUT630L;
    volatile    uint32_t    LUT630H;
    volatile    uint32_t    LUT631L;
    volatile    uint32_t    LUT631H;
    volatile    uint32_t    LUT632L;
    volatile    uint32_t    LUT632H;
    volatile    uint32_t    LUT633L;
    volatile    uint32_t    LUT633H;
    volatile    uint32_t    LUT634L;
    volatile    uint32_t    LUT634H;
    volatile    uint32_t    LUT635L;
    volatile    uint32_t    LUT635H;
    volatile    uint32_t    LUT636L;
    volatile    uint32_t    LUT636H;
    volatile    uint32_t    LUT637L;
    volatile    uint32_t    LUT637H;
