Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
    volatile    uint32_t    LUT962L;
    volatile    uint32_t    LUT962H;
    volatile    uint32_t    LUT963L;
    volatile    uint32_t    LUT963H;
    volatile    uint32_t    LUT964L;
    volatile    uint32_t    LUT964H;
    volatile    uint32_t    LUT965L;
    volatile    uint32_t    LUT965H;
    volatile    uint32_t    LUT966L;
    volatile    uint32_t    LUT966H;
    volatile    uint32_t    LUT967L;
    volatile    uint32_t    LUT967H;
    volatile    uint32_t    LUT968L;
    volatile    uint32_t    LUT968H;
    volatile    uint32_t    LUT969L;
    volatile    uint32_t    LUT969H;
    volatile    uint32_t    LUT970L;
    volatile    uint32_t    LUT970H;
    volatile    uint32_t    LUT971L;
    volatile    uint32_t    LUT971H;
    volatile    uint32_t    LUT972L;
    volatile    uint32_t    LUT972H;
    volatile    uint32_t    LUT973L;
    volatile    uint32_t    LUT973H;
    volatile    uint32_t    LUT974L;
    volatile    uint32_t    LUT974H;
    volatile    uint32_t    LUT975L;
    volatile    uint32_t    LUT975H;
    volatile    uint32_t    LUT976L;
    volatile    uint32_t    LUT976H;
    volatile    uint32_t    LUT977L;
    volatile    uint32_t    LUT977H;
    volatile    uint32_t    LUT978L;
    volatile    uint32_t    LUT978H;
    volatile    uint32_t    LUT979L;
    volatile    uint32_t    LUT979H;
    volatile    uint32_t    LUT980L;
    volatile    uint32_t    LUT980H;
    volatile    uint32_t    LUT981L;
    volatile    uint32_t    LUT981H;
    volatile    uint32_t    LUT982L;
    volatile    uint32_t    LUT982H;
    volatile    uint32_t    LUT983L;
    volatile    uint32_t    LUT983H;
    volatile    uint32_t    LUT984L;
    volatile    uint32_t    LUT984H;
    volatile    uint32_t    LUT985L;
    volatile    uint32_t    LUT985H;
    volatile    uint32_t    LUT986L;
    volatile    uint32_t    LUT986H;
    volatile    uint32_t    LUT987L;
    volatile    uint32_t    LUT987H;
    volatile    uint32_t    LUT988L;
    volatile    uint32_t    LUT988H;
    volatile    uint32_t    LUT989L;
    volatile    uint32_t    LUT989H;
    volatile    uint32_t    LUT990L;
    volatile    uint32_t    LUT990H;
    volatile    uint32_t    LUT991L;
    volatile    uint32_t    LUT991H;
    volatile    uint32_t    LUT992L;
    volatile    uint32_t    LUT992H;
    volatile    uint32_t    LUT993L;
    volatile    uint32_t    LUT993H;
    volatile    uint32_t    LUT994L;
    volatile    uint32_t    LUT994H;
    volatile    uint32_t    LUT995L;
    volatile    uint32_t    LUT995H;
    volatile    uint32_t    LUT996L;
    volatile    uint32_t    LUT996H;
    volatile    uint32_t    LUT997L;
    volatile    uint32_t    LUT997H;
    volatile    uint32_t    LUT998L;
    volatile    uint32_t    LUT998H;
    volatile    uint32_t    LUT999L;
    volatile    uint32_t    LUT999H;
    volatile    uint32_t    LUT1000L;
    volatile    uint32_t    LUT1000H;
    volatile    uint32_t    LUT1001L;
    volatile    uint32_t    LUT1001H;
    volatile    uint32_t    LUT1002L;
    volatile    uint32_t    LUT1002H;
    volatile    uint32_t    LUT1003L;
    volatile    uint32_t    LUT1003H;
    volatile    uint32_t    LUT1004L;
    volatile    uint32_t    LUT1004H;
    volatile    uint32_t    LUT1005L;
    volatile    uint32_t    LUT1005H;
    volatile    uint32_t    LUT1006L;
    volatile    uint32_t    LUT1006H;
    volatile    uint32_t    LUT1007L;
    volatile    uint32_t    LUT1007H;
    volatile    uint32_t    LUT1008L;
    volatile    uint32_t    LUT1008H;
    volatile    uint32_t    LUT1009L;
    volatile    uint32_t    LUT1009H;
    volatile    uint32_t    LUT1010L;
    volatile    uint32_t    LUT1010H;
    volatile    uint32_t    LUT1011L;
    volatile    uint32_t    LUT1011H;
    volatile    uint32_t    LUT1012L;
    volatile    uint32_t    LUT1012H;
    volatile    uint32_t    LUT1013L;
    volatile    uint32_t    LUT1013H;
    volatile    uint32_t    LUT1014L;
    volatile    uint32_t    LUT1014H;
    volatile    uint32_t    LUT1015L;
    volatile    uint32_t    LUT1015H;
    volatile    uint32_t    LUT1016L;
    volatile    uint32_t    LUT1016H;
    volatile    uint32_t    LUT1017L;
    volatile    uint32_t    LUT1017H;
    volatile    uint32_t    LUT1018L;
    volatile    uint32_t    LUT1018H;
    volatile    uint32_t    LUT1019L;
    volatile    uint32_t    LUT1019H;
    volatile    uint32_t    LUT1020L;
    volatile    uint32_t    LUT1020H;
    volatile    uint32_t    LUT1021L;
    volatile    uint32_t    LUT1021H;
    volatile    uint32_t    LUT1022L;
    volatile    uint32_t    LUT1022H;
    volatile    uint32_t    LUT1023L;
    volatile    uint32_t    LUT1023H;
} GFXMMU_TypeDef;

#ifdef __cplusplus
#define GFXMMU_NS   reinterpret_cast<GFXMMU_TypeDef *>(0x4002C000U)
#define GFXMMU_S    reinterpret_cast<GFXMMU_TypeDef *>(0x5002C000U)

#else
#define GFXMMU_NS   ((GFXMMU_TypeDef *)0x4002C000U)
#define GFXMMU_S    ((GFXMMU_TypeDef *)0x5002C000U)
#endif

// CR Configuration

#define GFXMMU_CR_OB                (0x1U<<17)
#define GFXMMU_CR_OC                (0x1U<<16)
#define GFXMMU_CR_PD                (0x1U<<12)
#define GFXMMU_CR_FC                (0x1U<<11)
#define GFXMMU_CR_CLB               (0x3U<<9)
#define GFXMMU_CR_CLB_0             (0x1U<<9)
#define GFXMMU_CR_CL                (0x1U<<8)
#define GFXMMU_CR_CE                (0x1U<<7)
#define GFXMMU_CR_BM192             (0x1U<<6)
#define GFXMMU_CR_AMEIE             (0x1U<<4)
#define GFXMMU_CR_B3OIE             (0x1U<<3)
#define GFXMMU_CR_B2OIE             (0x1U<<2)
#define GFXMMU_CR_B1OIE             (0x1U<<1)
#define GFXMMU_CR_B0OIE             (0x1U<<0)
#define GFXMMU_CR_OB_B_0X0          (0x0U<<17)
#define GFXMMU_CR_OB_B_0X1          (0x1U<<17)
#define GFXMMU_CR_OC_B_0X0          (0x0U<<16)
#define GFXMMU_CR_OC_B_0X1          (0x1U<<16)
#define GFXMMU_CR_PD_B_0X0          (0x0U<<12)
#define GFXMMU_CR_PD_B_0X1          (0x1U<<12)
#define GFXMMU_CR_FC_B_0X0          (0x0U<<11)
#define GFXMMU_CR_FC_B_0X1          (0x1U<<11)
#define GFXMMU_CR_CLB_B_0X0         (0x0U<<9)
#define GFXMMU_CR_CLB_B_0X1         (0x1U<<9)
#define GFXMMU_CR_CLB_B_0X2         (0x2U<<9)
#define GFXMMU_CR_CLB_B_0X3         (0x3U<<9)
#define GFXMMU_CR_CL_B_0X0          (0x0U<<8)
#define GFXMMU_CR_CL_B_0X1          (0x1U<<8)
#define GFXMMU_CR_CE_B_0X0          (0x0U<<7)
#define GFXMMU_CR_CE_B_0X1          (0x1U<<7)
#define GFXMMU_CR_BM192_B_0X0       (0x0U<<6)
#define GFXMMU_CR_BM192_B_0X1       (0x1U<<6)
#define GFXMMU_CR_AMEIE_B_0X0       (0x0U<<4)
#define GFXMMU_CR_AMEIE_B_0X1       (0x1U<<4)
#define GFXMMU_CR_B3OIE_B_0X0       (0x0U<<3)
#define GFXMMU_CR_B3OIE_B_0X1       (0x1U<<3)
#define GFXMMU_CR_B2OIE_B_0X0       (0x0U<<2)
#define GFXMMU_CR_B2OIE_B_0X1       (0x1U<<2)
#define GFXMMU_CR_B1OIE_B_0X0       (0x0U<<1)
#define GFXMMU_CR_B1OIE_B_0X1       (0x1U<<1)
#define GFXMMU_CR_B0OIE_B_0X0       (0x0U<<0)
#define GFXMMU_CR_B0OIE_B_0X1       (0x1U<<0)

// SR Configuration

