Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_SR_AMEF              (0x1U<<4)
#define GFXMMU_SR_B3OF              (0x1U<<3)
#define GFXMMU_SR_B2OF              (0x1U<<2)
#define GFXMMU_SR_B1OF              (0x1U<<1)
#define GFXMMU_SR_B0OF              (0x1U<<0)

// FCR Configuration

#define GFXMMU_FCR_CAMEF            (0x1U<<4)
#define GFXMMU_FCR_CB3OF            (0x1U<<3)
#define GFXMMU_FCR_CB2OF            (0x1U<<2)
#define GFXMMU_FCR_CB1OF            (0x1U<<1)
#define GFXMMU_FCR_CB0OF            (0x1U<<0)

// CCR Configuration

#define GFXMMU_CCR_FI               (0x1U<<1)
#define GFXMMU_CCR_FF               (0x1U<<0)
#define GFXMMU_CCR_FI_B_0X0         (0x0U<<1)
#define GFXMMU_CCR_FI_B_0X1         (0x1U<<1)
#define GFXMMU_CCR_FF_B_0X0         (0x0U<<0)
#define GFXMMU_CCR_FF_B_0X1         (0x1U<<0)

// DVR Configuration

#define GFXMMU_DVR_DV               (0xFFFFFFFFU<<0)
#define GFXMMU_DVR_DV_0             (0x1U<<0)

// B0CR Configuration

#define GFXMMU_B0CR_PBBA            (0x1FFU<<23)
#define GFXMMU_B0CR_PBBA_0          (0x1U<<23)
#define GFXMMU_B0CR_PBO             (0x7FFFFU<<4)
#define GFXMMU_B0CR_PBO_0           (0x1U<<4)

// B1CR Configuration

#define GFXMMU_B1CR_PBBA            (0x1FFU<<23)
#define GFXMMU_B1CR_PBBA_0          (0x1U<<23)
#define GFXMMU_B1CR_PBO             (0x7FFFFU<<4)
#define GFXMMU_B1CR_PBO_0           (0x1U<<4)

// B2CR Configuration

#define GFXMMU_B2CR_PBBA            (0x1FFU<<23)
#define GFXMMU_B2CR_PBBA_0          (0x1U<<23)
#define GFXMMU_B2CR_PBO             (0x7FFFFU<<4)
#define GFXMMU_B2CR_PBO_0           (0x1U<<4)

// B3CR Configuration

#define GFXMMU_B3CR_PBBA            (0x1FFU<<23)
#define GFXMMU_B3CR_PBBA_0          (0x1U<<23)
#define GFXMMU_B3CR_PBO             (0x7FFFFU<<4)
#define GFXMMU_B3CR_PBO_0           (0x1U<<4)

// LUT0L Configuration

#define GFXMMU_LUT0L_LVB            (0xFFU<<16)
#define GFXMMU_LUT0L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT0L_FVB            (0xFFU<<8)
#define GFXMMU_LUT0L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT0L_EN             (0x1U<<0)
#define GFXMMU_LUT0L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT0L_EN_B_0X1       (0x1U<<0)

// LUT0H Configuration

#define GFXMMU_LUT0H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT0H_LO_0           (0x1U<<4)

// LUT1L Configuration

#define GFXMMU_LUT1L_LVB            (0xFFU<<16)
#define GFXMMU_LUT1L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT1L_FVB            (0xFFU<<8)
#define GFXMMU_LUT1L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT1L_EN             (0x1U<<0)
#define GFXMMU_LUT1L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT1L_EN_B_0X1       (0x1U<<0)

// LUT1H Configuration

#define GFXMMU_LUT1H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT1H_LO_0           (0x1U<<4)

// LUT2L Configuration

#define GFXMMU_LUT2L_LVB            (0xFFU<<16)
#define GFXMMU_LUT2L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT2L_FVB            (0xFFU<<8)
#define GFXMMU_LUT2L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT2L_EN             (0x1U<<0)
#define GFXMMU_LUT2L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT2L_EN_B_0X1       (0x1U<<0)

// LUT2H Configuration

#define GFXMMU_LUT2H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT2H_LO_0           (0x1U<<4)

// LUT3L Configuration

#define GFXMMU_LUT3L_LVB            (0xFFU<<16)
#define GFXMMU_LUT3L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT3L_FVB            (0xFFU<<8)
#define GFXMMU_LUT3L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT3L_EN             (0x1U<<0)
#define GFXMMU_LUT3L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT3L_EN_B_0X1       (0x1U<<0)

// LUT3H Configuration

#define GFXMMU_LUT3H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT3H_LO_0           (0x1U<<4)

// LUT4L Configuration

#define GFXMMU_LUT4L_LVB            (0xFFU<<16)
#define GFXMMU_LUT4L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT4L_FVB            (0xFFU<<8)
#define GFXMMU_LUT4L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT4L_EN             (0x1U<<0)
#define GFXMMU_LUT4L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT4L_EN_B_0X1       (0x1U<<0)

// LUT4H Configuration

#define GFXMMU_LUT4H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT4H_LO_0           (0x1U<<4)

// LUT5L Configuration

#define GFXMMU_LUT5L_LVB            (0xFFU<<16)
#define GFXMMU_LUT5L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT5L_FVB            (0xFFU<<8)
#define GFXMMU_LUT5L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT5L_EN             (0x1U<<0)
#define GFXMMU_LUT5L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT5L_EN_B_0X1       (0x1U<<0)

// LUT5H Configuration

#define GFXMMU_LUT5H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT5H_LO_0           (0x1U<<4)

// LUT6L Configuration

#define GFXMMU_LUT6L_LVB            (0xFFU<<16)
#define GFXMMU_LUT6L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT6L_FVB            (0xFFU<<8)
#define GFXMMU_LUT6L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT6L_EN             (0x1U<<0)
#define GFXMMU_LUT6L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT6L_EN_B_0X1       (0x1U<<0)

// LUT6H Configuration

#define GFXMMU_LUT6H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT6H_LO_0           (0x1U<<4)

// LUT7L Configuration

#define GFXMMU_LUT7L_LVB            (0xFFU<<16)
#define GFXMMU_LUT7L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT7L_FVB            (0xFFU<<8)
#define GFXMMU_LUT7L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT7L_EN             (0x1U<<0)
#define GFXMMU_LUT7L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT7L_EN_B_0X1       (0x1U<<0)

// LUT7H Configuration

#define GFXMMU_LUT7H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT7H_LO_0           (0x1U<<4)

// LUT8L Configuration

#define GFXMMU_LUT8L_LVB            (0xFFU<<16)
#define GFXMMU_LUT8L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT8L_FVB            (0xFFU<<8)
#define GFXMMU_LUT8L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT8L_EN             (0x1U<<0)
#define GFXMMU_LUT8L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT8L_EN_B_0X1       (0x1U<<0)

// LUT8H Configuration

#define GFXMMU_LUT8H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT8H_LO_0           (0x1U<<4)

