Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT9L Configuration

#define GFXMMU_LUT9L_LVB            (0xFFU<<16)
#define GFXMMU_LUT9L_LVB_0          (0x1U<<16)
#define GFXMMU_LUT9L_FVB            (0xFFU<<8)
#define GFXMMU_LUT9L_FVB_0          (0x1U<<8)
#define GFXMMU_LUT9L_EN             (0x1U<<0)
#define GFXMMU_LUT9L_EN_B_0X0       (0x0U<<0)
#define GFXMMU_LUT9L_EN_B_0X1       (0x1U<<0)

// LUT9H Configuration

#define GFXMMU_LUT9H_LO             (0x3FFFFU<<4)
#define GFXMMU_LUT9H_LO_0           (0x1U<<4)

// LUT10L Configuration

#define GFXMMU_LUT10L_LVB           (0xFFU<<16)
#define GFXMMU_LUT10L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT10L_FVB           (0xFFU<<8)
#define GFXMMU_LUT10L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT10L_EN            (0x1U<<0)
#define GFXMMU_LUT10L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT10L_EN_B_0X1      (0x1U<<0)

// LUT10H Configuration

#define GFXMMU_LUT10H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT10H_LO_0          (0x1U<<4)

// LUT11L Configuration

#define GFXMMU_LUT11L_LVB           (0xFFU<<16)
#define GFXMMU_LUT11L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT11L_FVB           (0xFFU<<8)
#define GFXMMU_LUT11L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT11L_EN            (0x1U<<0)
#define GFXMMU_LUT11L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT11L_EN_B_0X1      (0x1U<<0)

// LUT11H Configuration

#define GFXMMU_LUT11H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT11H_LO_0          (0x1U<<4)

// LUT12L Configuration

#define GFXMMU_LUT12L_LVB           (0xFFU<<16)
#define GFXMMU_LUT12L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT12L_FVB           (0xFFU<<8)
#define GFXMMU_LUT12L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT12L_EN            (0x1U<<0)
#define GFXMMU_LUT12L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT12L_EN_B_0X1      (0x1U<<0)

// LUT12H Configuration

#define GFXMMU_LUT12H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT12H_LO_0          (0x1U<<4)

// LUT13L Configuration

#define GFXMMU_LUT13L_LVB           (0xFFU<<16)
#define GFXMMU_LUT13L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT13L_FVB           (0xFFU<<8)
#define GFXMMU_LUT13L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT13L_EN            (0x1U<<0)
#define GFXMMU_LUT13L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT13L_EN_B_0X1      (0x1U<<0)

// LUT13H Configuration

#define GFXMMU_LUT13H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT13H_LO_0          (0x1U<<4)

// LUT14L Configuration

#define GFXMMU_LUT14L_LVB           (0xFFU<<16)
#define GFXMMU_LUT14L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT14L_FVB           (0xFFU<<8)
#define GFXMMU_LUT14L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT14L_EN            (0x1U<<0)
#define GFXMMU_LUT14L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT14L_EN_B_0X1      (0x1U<<0)

// LUT14H Configuration

#define GFXMMU_LUT14H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT14H_LO_0          (0x1U<<4)

// LUT15L Configuration

#define GFXMMU_LUT15L_LVB           (0xFFU<<16)
#define GFXMMU_LUT15L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT15L_FVB           (0xFFU<<8)
#define GFXMMU_LUT15L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT15L_EN            (0x1U<<0)
#define GFXMMU_LUT15L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT15L_EN_B_0X1      (0x1U<<0)

// LUT15H Configuration

#define GFXMMU_LUT15H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT15H_LO_0          (0x1U<<4)

// LUT16L Configuration

#define GFXMMU_LUT16L_LVB           (0xFFU<<16)
#define GFXMMU_LUT16L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT16L_FVB           (0xFFU<<8)
#define GFXMMU_LUT16L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT16L_EN            (0x1U<<0)
#define GFXMMU_LUT16L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT16L_EN_B_0X1      (0x1U<<0)

// LUT16H Configuration

#define GFXMMU_LUT16H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT16H_LO_0          (0x1U<<4)

// LUT17L Configuration

#define GFXMMU_LUT17L_LVB           (0xFFU<<16)
#define GFXMMU_LUT17L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT17L_FVB           (0xFFU<<8)
#define GFXMMU_LUT17L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT17L_EN            (0x1U<<0)
#define GFXMMU_LUT17L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT17L_EN_B_0X1      (0x1U<<0)

// LUT17H Configuration

#define GFXMMU_LUT17H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT17H_LO_0          (0x1U<<4)

// LUT18L Configuration

#define GFXMMU_LUT18L_LVB           (0xFFU<<16)
#define GFXMMU_LUT18L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT18L_FVB           (0xFFU<<8)
#define GFXMMU_LUT18L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT18L_EN            (0x1U<<0)
#define GFXMMU_LUT18L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT18L_EN_B_0X1      (0x1U<<0)

// LUT18H Configuration

#define GFXMMU_LUT18H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT18H_LO_0          (0x1U<<4)

// LUT19L Configuration

#define GFXMMU_LUT19L_LVB           (0xFFU<<16)
#define GFXMMU_LUT19L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT19L_FVB           (0xFFU<<8)
#define GFXMMU_LUT19L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT19L_EN            (0x1U<<0)
#define GFXMMU_LUT19L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT19L_EN_B_0X1      (0x1U<<0)

// LUT19H Configuration

#define GFXMMU_LUT19H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT19H_LO_0          (0x1U<<4)

// LUT20L Configuration

#define GFXMMU_LUT20L_LVB           (0xFFU<<16)
#define GFXMMU_LUT20L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT20L_FVB           (0xFFU<<8)
#define GFXMMU_LUT20L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT20L_EN            (0x1U<<0)
#define GFXMMU_LUT20L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT20L_EN_B_0X1      (0x1U<<0)

// LUT20H Configuration

#define GFXMMU_LUT20H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT20H_LO_0          (0x1U<<4)

// LUT21L Configuration

#define GFXMMU_LUT21L_LVB           (0xFFU<<16)
#define GFXMMU_LUT21L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT21L_FVB           (0xFFU<<8)
#define GFXMMU_LUT21L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT21L_EN            (0x1U<<0)
#define GFXMMU_LUT21L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT21L_EN_B_0X1      (0x1U<<0)

