Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT21H Configuration

#define GFXMMU_LUT21H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT21H_LO_0          (0x1U<<4)

// LUT22L Configuration

#define GFXMMU_LUT22L_LVB           (0xFFU<<16)
#define GFXMMU_LUT22L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT22L_FVB           (0xFFU<<8)
#define GFXMMU_LUT22L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT22L_EN            (0x1U<<0)
#define GFXMMU_LUT22L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT22L_EN_B_0X1      (0x1U<<0)

// LUT22H Configuration

#define GFXMMU_LUT22H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT22H_LO_0          (0x1U<<4)

// LUT23L Configuration

#define GFXMMU_LUT23L_LVB           (0xFFU<<16)
#define GFXMMU_LUT23L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT23L_FVB           (0xFFU<<8)
#define GFXMMU_LUT23L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT23L_EN            (0x1U<<0)
#define GFXMMU_LUT23L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT23L_EN_B_0X1      (0x1U<<0)

// LUT23H Configuration

#define GFXMMU_LUT23H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT23H_LO_0          (0x1U<<4)

// LUT24L Configuration

#define GFXMMU_LUT24L_LVB           (0xFFU<<16)
#define GFXMMU_LUT24L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT24L_FVB           (0xFFU<<8)
#define GFXMMU_LUT24L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT24L_EN            (0x1U<<0)
#define GFXMMU_LUT24L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT24L_EN_B_0X1      (0x1U<<0)

// LUT24H Configuration

#define GFXMMU_LUT24H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT24H_LO_0          (0x1U<<4)

// LUT25L Configuration

#define GFXMMU_LUT25L_LVB           (0xFFU<<16)
#define GFXMMU_LUT25L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT25L_FVB           (0xFFU<<8)
#define GFXMMU_LUT25L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT25L_EN            (0x1U<<0)
#define GFXMMU_LUT25L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT25L_EN_B_0X1      (0x1U<<0)

// LUT25H Configuration

#define GFXMMU_LUT25H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT25H_LO_0          (0x1U<<4)

// LUT26L Configuration

#define GFXMMU_LUT26L_LVB           (0xFFU<<16)
#define GFXMMU_LUT26L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT26L_FVB           (0xFFU<<8)
#define GFXMMU_LUT26L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT26L_EN            (0x1U<<0)
#define GFXMMU_LUT26L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT26L_EN_B_0X1      (0x1U<<0)

// LUT26H Configuration

#define GFXMMU_LUT26H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT26H_LO_0          (0x1U<<4)

// LUT27L Configuration

#define GFXMMU_LUT27L_LVB           (0xFFU<<16)
#define GFXMMU_LUT27L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT27L_FVB           (0xFFU<<8)
#define GFXMMU_LUT27L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT27L_EN            (0x1U<<0)
#define GFXMMU_LUT27L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT27L_EN_B_0X1      (0x1U<<0)

// LUT27H Configuration

#define GFXMMU_LUT27H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT27H_LO_0          (0x1U<<4)

// LUT28L Configuration

#define GFXMMU_LUT28L_LVB           (0xFFU<<16)
#define GFXMMU_LUT28L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT28L_FVB           (0xFFU<<8)
#define GFXMMU_LUT28L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT28L_EN            (0x1U<<0)
#define GFXMMU_LUT28L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT28L_EN_B_0X1      (0x1U<<0)

// LUT28H Configuration

#define GFXMMU_LUT28H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT28H_LO_0          (0x1U<<4)

// LUT29L Configuration

#define GFXMMU_LUT29L_LVB           (0xFFU<<16)
#define GFXMMU_LUT29L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT29L_FVB           (0xFFU<<8)
#define GFXMMU_LUT29L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT29L_EN            (0x1U<<0)
#define GFXMMU_LUT29L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT29L_EN_B_0X1      (0x1U<<0)

// LUT29H Configuration

#define GFXMMU_LUT29H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT29H_LO_0          (0x1U<<4)

// LUT30L Configuration

#define GFXMMU_LUT30L_LVB           (0xFFU<<16)
#define GFXMMU_LUT30L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT30L_FVB           (0xFFU<<8)
#define GFXMMU_LUT30L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT30L_EN            (0x1U<<0)
#define GFXMMU_LUT30L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT30L_EN_B_0X1      (0x1U<<0)

// LUT30H Configuration

#define GFXMMU_LUT30H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT30H_LO_0          (0x1U<<4)

// LUT31L Configuration

#define GFXMMU_LUT31L_LVB           (0xFFU<<16)
#define GFXMMU_LUT31L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT31L_FVB           (0xFFU<<8)
#define GFXMMU_LUT31L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT31L_EN            (0x1U<<0)
#define GFXMMU_LUT31L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT31L_EN_B_0X1      (0x1U<<0)

// LUT31H Configuration

#define GFXMMU_LUT31H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT31H_LO_0          (0x1U<<4)

// LUT32L Configuration

#define GFXMMU_LUT32L_LVB           (0xFFU<<16)
#define GFXMMU_LUT32L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT32L_FVB           (0xFFU<<8)
#define GFXMMU_LUT32L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT32L_EN            (0x1U<<0)
#define GFXMMU_LUT32L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT32L_EN_B_0X1      (0x1U<<0)

// LUT32H Configuration

#define GFXMMU_LUT32H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT32H_LO_0          (0x1U<<4)

// LUT33L Configuration

#define GFXMMU_LUT33L_LVB           (0xFFU<<16)
#define GFXMMU_LUT33L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT33L_FVB           (0xFFU<<8)
#define GFXMMU_LUT33L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT33L_EN            (0x1U<<0)
#define GFXMMU_LUT33L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT33L_EN_B_0X1      (0x1U<<0)

// LUT33H Configuration

#define GFXMMU_LUT33H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT33H_LO_0          (0x1U<<4)

// LUT34L Configuration

#define GFXMMU_LUT34L_LVB           (0xFFU<<16)
#define GFXMMU_LUT34L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT34L_FVB           (0xFFU<<8)
#define GFXMMU_LUT34L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT34L_EN            (0x1U<<0)
#define GFXMMU_LUT34L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT34L_EN_B_0X1      (0x1U<<0)

// LUT34H Configuration

