Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT47H Configuration

#define GFXMMU_LUT47H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT47H_LO_0          (0x1U<<4)

// LUT48L Configuration

#define GFXMMU_LUT48L_LVB           (0xFFU<<16)
#define GFXMMU_LUT48L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT48L_FVB           (0xFFU<<8)
#define GFXMMU_LUT48L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT48L_EN            (0x1U<<0)
#define GFXMMU_LUT48L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT48L_EN_B_0X1      (0x1U<<0)

// LUT48H Configuration

#define GFXMMU_LUT48H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT48H_LO_0          (0x1U<<4)

// LUT49L Configuration

#define GFXMMU_LUT49L_LVB           (0xFFU<<16)
#define GFXMMU_LUT49L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT49L_FVB           (0xFFU<<8)
#define GFXMMU_LUT49L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT49L_EN            (0x1U<<0)
#define GFXMMU_LUT49L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT49L_EN_B_0X1      (0x1U<<0)

// LUT49H Configuration

#define GFXMMU_LUT49H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT49H_LO_0          (0x1U<<4)

// LUT50L Configuration

#define GFXMMU_LUT50L_LVB           (0xFFU<<16)
#define GFXMMU_LUT50L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT50L_FVB           (0xFFU<<8)
#define GFXMMU_LUT50L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT50L_EN            (0x1U<<0)
#define GFXMMU_LUT50L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT50L_EN_B_0X1      (0x1U<<0)

// LUT50H Configuration

#define GFXMMU_LUT50H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT50H_LO_0          (0x1U<<4)

// LUT51L Configuration

#define GFXMMU_LUT51L_LVB           (0xFFU<<16)
#define GFXMMU_LUT51L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT51L_FVB           (0xFFU<<8)
#define GFXMMU_LUT51L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT51L_EN            (0x1U<<0)
#define GFXMMU_LUT51L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT51L_EN_B_0X1      (0x1U<<0)

// LUT51H Configuration

#define GFXMMU_LUT51H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT51H_LO_0          (0x1U<<4)

// LUT52L Configuration

#define GFXMMU_LUT52L_LVB           (0xFFU<<16)
#define GFXMMU_LUT52L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT52L_FVB           (0xFFU<<8)
#define GFXMMU_LUT52L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT52L_EN            (0x1U<<0)
#define GFXMMU_LUT52L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT52L_EN_B_0X1      (0x1U<<0)

// LUT52H Configuration

#define GFXMMU_LUT52H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT52H_LO_0          (0x1U<<4)

// LUT53L Configuration

#define GFXMMU_LUT53L_LVB           (0xFFU<<16)
#define GFXMMU_LUT53L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT53L_FVB           (0xFFU<<8)
#define GFXMMU_LUT53L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT53L_EN            (0x1U<<0)
#define GFXMMU_LUT53L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT53L_EN_B_0X1      (0x1U<<0)

// LUT53H Configuration

#define GFXMMU_LUT53H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT53H_LO_0          (0x1U<<4)

// LUT54L Configuration

#define GFXMMU_LUT54L_LVB           (0xFFU<<16)
#define GFXMMU_LUT54L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT54L_FVB           (0xFFU<<8)
#define GFXMMU_LUT54L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT54L_EN            (0x1U<<0)
#define GFXMMU_LUT54L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT54L_EN_B_0X1      (0x1U<<0)

// LUT54H Configuration

#define GFXMMU_LUT54H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT54H_LO_0          (0x1U<<4)

// LUT55L Configuration

#define GFXMMU_LUT55L_LVB           (0xFFU<<16)
#define GFXMMU_LUT55L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT55L_FVB           (0xFFU<<8)
#define GFXMMU_LUT55L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT55L_EN            (0x1U<<0)
#define GFXMMU_LUT55L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT55L_EN_B_0X1      (0x1U<<0)

// LUT55H Configuration

#define GFXMMU_LUT55H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT55H_LO_0          (0x1U<<4)

// LUT56L Configuration

#define GFXMMU_LUT56L_LVB           (0xFFU<<16)
#define GFXMMU_LUT56L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT56L_FVB           (0xFFU<<8)
#define GFXMMU_LUT56L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT56L_EN            (0x1U<<0)
#define GFXMMU_LUT56L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT56L_EN_B_0X1      (0x1U<<0)

// LUT56H Configuration

#define GFXMMU_LUT56H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT56H_LO_0          (0x1U<<4)

// LUT57L Configuration

#define GFXMMU_LUT57L_LVB           (0xFFU<<16)
#define GFXMMU_LUT57L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT57L_FVB           (0xFFU<<8)
#define GFXMMU_LUT57L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT57L_EN            (0x1U<<0)
#define GFXMMU_LUT57L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT57L_EN_B_0X1      (0x1U<<0)

// LUT57H Configuration

#define GFXMMU_LUT57H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT57H_LO_0          (0x1U<<4)

// LUT58L Configuration

#define GFXMMU_LUT58L_LVB           (0xFFU<<16)
#define GFXMMU_LUT58L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT58L_FVB           (0xFFU<<8)
#define GFXMMU_LUT58L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT58L_EN            (0x1U<<0)
#define GFXMMU_LUT58L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT58L_EN_B_0X1      (0x1U<<0)

// LUT58H Configuration

#define GFXMMU_LUT58H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT58H_LO_0          (0x1U<<4)

// LUT59L Configuration

#define GFXMMU_LUT59L_LVB           (0xFFU<<16)
#define GFXMMU_LUT59L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT59L_FVB           (0xFFU<<8)
#define GFXMMU_LUT59L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT59L_EN            (0x1U<<0)
#define GFXMMU_LUT59L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT59L_EN_B_0X1      (0x1U<<0)

// LUT59H Configuration

#define GFXMMU_LUT59H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT59H_LO_0          (0x1U<<4)

// LUT60L Configuration

#define GFXMMU_LUT60L_LVB           (0xFFU<<16)
#define GFXMMU_LUT60L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT60L_FVB           (0xFFU<<8)
#define GFXMMU_LUT60L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT60L_EN            (0x1U<<0)
#define GFXMMU_LUT60L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT60L_EN_B_0X1      (0x1U<<0)

// LUT60H Configuration

#define GFXMMU_LUT60H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT60H_LO_0          (0x1U<<4)

