Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT61L Configuration

#define GFXMMU_LUT61L_LVB           (0xFFU<<16)
#define GFXMMU_LUT61L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT61L_FVB           (0xFFU<<8)
#define GFXMMU_LUT61L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT61L_EN            (0x1U<<0)
#define GFXMMU_LUT61L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT61L_EN_B_0X1      (0x1U<<0)

// LUT61H Configuration

#define GFXMMU_LUT61H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT61H_LO_0          (0x1U<<4)

// LUT62L Configuration

#define GFXMMU_LUT62L_LVB           (0xFFU<<16)
#define GFXMMU_LUT62L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT62L_FVB           (0xFFU<<8)
#define GFXMMU_LUT62L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT62L_EN            (0x1U<<0)
#define GFXMMU_LUT62L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT62L_EN_B_0X1      (0x1U<<0)

// LUT62H Configuration

#define GFXMMU_LUT62H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT62H_LO_0          (0x1U<<4)

// LUT63L Configuration

#define GFXMMU_LUT63L_LVB           (0xFFU<<16)
#define GFXMMU_LUT63L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT63L_FVB           (0xFFU<<8)
#define GFXMMU_LUT63L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT63L_EN            (0x1U<<0)
#define GFXMMU_LUT63L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT63L_EN_B_0X1      (0x1U<<0)

// LUT63H Configuration

#define GFXMMU_LUT63H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT63H_LO_0          (0x1U<<4)

// LUT64L Configuration

#define GFXMMU_LUT64L_LVB           (0xFFU<<16)
#define GFXMMU_LUT64L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT64L_FVB           (0xFFU<<8)
#define GFXMMU_LUT64L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT64L_EN            (0x1U<<0)
#define GFXMMU_LUT64L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT64L_EN_B_0X1      (0x1U<<0)

// LUT64H Configuration

#define GFXMMU_LUT64H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT64H_LO_0          (0x1U<<4)

// LUT65L Configuration

#define GFXMMU_LUT65L_LVB           (0xFFU<<16)
#define GFXMMU_LUT65L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT65L_FVB           (0xFFU<<8)
#define GFXMMU_LUT65L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT65L_EN            (0x1U<<0)
#define GFXMMU_LUT65L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT65L_EN_B_0X1      (0x1U<<0)

// LUT65H Configuration

#define GFXMMU_LUT65H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT65H_LO_0          (0x1U<<4)

// LUT66L Configuration

#define GFXMMU_LUT66L_LVB           (0xFFU<<16)
#define GFXMMU_LUT66L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT66L_FVB           (0xFFU<<8)
#define GFXMMU_LUT66L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT66L_EN            (0x1U<<0)
#define GFXMMU_LUT66L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT66L_EN_B_0X1      (0x1U<<0)

// LUT66H Configuration

#define GFXMMU_LUT66H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT66H_LO_0          (0x1U<<4)

// LUT67L Configuration

#define GFXMMU_LUT67L_LVB           (0xFFU<<16)
#define GFXMMU_LUT67L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT67L_FVB           (0xFFU<<8)
#define GFXMMU_LUT67L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT67L_EN            (0x1U<<0)
#define GFXMMU_LUT67L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT67L_EN_B_0X1      (0x1U<<0)

// LUT67H Configuration

#define GFXMMU_LUT67H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT67H_LO_0          (0x1U<<4)

// LUT68L Configuration

#define GFXMMU_LUT68L_LVB           (0xFFU<<16)
#define GFXMMU_LUT68L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT68L_FVB           (0xFFU<<8)
#define GFXMMU_LUT68L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT68L_EN            (0x1U<<0)
#define GFXMMU_LUT68L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT68L_EN_B_0X1      (0x1U<<0)

// LUT68H Configuration

#define GFXMMU_LUT68H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT68H_LO_0          (0x1U<<4)

// LUT69L Configuration

#define GFXMMU_LUT69L_LVB           (0xFFU<<16)
#define GFXMMU_LUT69L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT69L_FVB           (0xFFU<<8)
#define GFXMMU_LUT69L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT69L_EN            (0x1U<<0)
#define GFXMMU_LUT69L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT69L_EN_B_0X1      (0x1U<<0)

// LUT69H Configuration

#define GFXMMU_LUT69H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT69H_LO_0          (0x1U<<4)

// LUT70L Configuration

#define GFXMMU_LUT70L_LVB           (0xFFU<<16)
#define GFXMMU_LUT70L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT70L_FVB           (0xFFU<<8)
#define GFXMMU_LUT70L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT70L_EN            (0x1U<<0)
#define GFXMMU_LUT70L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT70L_EN_B_0X1      (0x1U<<0)

// LUT70H Configuration

#define GFXMMU_LUT70H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT70H_LO_0          (0x1U<<4)

// LUT71L Configuration

#define GFXMMU_LUT71L_LVB           (0xFFU<<16)
#define GFXMMU_LUT71L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT71L_FVB           (0xFFU<<8)
#define GFXMMU_LUT71L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT71L_EN            (0x1U<<0)
#define GFXMMU_LUT71L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT71L_EN_B_0X1      (0x1U<<0)

// LUT71H Configuration

#define GFXMMU_LUT71H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT71H_LO_0          (0x1U<<4)

// LUT72L Configuration

#define GFXMMU_LUT72L_LVB           (0xFFU<<16)
#define GFXMMU_LUT72L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT72L_FVB           (0xFFU<<8)
#define GFXMMU_LUT72L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT72L_EN            (0x1U<<0)
#define GFXMMU_LUT72L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT72L_EN_B_0X1      (0x1U<<0)

// LUT72H Configuration

#define GFXMMU_LUT72H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT72H_LO_0          (0x1U<<4)

// LUT73L Configuration

#define GFXMMU_LUT73L_LVB           (0xFFU<<16)
#define GFXMMU_LUT73L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT73L_FVB           (0xFFU<<8)
#define GFXMMU_LUT73L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT73L_EN            (0x1U<<0)
#define GFXMMU_LUT73L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT73L_EN_B_0X1      (0x1U<<0)

// LUT73H Configuration

