Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT73H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT73H_LO_0          (0x1U<<4)

// LUT74L Configuration

#define GFXMMU_LUT74L_LVB           (0xFFU<<16)
#define GFXMMU_LUT74L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT74L_FVB           (0xFFU<<8)
#define GFXMMU_LUT74L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT74L_EN            (0x1U<<0)
#define GFXMMU_LUT74L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT74L_EN_B_0X1      (0x1U<<0)

// LUT74H Configuration

#define GFXMMU_LUT74H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT74H_LO_0          (0x1U<<4)

// LUT75L Configuration

#define GFXMMU_LUT75L_LVB           (0xFFU<<16)
#define GFXMMU_LUT75L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT75L_FVB           (0xFFU<<8)
#define GFXMMU_LUT75L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT75L_EN            (0x1U<<0)
#define GFXMMU_LUT75L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT75L_EN_B_0X1      (0x1U<<0)

// LUT75H Configuration

#define GFXMMU_LUT75H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT75H_LO_0          (0x1U<<4)

// LUT76L Configuration

#define GFXMMU_LUT76L_LVB           (0xFFU<<16)
#define GFXMMU_LUT76L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT76L_FVB           (0xFFU<<8)
#define GFXMMU_LUT76L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT76L_EN            (0x1U<<0)
#define GFXMMU_LUT76L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT76L_EN_B_0X1      (0x1U<<0)

// LUT76H Configuration

#define GFXMMU_LUT76H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT76H_LO_0          (0x1U<<4)

// LUT77L Configuration

#define GFXMMU_LUT77L_LVB           (0xFFU<<16)
#define GFXMMU_LUT77L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT77L_FVB           (0xFFU<<8)
#define GFXMMU_LUT77L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT77L_EN            (0x1U<<0)
#define GFXMMU_LUT77L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT77L_EN_B_0X1      (0x1U<<0)

// LUT77H Configuration

#define GFXMMU_LUT77H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT77H_LO_0          (0x1U<<4)

// LUT78L Configuration

#define GFXMMU_LUT78L_LVB           (0xFFU<<16)
#define GFXMMU_LUT78L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT78L_FVB           (0xFFU<<8)
#define GFXMMU_LUT78L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT78L_EN            (0x1U<<0)
#define GFXMMU_LUT78L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT78L_EN_B_0X1      (0x1U<<0)

// LUT78H Configuration

#define GFXMMU_LUT78H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT78H_LO_0          (0x1U<<4)

// LUT79L Configuration

#define GFXMMU_LUT79L_LVB           (0xFFU<<16)
#define GFXMMU_LUT79L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT79L_FVB           (0xFFU<<8)
#define GFXMMU_LUT79L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT79L_EN            (0x1U<<0)
#define GFXMMU_LUT79L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT79L_EN_B_0X1      (0x1U<<0)

// LUT79H Configuration

#define GFXMMU_LUT79H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT79H_LO_0          (0x1U<<4)

// LUT80L Configuration

#define GFXMMU_LUT80L_LVB           (0xFFU<<16)
#define GFXMMU_LUT80L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT80L_FVB           (0xFFU<<8)
#define GFXMMU_LUT80L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT80L_EN            (0x1U<<0)
#define GFXMMU_LUT80L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT80L_EN_B_0X1      (0x1U<<0)

// LUT80H Configuration

#define GFXMMU_LUT80H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT80H_LO_0          (0x1U<<4)

// LUT81L Configuration

#define GFXMMU_LUT81L_LVB           (0xFFU<<16)
#define GFXMMU_LUT81L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT81L_FVB           (0xFFU<<8)
#define GFXMMU_LUT81L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT81L_EN            (0x1U<<0)
#define GFXMMU_LUT81L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT81L_EN_B_0X1      (0x1U<<0)

// LUT81H Configuration

#define GFXMMU_LUT81H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT81H_LO_0          (0x1U<<4)

// LUT82L Configuration

#define GFXMMU_LUT82L_LVB           (0xFFU<<16)
#define GFXMMU_LUT82L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT82L_FVB           (0xFFU<<8)
#define GFXMMU_LUT82L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT82L_EN            (0x1U<<0)
#define GFXMMU_LUT82L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT82L_EN_B_0X1      (0x1U<<0)

// LUT82H Configuration

#define GFXMMU_LUT82H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT82H_LO_0          (0x1U<<4)

// LUT83L Configuration

#define GFXMMU_LUT83L_LVB           (0xFFU<<16)
#define GFXMMU_LUT83L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT83L_FVB           (0xFFU<<8)
#define GFXMMU_LUT83L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT83L_EN            (0x1U<<0)
#define GFXMMU_LUT83L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT83L_EN_B_0X1      (0x1U<<0)

// LUT83H Configuration

#define GFXMMU_LUT83H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT83H_LO_0          (0x1U<<4)

// LUT84L Configuration

#define GFXMMU_LUT84L_LVB           (0xFFU<<16)
#define GFXMMU_LUT84L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT84L_FVB           (0xFFU<<8)
#define GFXMMU_LUT84L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT84L_EN            (0x1U<<0)
#define GFXMMU_LUT84L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT84L_EN_B_0X1      (0x1U<<0)

// LUT84H Configuration

#define GFXMMU_LUT84H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT84H_LO_0          (0x1U<<4)

// LUT85L Configuration

#define GFXMMU_LUT85L_LVB           (0xFFU<<16)
#define GFXMMU_LUT85L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT85L_FVB           (0xFFU<<8)
#define GFXMMU_LUT85L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT85L_EN            (0x1U<<0)
#define GFXMMU_LUT85L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT85L_EN_B_0X1      (0x1U<<0)

// LUT85H Configuration

#define GFXMMU_LUT85H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT85H_LO_0          (0x1U<<4)

// LUT86L Configuration

#define GFXMMU_LUT86L_LVB           (0xFFU<<16)
#define GFXMMU_LUT86L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT86L_FVB           (0xFFU<<8)
#define GFXMMU_LUT86L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT86L_EN            (0x1U<<0)
#define GFXMMU_LUT86L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT86L_EN_B_0X1      (0x1U<<0)

