Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT86H Configuration

#define GFXMMU_LUT86H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT86H_LO_0          (0x1U<<4)

// LUT87L Configuration

#define GFXMMU_LUT87L_LVB           (0xFFU<<16)
#define GFXMMU_LUT87L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT87L_FVB           (0xFFU<<8)
#define GFXMMU_LUT87L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT87L_EN            (0x1U<<0)
#define GFXMMU_LUT87L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT87L_EN_B_0X1      (0x1U<<0)

// LUT87H Configuration

#define GFXMMU_LUT87H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT87H_LO_0          (0x1U<<4)

// LUT88L Configuration

#define GFXMMU_LUT88L_LVB           (0xFFU<<16)
#define GFXMMU_LUT88L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT88L_FVB           (0xFFU<<8)
#define GFXMMU_LUT88L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT88L_EN            (0x1U<<0)
#define GFXMMU_LUT88L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT88L_EN_B_0X1      (0x1U<<0)

// LUT88H Configuration

#define GFXMMU_LUT88H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT88H_LO_0          (0x1U<<4)

// LUT89L Configuration

#define GFXMMU_LUT89L_LVB           (0xFFU<<16)
#define GFXMMU_LUT89L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT89L_FVB           (0xFFU<<8)
#define GFXMMU_LUT89L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT89L_EN            (0x1U<<0)
#define GFXMMU_LUT89L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT89L_EN_B_0X1      (0x1U<<0)

// LUT89H Configuration

#define GFXMMU_LUT89H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT89H_LO_0          (0x1U<<4)

// LUT90L Configuration

#define GFXMMU_LUT90L_LVB           (0xFFU<<16)
#define GFXMMU_LUT90L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT90L_FVB           (0xFFU<<8)
#define GFXMMU_LUT90L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT90L_EN            (0x1U<<0)
#define GFXMMU_LUT90L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT90L_EN_B_0X1      (0x1U<<0)

// LUT90H Configuration

#define GFXMMU_LUT90H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT90H_LO_0          (0x1U<<4)

// LUT91L Configuration

#define GFXMMU_LUT91L_LVB           (0xFFU<<16)
#define GFXMMU_LUT91L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT91L_FVB           (0xFFU<<8)
#define GFXMMU_LUT91L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT91L_EN            (0x1U<<0)
#define GFXMMU_LUT91L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT91L_EN_B_0X1      (0x1U<<0)

// LUT91H Configuration

#define GFXMMU_LUT91H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT91H_LO_0          (0x1U<<4)

// LUT92L Configuration

#define GFXMMU_LUT92L_LVB           (0xFFU<<16)
#define GFXMMU_LUT92L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT92L_FVB           (0xFFU<<8)
#define GFXMMU_LUT92L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT92L_EN            (0x1U<<0)
#define GFXMMU_LUT92L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT92L_EN_B_0X1      (0x1U<<0)

// LUT92H Configuration

#define GFXMMU_LUT92H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT92H_LO_0          (0x1U<<4)

// LUT93L Configuration

#define GFXMMU_LUT93L_LVB           (0xFFU<<16)
#define GFXMMU_LUT93L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT93L_FVB           (0xFFU<<8)
#define GFXMMU_LUT93L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT93L_EN            (0x1U<<0)
#define GFXMMU_LUT93L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT93L_EN_B_0X1      (0x1U<<0)

// LUT93H Configuration

#define GFXMMU_LUT93H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT93H_LO_0          (0x1U<<4)

// LUT94L Configuration

#define GFXMMU_LUT94L_LVB           (0xFFU<<16)
#define GFXMMU_LUT94L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT94L_FVB           (0xFFU<<8)
#define GFXMMU_LUT94L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT94L_EN            (0x1U<<0)
#define GFXMMU_LUT94L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT94L_EN_B_0X1      (0x1U<<0)

// LUT94H Configuration

#define GFXMMU_LUT94H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT94H_LO_0          (0x1U<<4)

// LUT95L Configuration

#define GFXMMU_LUT95L_LVB           (0xFFU<<16)
#define GFXMMU_LUT95L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT95L_FVB           (0xFFU<<8)
#define GFXMMU_LUT95L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT95L_EN            (0x1U<<0)
#define GFXMMU_LUT95L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT95L_EN_B_0X1      (0x1U<<0)

// LUT95H Configuration

#define GFXMMU_LUT95H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT95H_LO_0          (0x1U<<4)

// LUT96L Configuration

#define GFXMMU_LUT96L_LVB           (0xFFU<<16)
#define GFXMMU_LUT96L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT96L_FVB           (0xFFU<<8)
#define GFXMMU_LUT96L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT96L_EN            (0x1U<<0)
#define GFXMMU_LUT96L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT96L_EN_B_0X1      (0x1U<<0)

// LUT96H Configuration

#define GFXMMU_LUT96H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT96H_LO_0          (0x1U<<4)

// LUT97L Configuration

#define GFXMMU_LUT97L_LVB           (0xFFU<<16)
#define GFXMMU_LUT97L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT97L_FVB           (0xFFU<<8)
#define GFXMMU_LUT97L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT97L_EN            (0x1U<<0)
#define GFXMMU_LUT97L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT97L_EN_B_0X1      (0x1U<<0)

// LUT97H Configuration

#define GFXMMU_LUT97H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT97H_LO_0          (0x1U<<4)

// LUT98L Configuration

#define GFXMMU_LUT98L_LVB           (0xFFU<<16)
#define GFXMMU_LUT98L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT98L_FVB           (0xFFU<<8)
#define GFXMMU_LUT98L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT98L_EN            (0x1U<<0)
#define GFXMMU_LUT98L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT98L_EN_B_0X1      (0x1U<<0)

// LUT98H Configuration

#define GFXMMU_LUT98H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT98H_LO_0          (0x1U<<4)

// LUT99L Configuration

#define GFXMMU_LUT99L_LVB           (0xFFU<<16)
#define GFXMMU_LUT99L_LVB_0         (0x1U<<16)
#define GFXMMU_LUT99L_FVB           (0xFFU<<8)
#define GFXMMU_LUT99L_FVB_0         (0x1U<<8)
#define GFXMMU_LUT99L_EN            (0x1U<<0)
#define GFXMMU_LUT99L_EN_B_0X0      (0x0U<<0)
#define GFXMMU_LUT99L_EN_B_0X1      (0x1U<<0)

// LUT99H Configuration

#define GFXMMU_LUT99H_LO            (0x3FFFFU<<4)
#define GFXMMU_LUT99H_LO_0          (0x1U<<4)

