Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT100L Configuration

#define GFXMMU_LUT100L_LVB          (0xFFU<<16)
#define GFXMMU_LUT100L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT100L_FVB          (0xFFU<<8)
#define GFXMMU_LUT100L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT100L_EN           (0x1U<<0)
#define GFXMMU_LUT100L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT100L_EN_B_0X1     (0x1U<<0)

// LUT100H Configuration

#define GFXMMU_LUT100H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT100H_LO_0         (0x1U<<4)

// LUT101L Configuration

#define GFXMMU_LUT101L_LVB          (0xFFU<<16)
#define GFXMMU_LUT101L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT101L_FVB          (0xFFU<<8)
#define GFXMMU_LUT101L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT101L_EN           (0x1U<<0)
#define GFXMMU_LUT101L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT101L_EN_B_0X1     (0x1U<<0)

// LUT101H Configuration

#define GFXMMU_LUT101H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT101H_LO_0         (0x1U<<4)

// LUT102L Configuration

#define GFXMMU_LUT102L_LVB          (0xFFU<<16)
#define GFXMMU_LUT102L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT102L_FVB          (0xFFU<<8)
#define GFXMMU_LUT102L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT102L_EN           (0x1U<<0)
#define GFXMMU_LUT102L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT102L_EN_B_0X1     (0x1U<<0)

// LUT102H Configuration

#define GFXMMU_LUT102H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT102H_LO_0         (0x1U<<4)

// LUT103L Configuration

#define GFXMMU_LUT103L_LVB          (0xFFU<<16)
#define GFXMMU_LUT103L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT103L_FVB          (0xFFU<<8)
#define GFXMMU_LUT103L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT103L_EN           (0x1U<<0)
#define GFXMMU_LUT103L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT103L_EN_B_0X1     (0x1U<<0)

// LUT103H Configuration

#define GFXMMU_LUT103H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT103H_LO_0         (0x1U<<4)

// LUT104L Configuration

#define GFXMMU_LUT104L_LVB          (0xFFU<<16)
#define GFXMMU_LUT104L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT104L_FVB          (0xFFU<<8)
#define GFXMMU_LUT104L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT104L_EN           (0x1U<<0)
#define GFXMMU_LUT104L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT104L_EN_B_0X1     (0x1U<<0)

// LUT104H Configuration

#define GFXMMU_LUT104H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT104H_LO_0         (0x1U<<4)

// LUT105L Configuration

#define GFXMMU_LUT105L_LVB          (0xFFU<<16)
#define GFXMMU_LUT105L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT105L_FVB          (0xFFU<<8)
#define GFXMMU_LUT105L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT105L_EN           (0x1U<<0)
#define GFXMMU_LUT105L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT105L_EN_B_0X1     (0x1U<<0)

// LUT105H Configuration

#define GFXMMU_LUT105H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT105H_LO_0         (0x1U<<4)

// LUT106L Configuration

#define GFXMMU_LUT106L_LVB          (0xFFU<<16)
#define GFXMMU_LUT106L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT106L_FVB          (0xFFU<<8)
#define GFXMMU_LUT106L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT106L_EN           (0x1U<<0)
#define GFXMMU_LUT106L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT106L_EN_B_0X1     (0x1U<<0)

// LUT106H Configuration

#define GFXMMU_LUT106H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT106H_LO_0         (0x1U<<4)

// LUT107L Configuration

#define GFXMMU_LUT107L_LVB          (0xFFU<<16)
#define GFXMMU_LUT107L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT107L_FVB          (0xFFU<<8)
#define GFXMMU_LUT107L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT107L_EN           (0x1U<<0)
#define GFXMMU_LUT107L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT107L_EN_B_0X1     (0x1U<<0)

// LUT107H Configuration

#define GFXMMU_LUT107H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT107H_LO_0         (0x1U<<4)

// LUT108L Configuration

#define GFXMMU_LUT108L_LVB          (0xFFU<<16)
#define GFXMMU_LUT108L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT108L_FVB          (0xFFU<<8)
#define GFXMMU_LUT108L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT108L_EN           (0x1U<<0)
#define GFXMMU_LUT108L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT108L_EN_B_0X1     (0x1U<<0)

// LUT108H Configuration

#define GFXMMU_LUT108H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT108H_LO_0         (0x1U<<4)

// LUT109L Configuration

#define GFXMMU_LUT109L_LVB          (0xFFU<<16)
#define GFXMMU_LUT109L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT109L_FVB          (0xFFU<<8)
#define GFXMMU_LUT109L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT109L_EN           (0x1U<<0)
#define GFXMMU_LUT109L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT109L_EN_B_0X1     (0x1U<<0)

// LUT109H Configuration

#define GFXMMU_LUT109H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT109H_LO_0         (0x1U<<4)

// LUT110L Configuration

#define GFXMMU_LUT110L_LVB          (0xFFU<<16)
#define GFXMMU_LUT110L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT110L_FVB          (0xFFU<<8)
#define GFXMMU_LUT110L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT110L_EN           (0x1U<<0)
#define GFXMMU_LUT110L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT110L_EN_B_0X1     (0x1U<<0)

// LUT110H Configuration

#define GFXMMU_LUT110H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT110H_LO_0         (0x1U<<4)

// LUT111L Configuration

#define GFXMMU_LUT111L_LVB          (0xFFU<<16)
#define GFXMMU_LUT111L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT111L_FVB          (0xFFU<<8)
#define GFXMMU_LUT111L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT111L_EN           (0x1U<<0)
#define GFXMMU_LUT111L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT111L_EN_B_0X1     (0x1U<<0)

// LUT111H Configuration

#define GFXMMU_LUT111H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT111H_LO_0         (0x1U<<4)

// LUT112L Configuration

#define GFXMMU_LUT112L_LVB          (0xFFU<<16)
#define GFXMMU_LUT112L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT112L_FVB          (0xFFU<<8)
#define GFXMMU_LUT112L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT112L_EN           (0x1U<<0)
#define GFXMMU_LUT112L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT112L_EN_B_0X1     (0x1U<<0)

// LUT112H Configuration

#define GFXMMU_LUT112H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT112H_LO_0         (0x1U<<4)

// LUT113L Configuration

#define GFXMMU_LUT113L_LVB          (0xFFU<<16)
#define GFXMMU_LUT113L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT113L_FVB          (0xFFU<<8)
#define GFXMMU_LUT113L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT113L_EN           (0x1U<<0)
#define GFXMMU_LUT113L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT113L_EN_B_0X1     (0x1U<<0)

// LUT113H Configuration

#define GFXMMU_LUT113H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT113H_LO_0         (0x1U<<4)

