Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT114L Configuration

#define GFXMMU_LUT114L_LVB          (0xFFU<<16)
#define GFXMMU_LUT114L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT114L_FVB          (0xFFU<<8)
#define GFXMMU_LUT114L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT114L_EN           (0x1U<<0)
#define GFXMMU_LUT114L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT114L_EN_B_0X1     (0x1U<<0)

// LUT114H Configuration

#define GFXMMU_LUT114H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT114H_LO_0         (0x1U<<4)

// LUT115L Configuration

#define GFXMMU_LUT115L_LVB          (0xFFU<<16)
#define GFXMMU_LUT115L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT115L_FVB          (0xFFU<<8)
#define GFXMMU_LUT115L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT115L_EN           (0x1U<<0)
#define GFXMMU_LUT115L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT115L_EN_B_0X1     (0x1U<<0)

// LUT115H Configuration

#define GFXMMU_LUT115H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT115H_LO_0         (0x1U<<4)

// LUT116L Configuration

#define GFXMMU_LUT116L_LVB          (0xFFU<<16)
#define GFXMMU_LUT116L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT116L_FVB          (0xFFU<<8)
#define GFXMMU_LUT116L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT116L_EN           (0x1U<<0)
#define GFXMMU_LUT116L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT116L_EN_B_0X1     (0x1U<<0)

// LUT116H Configuration

#define GFXMMU_LUT116H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT116H_LO_0         (0x1U<<4)

// LUT117L Configuration

#define GFXMMU_LUT117L_LVB          (0xFFU<<16)
#define GFXMMU_LUT117L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT117L_FVB          (0xFFU<<8)
#define GFXMMU_LUT117L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT117L_EN           (0x1U<<0)
#define GFXMMU_LUT117L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT117L_EN_B_0X1     (0x1U<<0)

// LUT117H Configuration

#define GFXMMU_LUT117H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT117H_LO_0         (0x1U<<4)

// LUT118L Configuration

#define GFXMMU_LUT118L_LVB          (0xFFU<<16)
#define GFXMMU_LUT118L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT118L_FVB          (0xFFU<<8)
#define GFXMMU_LUT118L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT118L_EN           (0x1U<<0)
#define GFXMMU_LUT118L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT118L_EN_B_0X1     (0x1U<<0)

// LUT118H Configuration

#define GFXMMU_LUT118H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT118H_LO_0         (0x1U<<4)

// LUT119L Configuration

#define GFXMMU_LUT119L_LVB          (0xFFU<<16)
#define GFXMMU_LUT119L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT119L_FVB          (0xFFU<<8)
#define GFXMMU_LUT119L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT119L_EN           (0x1U<<0)
#define GFXMMU_LUT119L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT119L_EN_B_0X1     (0x1U<<0)

// LUT119H Configuration

#define GFXMMU_LUT119H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT119H_LO_0         (0x1U<<4)

// LUT120L Configuration

#define GFXMMU_LUT120L_LVB          (0xFFU<<16)
#define GFXMMU_LUT120L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT120L_FVB          (0xFFU<<8)
#define GFXMMU_LUT120L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT120L_EN           (0x1U<<0)
#define GFXMMU_LUT120L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT120L_EN_B_0X1     (0x1U<<0)

// LUT120H Configuration

#define GFXMMU_LUT120H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT120H_LO_0         (0x1U<<4)

// LUT121L Configuration

#define GFXMMU_LUT121L_LVB          (0xFFU<<16)
#define GFXMMU_LUT121L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT121L_FVB          (0xFFU<<8)
#define GFXMMU_LUT121L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT121L_EN           (0x1U<<0)
#define GFXMMU_LUT121L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT121L_EN_B_0X1     (0x1U<<0)

// LUT121H Configuration

#define GFXMMU_LUT121H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT121H_LO_0         (0x1U<<4)

// LUT122L Configuration

#define GFXMMU_LUT122L_LVB          (0xFFU<<16)
#define GFXMMU_LUT122L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT122L_FVB          (0xFFU<<8)
#define GFXMMU_LUT122L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT122L_EN           (0x1U<<0)
#define GFXMMU_LUT122L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT122L_EN_B_0X1     (0x1U<<0)

// LUT122H Configuration

#define GFXMMU_LUT122H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT122H_LO_0         (0x1U<<4)

// LUT123L Configuration

#define GFXMMU_LUT123L_LVB          (0xFFU<<16)
#define GFXMMU_LUT123L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT123L_FVB          (0xFFU<<8)
#define GFXMMU_LUT123L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT123L_EN           (0x1U<<0)
#define GFXMMU_LUT123L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT123L_EN_B_0X1     (0x1U<<0)

// LUT123H Configuration

#define GFXMMU_LUT123H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT123H_LO_0         (0x1U<<4)

// LUT124L Configuration

#define GFXMMU_LUT124L_LVB          (0xFFU<<16)
#define GFXMMU_LUT124L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT124L_FVB          (0xFFU<<8)
#define GFXMMU_LUT124L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT124L_EN           (0x1U<<0)
#define GFXMMU_LUT124L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT124L_EN_B_0X1     (0x1U<<0)

// LUT124H Configuration

#define GFXMMU_LUT124H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT124H_LO_0         (0x1U<<4)

// LUT125L Configuration

#define GFXMMU_LUT125L_LVB          (0xFFU<<16)
#define GFXMMU_LUT125L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT125L_FVB          (0xFFU<<8)
#define GFXMMU_LUT125L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT125L_EN           (0x1U<<0)
#define GFXMMU_LUT125L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT125L_EN_B_0X1     (0x1U<<0)

// LUT125H Configuration

#define GFXMMU_LUT125H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT125H_LO_0         (0x1U<<4)

// LUT126L Configuration

#define GFXMMU_LUT126L_LVB          (0xFFU<<16)
#define GFXMMU_LUT126L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT126L_FVB          (0xFFU<<8)
#define GFXMMU_LUT126L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT126L_EN           (0x1U<<0)
#define GFXMMU_LUT126L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT126L_EN_B_0X1     (0x1U<<0)

