Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT126H Configuration

#define GFXMMU_LUT126H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT126H_LO_0         (0x1U<<4)

// LUT127L Configuration

#define GFXMMU_LUT127L_LVB          (0xFFU<<16)
#define GFXMMU_LUT127L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT127L_FVB          (0xFFU<<8)
#define GFXMMU_LUT127L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT127L_EN           (0x1U<<0)
#define GFXMMU_LUT127L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT127L_EN_B_0X1     (0x1U<<0)

// LUT127H Configuration

#define GFXMMU_LUT127H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT127H_LO_0         (0x1U<<4)

// LUT128L Configuration

#define GFXMMU_LUT128L_LVB          (0xFFU<<16)
#define GFXMMU_LUT128L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT128L_FVB          (0xFFU<<8)
#define GFXMMU_LUT128L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT128L_EN           (0x1U<<0)
#define GFXMMU_LUT128L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT128L_EN_B_0X1     (0x1U<<0)

// LUT128H Configuration

#define GFXMMU_LUT128H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT128H_LO_0         (0x1U<<4)

// LUT129L Configuration

#define GFXMMU_LUT129L_LVB          (0xFFU<<16)
#define GFXMMU_LUT129L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT129L_FVB          (0xFFU<<8)
#define GFXMMU_LUT129L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT129L_EN           (0x1U<<0)
#define GFXMMU_LUT129L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT129L_EN_B_0X1     (0x1U<<0)

// LUT129H Configuration

#define GFXMMU_LUT129H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT129H_LO_0         (0x1U<<4)

// LUT130L Configuration

#define GFXMMU_LUT130L_LVB          (0xFFU<<16)
#define GFXMMU_LUT130L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT130L_FVB          (0xFFU<<8)
#define GFXMMU_LUT130L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT130L_EN           (0x1U<<0)
#define GFXMMU_LUT130L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT130L_EN_B_0X1     (0x1U<<0)

// LUT130H Configuration

#define GFXMMU_LUT130H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT130H_LO_0         (0x1U<<4)

// LUT131L Configuration

#define GFXMMU_LUT131L_LVB          (0xFFU<<16)
#define GFXMMU_LUT131L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT131L_FVB          (0xFFU<<8)
#define GFXMMU_LUT131L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT131L_EN           (0x1U<<0)
#define GFXMMU_LUT131L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT131L_EN_B_0X1     (0x1U<<0)

// LUT131H Configuration

#define GFXMMU_LUT131H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT131H_LO_0         (0x1U<<4)

// LUT132L Configuration

#define GFXMMU_LUT132L_LVB          (0xFFU<<16)
#define GFXMMU_LUT132L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT132L_FVB          (0xFFU<<8)
#define GFXMMU_LUT132L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT132L_EN           (0x1U<<0)
#define GFXMMU_LUT132L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT132L_EN_B_0X1     (0x1U<<0)

// LUT132H Configuration

#define GFXMMU_LUT132H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT132H_LO_0         (0x1U<<4)

// LUT133L Configuration

#define GFXMMU_LUT133L_LVB          (0xFFU<<16)
#define GFXMMU_LUT133L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT133L_FVB          (0xFFU<<8)
#define GFXMMU_LUT133L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT133L_EN           (0x1U<<0)
#define GFXMMU_LUT133L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT133L_EN_B_0X1     (0x1U<<0)

// LUT133H Configuration

#define GFXMMU_LUT133H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT133H_LO_0         (0x1U<<4)

// LUT134L Configuration

#define GFXMMU_LUT134L_LVB          (0xFFU<<16)
#define GFXMMU_LUT134L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT134L_FVB          (0xFFU<<8)
#define GFXMMU_LUT134L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT134L_EN           (0x1U<<0)
#define GFXMMU_LUT134L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT134L_EN_B_0X1     (0x1U<<0)

// LUT134H Configuration

#define GFXMMU_LUT134H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT134H_LO_0         (0x1U<<4)

// LUT135L Configuration

#define GFXMMU_LUT135L_LVB          (0xFFU<<16)
#define GFXMMU_LUT135L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT135L_FVB          (0xFFU<<8)
#define GFXMMU_LUT135L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT135L_EN           (0x1U<<0)
#define GFXMMU_LUT135L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT135L_EN_B_0X1     (0x1U<<0)

// LUT135H Configuration

#define GFXMMU_LUT135H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT135H_LO_0         (0x1U<<4)

// LUT136L Configuration

#define GFXMMU_LUT136L_LVB          (0xFFU<<16)
#define GFXMMU_LUT136L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT136L_FVB          (0xFFU<<8)
#define GFXMMU_LUT136L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT136L_EN           (0x1U<<0)
#define GFXMMU_LUT136L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT136L_EN_B_0X1     (0x1U<<0)

// LUT136H Configuration

#define GFXMMU_LUT136H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT136H_LO_0         (0x1U<<4)

// LUT137L Configuration

#define GFXMMU_LUT137L_LVB          (0xFFU<<16)
#define GFXMMU_LUT137L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT137L_FVB          (0xFFU<<8)
#define GFXMMU_LUT137L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT137L_EN           (0x1U<<0)
#define GFXMMU_LUT137L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT137L_EN_B_0X1     (0x1U<<0)

// LUT137H Configuration

#define GFXMMU_LUT137H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT137H_LO_0         (0x1U<<4)

// LUT138L Configuration

#define GFXMMU_LUT138L_LVB          (0xFFU<<16)
#define GFXMMU_LUT138L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT138L_FVB          (0xFFU<<8)
#define GFXMMU_LUT138L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT138L_EN           (0x1U<<0)
#define GFXMMU_LUT138L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT138L_EN_B_0X1     (0x1U<<0)

// LUT138H Configuration

#define GFXMMU_LUT138H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT138H_LO_0         (0x1U<<4)

// LUT139L Configuration

#define GFXMMU_LUT139L_LVB          (0xFFU<<16)
#define GFXMMU_LUT139L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT139L_FVB          (0xFFU<<8)
#define GFXMMU_LUT139L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT139L_EN           (0x1U<<0)
#define GFXMMU_LUT139L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT139L_EN_B_0X1     (0x1U<<0)

// LUT139H Configuration

