Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT139H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT139H_LO_0         (0x1U<<4)

// LUT140L Configuration

#define GFXMMU_LUT140L_LVB          (0xFFU<<16)
#define GFXMMU_LUT140L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT140L_FVB          (0xFFU<<8)
#define GFXMMU_LUT140L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT140L_EN           (0x1U<<0)
#define GFXMMU_LUT140L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT140L_EN_B_0X1     (0x1U<<0)

// LUT140H Configuration

#define GFXMMU_LUT140H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT140H_LO_0         (0x1U<<4)

// LUT141L Configuration

#define GFXMMU_LUT141L_LVB          (0xFFU<<16)
#define GFXMMU_LUT141L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT141L_FVB          (0xFFU<<8)
#define GFXMMU_LUT141L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT141L_EN           (0x1U<<0)
#define GFXMMU_LUT141L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT141L_EN_B_0X1     (0x1U<<0)

// LUT141H Configuration

#define GFXMMU_LUT141H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT141H_LO_0         (0x1U<<4)

// LUT142L Configuration

#define GFXMMU_LUT142L_LVB          (0xFFU<<16)
#define GFXMMU_LUT142L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT142L_FVB          (0xFFU<<8)
#define GFXMMU_LUT142L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT142L_EN           (0x1U<<0)
#define GFXMMU_LUT142L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT142L_EN_B_0X1     (0x1U<<0)

// LUT142H Configuration

#define GFXMMU_LUT142H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT142H_LO_0         (0x1U<<4)

// LUT143L Configuration

#define GFXMMU_LUT143L_LVB          (0xFFU<<16)
#define GFXMMU_LUT143L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT143L_FVB          (0xFFU<<8)
#define GFXMMU_LUT143L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT143L_EN           (0x1U<<0)
#define GFXMMU_LUT143L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT143L_EN_B_0X1     (0x1U<<0)

// LUT143H Configuration

#define GFXMMU_LUT143H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT143H_LO_0         (0x1U<<4)

// LUT144L Configuration

#define GFXMMU_LUT144L_LVB          (0xFFU<<16)
#define GFXMMU_LUT144L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT144L_FVB          (0xFFU<<8)
#define GFXMMU_LUT144L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT144L_EN           (0x1U<<0)
#define GFXMMU_LUT144L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT144L_EN_B_0X1     (0x1U<<0)

// LUT144H Configuration

#define GFXMMU_LUT144H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT144H_LO_0         (0x1U<<4)

// LUT145L Configuration

#define GFXMMU_LUT145L_LVB          (0xFFU<<16)
#define GFXMMU_LUT145L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT145L_FVB          (0xFFU<<8)
#define GFXMMU_LUT145L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT145L_EN           (0x1U<<0)
#define GFXMMU_LUT145L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT145L_EN_B_0X1     (0x1U<<0)

// LUT145H Configuration

#define GFXMMU_LUT145H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT145H_LO_0         (0x1U<<4)

// LUT146L Configuration

#define GFXMMU_LUT146L_LVB          (0xFFU<<16)
#define GFXMMU_LUT146L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT146L_FVB          (0xFFU<<8)
#define GFXMMU_LUT146L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT146L_EN           (0x1U<<0)
#define GFXMMU_LUT146L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT146L_EN_B_0X1     (0x1U<<0)

// LUT146H Configuration

#define GFXMMU_LUT146H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT146H_LO_0         (0x1U<<4)

// LUT147L Configuration

#define GFXMMU_LUT147L_LVB          (0xFFU<<16)
#define GFXMMU_LUT147L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT147L_FVB          (0xFFU<<8)
#define GFXMMU_LUT147L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT147L_EN           (0x1U<<0)
#define GFXMMU_LUT147L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT147L_EN_B_0X1     (0x1U<<0)

// LUT147H Configuration

#define GFXMMU_LUT147H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT147H_LO_0         (0x1U<<4)

// LUT148L Configuration

#define GFXMMU_LUT148L_LVB          (0xFFU<<16)
#define GFXMMU_LUT148L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT148L_FVB          (0xFFU<<8)
#define GFXMMU_LUT148L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT148L_EN           (0x1U<<0)
#define GFXMMU_LUT148L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT148L_EN_B_0X1     (0x1U<<0)

// LUT148H Configuration

#define GFXMMU_LUT148H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT148H_LO_0         (0x1U<<4)

// LUT149L Configuration

#define GFXMMU_LUT149L_LVB          (0xFFU<<16)
#define GFXMMU_LUT149L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT149L_FVB          (0xFFU<<8)
#define GFXMMU_LUT149L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT149L_EN           (0x1U<<0)
#define GFXMMU_LUT149L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT149L_EN_B_0X1     (0x1U<<0)

// LUT149H Configuration

#define GFXMMU_LUT149H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT149H_LO_0         (0x1U<<4)

// LUT150L Configuration

#define GFXMMU_LUT150L_LVB          (0xFFU<<16)
#define GFXMMU_LUT150L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT150L_FVB          (0xFFU<<8)
#define GFXMMU_LUT150L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT150L_EN           (0x1U<<0)
#define GFXMMU_LUT150L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT150L_EN_B_0X1     (0x1U<<0)

// LUT150H Configuration

#define GFXMMU_LUT150H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT150H_LO_0         (0x1U<<4)

// LUT151L Configuration

#define GFXMMU_LUT151L_LVB          (0xFFU<<16)
#define GFXMMU_LUT151L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT151L_FVB          (0xFFU<<8)
#define GFXMMU_LUT151L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT151L_EN           (0x1U<<0)
#define GFXMMU_LUT151L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT151L_EN_B_0X1     (0x1U<<0)

// LUT151H Configuration

#define GFXMMU_LUT151H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT151H_LO_0         (0x1U<<4)

// LUT152L Configuration

#define GFXMMU_LUT152L_LVB          (0xFFU<<16)
#define GFXMMU_LUT152L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT152L_FVB          (0xFFU<<8)
#define GFXMMU_LUT152L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT152L_EN           (0x1U<<0)
#define GFXMMU_LUT152L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT152L_EN_B_0X1     (0x1U<<0)

