Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT178H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT178H_LO_0         (0x1U<<4)

// LUT179L Configuration

#define GFXMMU_LUT179L_LVB          (0xFFU<<16)
#define GFXMMU_LUT179L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT179L_FVB          (0xFFU<<8)
#define GFXMMU_LUT179L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT179L_EN           (0x1U<<0)
#define GFXMMU_LUT179L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT179L_EN_B_0X1     (0x1U<<0)

// LUT179H Configuration

#define GFXMMU_LUT179H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT179H_LO_0         (0x1U<<4)

// LUT180L Configuration

#define GFXMMU_LUT180L_LVB          (0xFFU<<16)
#define GFXMMU_LUT180L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT180L_FVB          (0xFFU<<8)
#define GFXMMU_LUT180L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT180L_EN           (0x1U<<0)
#define GFXMMU_LUT180L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT180L_EN_B_0X1     (0x1U<<0)

// LUT180H Configuration

#define GFXMMU_LUT180H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT180H_LO_0         (0x1U<<4)

// LUT181L Configuration

#define GFXMMU_LUT181L_LVB          (0xFFU<<16)
#define GFXMMU_LUT181L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT181L_FVB          (0xFFU<<8)
#define GFXMMU_LUT181L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT181L_EN           (0x1U<<0)
#define GFXMMU_LUT181L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT181L_EN_B_0X1     (0x1U<<0)

// LUT181H Configuration

#define GFXMMU_LUT181H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT181H_LO_0         (0x1U<<4)

// LUT182L Configuration

#define GFXMMU_LUT182L_LVB          (0xFFU<<16)
#define GFXMMU_LUT182L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT182L_FVB          (0xFFU<<8)
#define GFXMMU_LUT182L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT182L_EN           (0x1U<<0)
#define GFXMMU_LUT182L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT182L_EN_B_0X1     (0x1U<<0)

// LUT182H Configuration

#define GFXMMU_LUT182H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT182H_LO_0         (0x1U<<4)

// LUT183L Configuration

#define GFXMMU_LUT183L_LVB          (0xFFU<<16)
#define GFXMMU_LUT183L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT183L_FVB          (0xFFU<<8)
#define GFXMMU_LUT183L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT183L_EN           (0x1U<<0)
#define GFXMMU_LUT183L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT183L_EN_B_0X1     (0x1U<<0)

// LUT183H Configuration

#define GFXMMU_LUT183H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT183H_LO_0         (0x1U<<4)

// LUT184L Configuration

#define GFXMMU_LUT184L_LVB          (0xFFU<<16)
#define GFXMMU_LUT184L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT184L_FVB          (0xFFU<<8)
#define GFXMMU_LUT184L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT184L_EN           (0x1U<<0)
#define GFXMMU_LUT184L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT184L_EN_B_0X1     (0x1U<<0)

// LUT184H Configuration

#define GFXMMU_LUT184H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT184H_LO_0         (0x1U<<4)

// LUT185L Configuration

#define GFXMMU_LUT185L_LVB          (0xFFU<<16)
#define GFXMMU_LUT185L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT185L_FVB          (0xFFU<<8)
#define GFXMMU_LUT185L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT185L_EN           (0x1U<<0)
#define GFXMMU_LUT185L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT185L_EN_B_0X1     (0x1U<<0)

// LUT185H Configuration

#define GFXMMU_LUT185H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT185H_LO_0         (0x1U<<4)

// LUT186L Configuration

#define GFXMMU_LUT186L_LVB          (0xFFU<<16)
#define GFXMMU_LUT186L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT186L_FVB          (0xFFU<<8)
#define GFXMMU_LUT186L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT186L_EN           (0x1U<<0)
#define GFXMMU_LUT186L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT186L_EN_B_0X1     (0x1U<<0)

// LUT186H Configuration

#define GFXMMU_LUT186H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT186H_LO_0         (0x1U<<4)

// LUT187L Configuration

#define GFXMMU_LUT187L_LVB          (0xFFU<<16)
#define GFXMMU_LUT187L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT187L_FVB          (0xFFU<<8)
#define GFXMMU_LUT187L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT187L_EN           (0x1U<<0)
#define GFXMMU_LUT187L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT187L_EN_B_0X1     (0x1U<<0)

// LUT187H Configuration

#define GFXMMU_LUT187H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT187H_LO_0         (0x1U<<4)

// LUT188L Configuration

#define GFXMMU_LUT188L_LVB          (0xFFU<<16)
#define GFXMMU_LUT188L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT188L_FVB          (0xFFU<<8)
#define GFXMMU_LUT188L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT188L_EN           (0x1U<<0)
#define GFXMMU_LUT188L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT188L_EN_B_0X1     (0x1U<<0)

// LUT188H Configuration

#define GFXMMU_LUT188H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT188H_LO_0         (0x1U<<4)

// LUT189L Configuration

#define GFXMMU_LUT189L_LVB          (0xFFU<<16)
#define GFXMMU_LUT189L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT189L_FVB          (0xFFU<<8)
#define GFXMMU_LUT189L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT189L_EN           (0x1U<<0)
#define GFXMMU_LUT189L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT189L_EN_B_0X1     (0x1U<<0)

// LUT189H Configuration

#define GFXMMU_LUT189H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT189H_LO_0         (0x1U<<4)

// LUT190L Configuration

#define GFXMMU_LUT190L_LVB          (0xFFU<<16)
#define GFXMMU_LUT190L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT190L_FVB          (0xFFU<<8)
#define GFXMMU_LUT190L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT190L_EN           (0x1U<<0)
#define GFXMMU_LUT190L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT190L_EN_B_0X1     (0x1U<<0)

// LUT190H Configuration

#define GFXMMU_LUT190H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT190H_LO_0         (0x1U<<4)

// LUT191L Configuration

#define GFXMMU_LUT191L_LVB          (0xFFU<<16)
#define GFXMMU_LUT191L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT191L_FVB          (0xFFU<<8)
#define GFXMMU_LUT191L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT191L_EN           (0x1U<<0)
#define GFXMMU_LUT191L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT191L_EN_B_0X1     (0x1U<<0)

// LUT191H Configuration

#define GFXMMU_LUT191H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT191H_LO_0         (0x1U<<4)

// LUT192L Configuration

