Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT217H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT217H_LO_0         (0x1U<<4)

// LUT218L Configuration

#define GFXMMU_LUT218L_LVB          (0xFFU<<16)
#define GFXMMU_LUT218L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT218L_FVB          (0xFFU<<8)
#define GFXMMU_LUT218L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT218L_EN           (0x1U<<0)
#define GFXMMU_LUT218L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT218L_EN_B_0X1     (0x1U<<0)

// LUT218H Configuration

#define GFXMMU_LUT218H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT218H_LO_0         (0x1U<<4)

// LUT219L Configuration

#define GFXMMU_LUT219L_LVB          (0xFFU<<16)
#define GFXMMU_LUT219L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT219L_FVB          (0xFFU<<8)
#define GFXMMU_LUT219L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT219L_EN           (0x1U<<0)
#define GFXMMU_LUT219L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT219L_EN_B_0X1     (0x1U<<0)

// LUT219H Configuration

#define GFXMMU_LUT219H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT219H_LO_0         (0x1U<<4)

// LUT220L Configuration

#define GFXMMU_LUT220L_LVB          (0xFFU<<16)
#define GFXMMU_LUT220L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT220L_FVB          (0xFFU<<8)
#define GFXMMU_LUT220L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT220L_EN           (0x1U<<0)
#define GFXMMU_LUT220L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT220L_EN_B_0X1     (0x1U<<0)

// LUT220H Configuration

#define GFXMMU_LUT220H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT220H_LO_0         (0x1U<<4)

// LUT221L Configuration

#define GFXMMU_LUT221L_LVB          (0xFFU<<16)
#define GFXMMU_LUT221L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT221L_FVB          (0xFFU<<8)
#define GFXMMU_LUT221L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT221L_EN           (0x1U<<0)
#define GFXMMU_LUT221L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT221L_EN_B_0X1     (0x1U<<0)

// LUT221H Configuration

#define GFXMMU_LUT221H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT221H_LO_0         (0x1U<<4)

// LUT222L Configuration

#define GFXMMU_LUT222L_LVB          (0xFFU<<16)
#define GFXMMU_LUT222L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT222L_FVB          (0xFFU<<8)
#define GFXMMU_LUT222L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT222L_EN           (0x1U<<0)
#define GFXMMU_LUT222L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT222L_EN_B_0X1     (0x1U<<0)

// LUT222H Configuration

#define GFXMMU_LUT222H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT222H_LO_0         (0x1U<<4)

// LUT223L Configuration

#define GFXMMU_LUT223L_LVB          (0xFFU<<16)
#define GFXMMU_LUT223L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT223L_FVB          (0xFFU<<8)
#define GFXMMU_LUT223L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT223L_EN           (0x1U<<0)
#define GFXMMU_LUT223L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT223L_EN_B_0X1     (0x1U<<0)

// LUT223H Configuration

#define GFXMMU_LUT223H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT223H_LO_0         (0x1U<<4)

// LUT224L Configuration

#define GFXMMU_LUT224L_LVB          (0xFFU<<16)
#define GFXMMU_LUT224L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT224L_FVB          (0xFFU<<8)
#define GFXMMU_LUT224L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT224L_EN           (0x1U<<0)
#define GFXMMU_LUT224L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT224L_EN_B_0X1     (0x1U<<0)

// LUT224H Configuration

#define GFXMMU_LUT224H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT224H_LO_0         (0x1U<<4)

// LUT225L Configuration

#define GFXMMU_LUT225L_LVB          (0xFFU<<16)
#define GFXMMU_LUT225L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT225L_FVB          (0xFFU<<8)
#define GFXMMU_LUT225L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT225L_EN           (0x1U<<0)
#define GFXMMU_LUT225L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT225L_EN_B_0X1     (0x1U<<0)

// LUT225H Configuration

#define GFXMMU_LUT225H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT225H_LO_0         (0x1U<<4)

// LUT226L Configuration

#define GFXMMU_LUT226L_LVB          (0xFFU<<16)
#define GFXMMU_LUT226L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT226L_FVB          (0xFFU<<8)
#define GFXMMU_LUT226L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT226L_EN           (0x1U<<0)
#define GFXMMU_LUT226L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT226L_EN_B_0X1     (0x1U<<0)

// LUT226H Configuration

#define GFXMMU_LUT226H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT226H_LO_0         (0x1U<<4)

// LUT227L Configuration

#define GFXMMU_LUT227L_LVB          (0xFFU<<16)
#define GFXMMU_LUT227L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT227L_FVB          (0xFFU<<8)
#define GFXMMU_LUT227L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT227L_EN           (0x1U<<0)
#define GFXMMU_LUT227L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT227L_EN_B_0X1     (0x1U<<0)

// LUT227H Configuration

#define GFXMMU_LUT227H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT227H_LO_0         (0x1U<<4)

// LUT228L Configuration

#define GFXMMU_LUT228L_LVB          (0xFFU<<16)
#define GFXMMU_LUT228L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT228L_FVB          (0xFFU<<8)
#define GFXMMU_LUT228L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT228L_EN           (0x1U<<0)
#define GFXMMU_LUT228L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT228L_EN_B_0X1     (0x1U<<0)

// LUT228H Configuration

#define GFXMMU_LUT228H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT228H_LO_0         (0x1U<<4)

// LUT229L Configuration

#define GFXMMU_LUT229L_LVB          (0xFFU<<16)
#define GFXMMU_LUT229L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT229L_FVB          (0xFFU<<8)
#define GFXMMU_LUT229L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT229L_EN           (0x1U<<0)
#define GFXMMU_LUT229L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT229L_EN_B_0X1     (0x1U<<0)

// LUT229H Configuration

#define GFXMMU_LUT229H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT229H_LO_0         (0x1U<<4)

// LUT230L Configuration

#define GFXMMU_LUT230L_LVB          (0xFFU<<16)
#define GFXMMU_LUT230L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT230L_FVB          (0xFFU<<8)
#define GFXMMU_LUT230L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT230L_EN           (0x1U<<0)
#define GFXMMU_LUT230L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT230L_EN_B_0X1     (0x1U<<0)

// LUT230H Configuration

#define GFXMMU_LUT230H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT230H_LO_0         (0x1U<<4)

// LUT231L Configuration

#define GFXMMU_LUT231L_LVB          (0xFFU<<16)
#define GFXMMU_LUT231L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT231L_FVB          (0xFFU<<8)
#define GFXMMU_LUT231L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT231L_EN           (0x1U<<0)
#define GFXMMU_LUT231L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT231L_EN_B_0X1     (0x1U<<0)

