Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT231H Configuration

#define GFXMMU_LUT231H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT231H_LO_0         (0x1U<<4)

// LUT232L Configuration

#define GFXMMU_LUT232L_LVB          (0xFFU<<16)
#define GFXMMU_LUT232L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT232L_FVB          (0xFFU<<8)
#define GFXMMU_LUT232L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT232L_EN           (0x1U<<0)
#define GFXMMU_LUT232L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT232L_EN_B_0X1     (0x1U<<0)

// LUT232H Configuration

#define GFXMMU_LUT232H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT232H_LO_0         (0x1U<<4)

// LUT233L Configuration

#define GFXMMU_LUT233L_LVB          (0xFFU<<16)
#define GFXMMU_LUT233L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT233L_FVB          (0xFFU<<8)
#define GFXMMU_LUT233L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT233L_EN           (0x1U<<0)
#define GFXMMU_LUT233L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT233L_EN_B_0X1     (0x1U<<0)

// LUT233H Configuration

#define GFXMMU_LUT233H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT233H_LO_0         (0x1U<<4)

// LUT234L Configuration

#define GFXMMU_LUT234L_LVB          (0xFFU<<16)
#define GFXMMU_LUT234L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT234L_FVB          (0xFFU<<8)
#define GFXMMU_LUT234L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT234L_EN           (0x1U<<0)
#define GFXMMU_LUT234L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT234L_EN_B_0X1     (0x1U<<0)

// LUT234H Configuration

#define GFXMMU_LUT234H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT234H_LO_0         (0x1U<<4)

// LUT235L Configuration

#define GFXMMU_LUT235L_LVB          (0xFFU<<16)
#define GFXMMU_LUT235L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT235L_FVB          (0xFFU<<8)
#define GFXMMU_LUT235L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT235L_EN           (0x1U<<0)
#define GFXMMU_LUT235L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT235L_EN_B_0X1     (0x1U<<0)

// LUT235H Configuration

#define GFXMMU_LUT235H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT235H_LO_0         (0x1U<<4)

// LUT236L Configuration

#define GFXMMU_LUT236L_LVB          (0xFFU<<16)
#define GFXMMU_LUT236L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT236L_FVB          (0xFFU<<8)
#define GFXMMU_LUT236L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT236L_EN           (0x1U<<0)
#define GFXMMU_LUT236L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT236L_EN_B_0X1     (0x1U<<0)

// LUT236H Configuration

#define GFXMMU_LUT236H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT236H_LO_0         (0x1U<<4)

// LUT237L Configuration

#define GFXMMU_LUT237L_LVB          (0xFFU<<16)
#define GFXMMU_LUT237L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT237L_FVB          (0xFFU<<8)
#define GFXMMU_LUT237L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT237L_EN           (0x1U<<0)
#define GFXMMU_LUT237L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT237L_EN_B_0X1     (0x1U<<0)

// LUT237H Configuration

#define GFXMMU_LUT237H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT237H_LO_0         (0x1U<<4)

// LUT238L Configuration

#define GFXMMU_LUT238L_LVB          (0xFFU<<16)
#define GFXMMU_LUT238L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT238L_FVB          (0xFFU<<8)
#define GFXMMU_LUT238L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT238L_EN           (0x1U<<0)
#define GFXMMU_LUT238L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT238L_EN_B_0X1     (0x1U<<0)

// LUT238H Configuration

#define GFXMMU_LUT238H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT238H_LO_0         (0x1U<<4)

// LUT239L Configuration

#define GFXMMU_LUT239L_LVB          (0xFFU<<16)
#define GFXMMU_LUT239L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT239L_FVB          (0xFFU<<8)
#define GFXMMU_LUT239L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT239L_EN           (0x1U<<0)
#define GFXMMU_LUT239L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT239L_EN_B_0X1     (0x1U<<0)

// LUT239H Configuration

#define GFXMMU_LUT239H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT239H_LO_0         (0x1U<<4)

// LUT240L Configuration

#define GFXMMU_LUT240L_LVB          (0xFFU<<16)
#define GFXMMU_LUT240L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT240L_FVB          (0xFFU<<8)
#define GFXMMU_LUT240L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT240L_EN           (0x1U<<0)
#define GFXMMU_LUT240L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT240L_EN_B_0X1     (0x1U<<0)

// LUT240H Configuration

#define GFXMMU_LUT240H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT240H_LO_0         (0x1U<<4)

// LUT241L Configuration

#define GFXMMU_LUT241L_LVB          (0xFFU<<16)
#define GFXMMU_LUT241L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT241L_FVB          (0xFFU<<8)
#define GFXMMU_LUT241L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT241L_EN           (0x1U<<0)
#define GFXMMU_LUT241L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT241L_EN_B_0X1     (0x1U<<0)

// LUT241H Configuration

#define GFXMMU_LUT241H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT241H_LO_0         (0x1U<<4)

// LUT242L Configuration

#define GFXMMU_LUT242L_LVB          (0xFFU<<16)
#define GFXMMU_LUT242L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT242L_FVB          (0xFFU<<8)
#define GFXMMU_LUT242L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT242L_EN           (0x1U<<0)
#define GFXMMU_LUT242L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT242L_EN_B_0X1     (0x1U<<0)

// LUT242H Configuration

#define GFXMMU_LUT242H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT242H_LO_0         (0x1U<<4)

// LUT243L Configuration

#define GFXMMU_LUT243L_LVB          (0xFFU<<16)
#define GFXMMU_LUT243L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT243L_FVB          (0xFFU<<8)
#define GFXMMU_LUT243L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT243L_EN           (0x1U<<0)
#define GFXMMU_LUT243L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT243L_EN_B_0X1     (0x1U<<0)

// LUT243H Configuration

#define GFXMMU_LUT243H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT243H_LO_0         (0x1U<<4)

// LUT244L Configuration

#define GFXMMU_LUT244L_LVB          (0xFFU<<16)
#define GFXMMU_LUT244L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT244L_FVB          (0xFFU<<8)
#define GFXMMU_LUT244L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT244L_EN           (0x1U<<0)
#define GFXMMU_LUT244L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT244L_EN_B_0X1     (0x1U<<0)

// LUT244H Configuration

