Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT244H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT244H_LO_0         (0x1U<<4)

// LUT245L Configuration

#define GFXMMU_LUT245L_LVB          (0xFFU<<16)
#define GFXMMU_LUT245L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT245L_FVB          (0xFFU<<8)
#define GFXMMU_LUT245L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT245L_EN           (0x1U<<0)
#define GFXMMU_LUT245L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT245L_EN_B_0X1     (0x1U<<0)

// LUT245H Configuration

#define GFXMMU_LUT245H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT245H_LO_0         (0x1U<<4)

// LUT246L Configuration

#define GFXMMU_LUT246L_LVB          (0xFFU<<16)
#define GFXMMU_LUT246L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT246L_FVB          (0xFFU<<8)
#define GFXMMU_LUT246L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT246L_EN           (0x1U<<0)
#define GFXMMU_LUT246L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT246L_EN_B_0X1     (0x1U<<0)

// LUT246H Configuration

#define GFXMMU_LUT246H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT246H_LO_0         (0x1U<<4)

// LUT247L Configuration

#define GFXMMU_LUT247L_LVB          (0xFFU<<16)
#define GFXMMU_LUT247L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT247L_FVB          (0xFFU<<8)
#define GFXMMU_LUT247L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT247L_EN           (0x1U<<0)
#define GFXMMU_LUT247L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT247L_EN_B_0X1     (0x1U<<0)

// LUT247H Configuration

#define GFXMMU_LUT247H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT247H_LO_0         (0x1U<<4)

// LUT248L Configuration

#define GFXMMU_LUT248L_LVB          (0xFFU<<16)
#define GFXMMU_LUT248L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT248L_FVB          (0xFFU<<8)
#define GFXMMU_LUT248L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT248L_EN           (0x1U<<0)
#define GFXMMU_LUT248L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT248L_EN_B_0X1     (0x1U<<0)

// LUT248H Configuration

#define GFXMMU_LUT248H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT248H_LO_0         (0x1U<<4)

// LUT249L Configuration

#define GFXMMU_LUT249L_LVB          (0xFFU<<16)
#define GFXMMU_LUT249L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT249L_FVB          (0xFFU<<8)
#define GFXMMU_LUT249L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT249L_EN           (0x1U<<0)
#define GFXMMU_LUT249L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT249L_EN_B_0X1     (0x1U<<0)

// LUT249H Configuration

#define GFXMMU_LUT249H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT249H_LO_0         (0x1U<<4)

// LUT250L Configuration

#define GFXMMU_LUT250L_LVB          (0xFFU<<16)
#define GFXMMU_LUT250L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT250L_FVB          (0xFFU<<8)
#define GFXMMU_LUT250L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT250L_EN           (0x1U<<0)
#define GFXMMU_LUT250L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT250L_EN_B_0X1     (0x1U<<0)

// LUT250H Configuration

#define GFXMMU_LUT250H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT250H_LO_0         (0x1U<<4)

// LUT251L Configuration

#define GFXMMU_LUT251L_LVB          (0xFFU<<16)
#define GFXMMU_LUT251L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT251L_FVB          (0xFFU<<8)
#define GFXMMU_LUT251L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT251L_EN           (0x1U<<0)
#define GFXMMU_LUT251L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT251L_EN_B_0X1     (0x1U<<0)

// LUT251H Configuration

#define GFXMMU_LUT251H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT251H_LO_0         (0x1U<<4)

// LUT252L Configuration

#define GFXMMU_LUT252L_LVB          (0xFFU<<16)
#define GFXMMU_LUT252L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT252L_FVB          (0xFFU<<8)
#define GFXMMU_LUT252L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT252L_EN           (0x1U<<0)
#define GFXMMU_LUT252L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT252L_EN_B_0X1     (0x1U<<0)

// LUT252H Configuration

#define GFXMMU_LUT252H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT252H_LO_0         (0x1U<<4)

// LUT253L Configuration

#define GFXMMU_LUT253L_LVB          (0xFFU<<16)
#define GFXMMU_LUT253L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT253L_FVB          (0xFFU<<8)
#define GFXMMU_LUT253L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT253L_EN           (0x1U<<0)
#define GFXMMU_LUT253L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT253L_EN_B_0X1     (0x1U<<0)

// LUT253H Configuration

#define GFXMMU_LUT253H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT253H_LO_0         (0x1U<<4)

// LUT254L Configuration

#define GFXMMU_LUT254L_LVB          (0xFFU<<16)
#define GFXMMU_LUT254L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT254L_FVB          (0xFFU<<8)
#define GFXMMU_LUT254L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT254L_EN           (0x1U<<0)
#define GFXMMU_LUT254L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT254L_EN_B_0X1     (0x1U<<0)

// LUT254H Configuration

#define GFXMMU_LUT254H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT254H_LO_0         (0x1U<<4)

// LUT255L Configuration

#define GFXMMU_LUT255L_LVB          (0xFFU<<16)
#define GFXMMU_LUT255L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT255L_FVB          (0xFFU<<8)
#define GFXMMU_LUT255L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT255L_EN           (0x1U<<0)
#define GFXMMU_LUT255L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT255L_EN_B_0X1     (0x1U<<0)

// LUT255H Configuration

#define GFXMMU_LUT255H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT255H_LO_0         (0x1U<<4)

// LUT256L Configuration

#define GFXMMU_LUT256L_LVB          (0xFFU<<16)
#define GFXMMU_LUT256L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT256L_FVB          (0xFFU<<8)
#define GFXMMU_LUT256L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT256L_EN           (0x1U<<0)
#define GFXMMU_LUT256L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT256L_EN_B_0X1     (0x1U<<0)

// LUT256H Configuration

#define GFXMMU_LUT256H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT256H_LO_0         (0x1U<<4)

// LUT257L Configuration

#define GFXMMU_LUT257L_LVB          (0xFFU<<16)
#define GFXMMU_LUT257L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT257L_FVB          (0xFFU<<8)
#define GFXMMU_LUT257L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT257L_EN           (0x1U<<0)
#define GFXMMU_LUT257L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT257L_EN_B_0X1     (0x1U<<0)

