Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT257H Configuration

#define GFXMMU_LUT257H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT257H_LO_0         (0x1U<<4)

// LUT258L Configuration

#define GFXMMU_LUT258L_LVB          (0xFFU<<16)
#define GFXMMU_LUT258L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT258L_FVB          (0xFFU<<8)
#define GFXMMU_LUT258L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT258L_EN           (0x1U<<0)
#define GFXMMU_LUT258L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT258L_EN_B_0X1     (0x1U<<0)

// LUT258H Configuration

#define GFXMMU_LUT258H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT258H_LO_0         (0x1U<<4)

// LUT259L Configuration

#define GFXMMU_LUT259L_LVB          (0xFFU<<16)
#define GFXMMU_LUT259L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT259L_FVB          (0xFFU<<8)
#define GFXMMU_LUT259L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT259L_EN           (0x1U<<0)
#define GFXMMU_LUT259L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT259L_EN_B_0X1     (0x1U<<0)

// LUT259H Configuration

#define GFXMMU_LUT259H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT259H_LO_0         (0x1U<<4)

// LUT260L Configuration

#define GFXMMU_LUT260L_LVB          (0xFFU<<16)
#define GFXMMU_LUT260L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT260L_FVB          (0xFFU<<8)
#define GFXMMU_LUT260L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT260L_EN           (0x1U<<0)
#define GFXMMU_LUT260L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT260L_EN_B_0X1     (0x1U<<0)

// LUT260H Configuration

#define GFXMMU_LUT260H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT260H_LO_0         (0x1U<<4)

// LUT261L Configuration

#define GFXMMU_LUT261L_LVB          (0xFFU<<16)
#define GFXMMU_LUT261L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT261L_FVB          (0xFFU<<8)
#define GFXMMU_LUT261L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT261L_EN           (0x1U<<0)
#define GFXMMU_LUT261L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT261L_EN_B_0X1     (0x1U<<0)

// LUT261H Configuration

#define GFXMMU_LUT261H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT261H_LO_0         (0x1U<<4)

// LUT262L Configuration

#define GFXMMU_LUT262L_LVB          (0xFFU<<16)
#define GFXMMU_LUT262L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT262L_FVB          (0xFFU<<8)
#define GFXMMU_LUT262L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT262L_EN           (0x1U<<0)
#define GFXMMU_LUT262L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT262L_EN_B_0X1     (0x1U<<0)

// LUT262H Configuration

#define GFXMMU_LUT262H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT262H_LO_0         (0x1U<<4)

// LUT263L Configuration

#define GFXMMU_LUT263L_LVB          (0xFFU<<16)
#define GFXMMU_LUT263L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT263L_FVB          (0xFFU<<8)
#define GFXMMU_LUT263L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT263L_EN           (0x1U<<0)
#define GFXMMU_LUT263L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT263L_EN_B_0X1     (0x1U<<0)

// LUT263H Configuration

#define GFXMMU_LUT263H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT263H_LO_0         (0x1U<<4)

// LUT264L Configuration

#define GFXMMU_LUT264L_LVB          (0xFFU<<16)
#define GFXMMU_LUT264L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT264L_FVB          (0xFFU<<8)
#define GFXMMU_LUT264L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT264L_EN           (0x1U<<0)
#define GFXMMU_LUT264L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT264L_EN_B_0X1     (0x1U<<0)

// LUT264H Configuration

#define GFXMMU_LUT264H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT264H_LO_0         (0x1U<<4)

// LUT265L Configuration

#define GFXMMU_LUT265L_LVB          (0xFFU<<16)
#define GFXMMU_LUT265L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT265L_FVB          (0xFFU<<8)
#define GFXMMU_LUT265L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT265L_EN           (0x1U<<0)
#define GFXMMU_LUT265L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT265L_EN_B_0X1     (0x1U<<0)

// LUT265H Configuration

#define GFXMMU_LUT265H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT265H_LO_0         (0x1U<<4)

// LUT266L Configuration

#define GFXMMU_LUT266L_LVB          (0xFFU<<16)
#define GFXMMU_LUT266L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT266L_FVB          (0xFFU<<8)
#define GFXMMU_LUT266L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT266L_EN           (0x1U<<0)
#define GFXMMU_LUT266L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT266L_EN_B_0X1     (0x1U<<0)

// LUT266H Configuration

#define GFXMMU_LUT266H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT266H_LO_0         (0x1U<<4)

// LUT267L Configuration

#define GFXMMU_LUT267L_LVB          (0xFFU<<16)
#define GFXMMU_LUT267L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT267L_FVB          (0xFFU<<8)
#define GFXMMU_LUT267L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT267L_EN           (0x1U<<0)
#define GFXMMU_LUT267L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT267L_EN_B_0X1     (0x1U<<0)

// LUT267H Configuration

#define GFXMMU_LUT267H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT267H_LO_0         (0x1U<<4)

// LUT268L Configuration

#define GFXMMU_LUT268L_LVB          (0xFFU<<16)
#define GFXMMU_LUT268L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT268L_FVB          (0xFFU<<8)
#define GFXMMU_LUT268L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT268L_EN           (0x1U<<0)
#define GFXMMU_LUT268L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT268L_EN_B_0X1     (0x1U<<0)

// LUT268H Configuration

#define GFXMMU_LUT268H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT268H_LO_0         (0x1U<<4)

// LUT269L Configuration

#define GFXMMU_LUT269L_LVB          (0xFFU<<16)
#define GFXMMU_LUT269L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT269L_FVB          (0xFFU<<8)
#define GFXMMU_LUT269L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT269L_EN           (0x1U<<0)
#define GFXMMU_LUT269L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT269L_EN_B_0X1     (0x1U<<0)

// LUT269H Configuration

#define GFXMMU_LUT269H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT269H_LO_0         (0x1U<<4)

// LUT270L Configuration

#define GFXMMU_LUT270L_LVB          (0xFFU<<16)
#define GFXMMU_LUT270L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT270L_FVB          (0xFFU<<8)
#define GFXMMU_LUT270L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT270L_EN           (0x1U<<0)
#define GFXMMU_LUT270L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT270L_EN_B_0X1     (0x1U<<0)

// LUT270H Configuration

#define GFXMMU_LUT270H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT270H_LO_0         (0x1U<<4)

