Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT271L Configuration

#define GFXMMU_LUT271L_LVB          (0xFFU<<16)
#define GFXMMU_LUT271L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT271L_FVB          (0xFFU<<8)
#define GFXMMU_LUT271L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT271L_EN           (0x1U<<0)
#define GFXMMU_LUT271L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT271L_EN_B_0X1     (0x1U<<0)

// LUT271H Configuration

#define GFXMMU_LUT271H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT271H_LO_0         (0x1U<<4)

// LUT272L Configuration

#define GFXMMU_LUT272L_LVB          (0xFFU<<16)
#define GFXMMU_LUT272L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT272L_FVB          (0xFFU<<8)
#define GFXMMU_LUT272L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT272L_EN           (0x1U<<0)
#define GFXMMU_LUT272L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT272L_EN_B_0X1     (0x1U<<0)

// LUT272H Configuration

#define GFXMMU_LUT272H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT272H_LO_0         (0x1U<<4)

// LUT273L Configuration

#define GFXMMU_LUT273L_LVB          (0xFFU<<16)
#define GFXMMU_LUT273L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT273L_FVB          (0xFFU<<8)
#define GFXMMU_LUT273L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT273L_EN           (0x1U<<0)
#define GFXMMU_LUT273L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT273L_EN_B_0X1     (0x1U<<0)

// LUT273H Configuration

#define GFXMMU_LUT273H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT273H_LO_0         (0x1U<<4)

// LUT274L Configuration

#define GFXMMU_LUT274L_LVB          (0xFFU<<16)
#define GFXMMU_LUT274L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT274L_FVB          (0xFFU<<8)
#define GFXMMU_LUT274L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT274L_EN           (0x1U<<0)
#define GFXMMU_LUT274L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT274L_EN_B_0X1     (0x1U<<0)

// LUT274H Configuration

#define GFXMMU_LUT274H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT274H_LO_0         (0x1U<<4)

// LUT275L Configuration

#define GFXMMU_LUT275L_LVB          (0xFFU<<16)
#define GFXMMU_LUT275L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT275L_FVB          (0xFFU<<8)
#define GFXMMU_LUT275L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT275L_EN           (0x1U<<0)
#define GFXMMU_LUT275L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT275L_EN_B_0X1     (0x1U<<0)

// LUT275H Configuration

#define GFXMMU_LUT275H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT275H_LO_0         (0x1U<<4)

// LUT276L Configuration

#define GFXMMU_LUT276L_LVB          (0xFFU<<16)
#define GFXMMU_LUT276L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT276L_FVB          (0xFFU<<8)
#define GFXMMU_LUT276L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT276L_EN           (0x1U<<0)
#define GFXMMU_LUT276L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT276L_EN_B_0X1     (0x1U<<0)

// LUT276H Configuration

#define GFXMMU_LUT276H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT276H_LO_0         (0x1U<<4)

// LUT277L Configuration

#define GFXMMU_LUT277L_LVB          (0xFFU<<16)
#define GFXMMU_LUT277L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT277L_FVB          (0xFFU<<8)
#define GFXMMU_LUT277L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT277L_EN           (0x1U<<0)
#define GFXMMU_LUT277L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT277L_EN_B_0X1     (0x1U<<0)

// LUT277H Configuration

#define GFXMMU_LUT277H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT277H_LO_0         (0x1U<<4)

// LUT278L Configuration

#define GFXMMU_LUT278L_LVB          (0xFFU<<16)
#define GFXMMU_LUT278L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT278L_FVB          (0xFFU<<8)
#define GFXMMU_LUT278L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT278L_EN           (0x1U<<0)
#define GFXMMU_LUT278L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT278L_EN_B_0X1     (0x1U<<0)

// LUT278H Configuration

#define GFXMMU_LUT278H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT278H_LO_0         (0x1U<<4)

// LUT279L Configuration

#define GFXMMU_LUT279L_LVB          (0xFFU<<16)
#define GFXMMU_LUT279L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT279L_FVB          (0xFFU<<8)
#define GFXMMU_LUT279L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT279L_EN           (0x1U<<0)
#define GFXMMU_LUT279L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT279L_EN_B_0X1     (0x1U<<0)

// LUT279H Configuration

#define GFXMMU_LUT279H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT279H_LO_0         (0x1U<<4)

// LUT280L Configuration

#define GFXMMU_LUT280L_LVB          (0xFFU<<16)
#define GFXMMU_LUT280L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT280L_FVB          (0xFFU<<8)
#define GFXMMU_LUT280L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT280L_EN           (0x1U<<0)
#define GFXMMU_LUT280L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT280L_EN_B_0X1     (0x1U<<0)

// LUT280H Configuration

#define GFXMMU_LUT280H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT280H_LO_0         (0x1U<<4)

// LUT281L Configuration

#define GFXMMU_LUT281L_LVB          (0xFFU<<16)
#define GFXMMU_LUT281L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT281L_FVB          (0xFFU<<8)
#define GFXMMU_LUT281L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT281L_EN           (0x1U<<0)
#define GFXMMU_LUT281L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT281L_EN_B_0X1     (0x1U<<0)

// LUT281H Configuration

#define GFXMMU_LUT281H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT281H_LO_0         (0x1U<<4)

// LUT282L Configuration

#define GFXMMU_LUT282L_LVB          (0xFFU<<16)
#define GFXMMU_LUT282L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT282L_FVB          (0xFFU<<8)
#define GFXMMU_LUT282L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT282L_EN           (0x1U<<0)
#define GFXMMU_LUT282L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT282L_EN_B_0X1     (0x1U<<0)

// LUT282H Configuration

#define GFXMMU_LUT282H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT282H_LO_0         (0x1U<<4)

// LUT283L Configuration

#define GFXMMU_LUT283L_LVB          (0xFFU<<16)
#define GFXMMU_LUT283L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT283L_FVB          (0xFFU<<8)
#define GFXMMU_LUT283L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT283L_EN           (0x1U<<0)
#define GFXMMU_LUT283L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT283L_EN_B_0X1     (0x1U<<0)

// LUT283H Configuration

