Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT310L Configuration

#define GFXMMU_LUT310L_LVB          (0xFFU<<16)
#define GFXMMU_LUT310L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT310L_FVB          (0xFFU<<8)
#define GFXMMU_LUT310L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT310L_EN           (0x1U<<0)
#define GFXMMU_LUT310L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT310L_EN_B_0X1     (0x1U<<0)

// LUT310H Configuration

#define GFXMMU_LUT310H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT310H_LO_0         (0x1U<<4)

// LUT311L Configuration

#define GFXMMU_LUT311L_LVB          (0xFFU<<16)
#define GFXMMU_LUT311L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT311L_FVB          (0xFFU<<8)
#define GFXMMU_LUT311L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT311L_EN           (0x1U<<0)
#define GFXMMU_LUT311L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT311L_EN_B_0X1     (0x1U<<0)

// LUT311H Configuration

#define GFXMMU_LUT311H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT311H_LO_0         (0x1U<<4)

// LUT312L Configuration

#define GFXMMU_LUT312L_LVB          (0xFFU<<16)
#define GFXMMU_LUT312L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT312L_FVB          (0xFFU<<8)
#define GFXMMU_LUT312L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT312L_EN           (0x1U<<0)
#define GFXMMU_LUT312L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT312L_EN_B_0X1     (0x1U<<0)

// LUT312H Configuration

#define GFXMMU_LUT312H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT312H_LO_0         (0x1U<<4)

// LUT313L Configuration

#define GFXMMU_LUT313L_LVB          (0xFFU<<16)
#define GFXMMU_LUT313L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT313L_FVB          (0xFFU<<8)
#define GFXMMU_LUT313L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT313L_EN           (0x1U<<0)
#define GFXMMU_LUT313L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT313L_EN_B_0X1     (0x1U<<0)

// LUT313H Configuration

#define GFXMMU_LUT313H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT313H_LO_0         (0x1U<<4)

// LUT314L Configuration

#define GFXMMU_LUT314L_LVB          (0xFFU<<16)
#define GFXMMU_LUT314L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT314L_FVB          (0xFFU<<8)
#define GFXMMU_LUT314L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT314L_EN           (0x1U<<0)
#define GFXMMU_LUT314L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT314L_EN_B_0X1     (0x1U<<0)

// LUT314H Configuration

#define GFXMMU_LUT314H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT314H_LO_0         (0x1U<<4)

// LUT315L Configuration

#define GFXMMU_LUT315L_LVB          (0xFFU<<16)
#define GFXMMU_LUT315L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT315L_FVB          (0xFFU<<8)
#define GFXMMU_LUT315L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT315L_EN           (0x1U<<0)
#define GFXMMU_LUT315L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT315L_EN_B_0X1     (0x1U<<0)

// LUT315H Configuration

#define GFXMMU_LUT315H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT315H_LO_0         (0x1U<<4)

// LUT316L Configuration

#define GFXMMU_LUT316L_LVB          (0xFFU<<16)
#define GFXMMU_LUT316L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT316L_FVB          (0xFFU<<8)
#define GFXMMU_LUT316L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT316L_EN           (0x1U<<0)
#define GFXMMU_LUT316L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT316L_EN_B_0X1     (0x1U<<0)

// LUT316H Configuration

#define GFXMMU_LUT316H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT316H_LO_0         (0x1U<<4)

// LUT317L Configuration

#define GFXMMU_LUT317L_LVB          (0xFFU<<16)
#define GFXMMU_LUT317L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT317L_FVB          (0xFFU<<8)
#define GFXMMU_LUT317L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT317L_EN           (0x1U<<0)
#define GFXMMU_LUT317L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT317L_EN_B_0X1     (0x1U<<0)

// LUT317H Configuration

#define GFXMMU_LUT317H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT317H_LO_0         (0x1U<<4)

// LUT318L Configuration

#define GFXMMU_LUT318L_LVB          (0xFFU<<16)
#define GFXMMU_LUT318L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT318L_FVB          (0xFFU<<8)
#define GFXMMU_LUT318L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT318L_EN           (0x1U<<0)
#define GFXMMU_LUT318L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT318L_EN_B_0X1     (0x1U<<0)

// LUT318H Configuration

#define GFXMMU_LUT318H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT318H_LO_0         (0x1U<<4)

// LUT319L Configuration

#define GFXMMU_LUT319L_LVB          (0xFFU<<16)
#define GFXMMU_LUT319L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT319L_FVB          (0xFFU<<8)
#define GFXMMU_LUT319L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT319L_EN           (0x1U<<0)
#define GFXMMU_LUT319L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT319L_EN_B_0X1     (0x1U<<0)

// LUT319H Configuration

#define GFXMMU_LUT319H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT319H_LO_0         (0x1U<<4)

// LUT320L Configuration

#define GFXMMU_LUT320L_LVB          (0xFFU<<16)
#define GFXMMU_LUT320L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT320L_FVB          (0xFFU<<8)
#define GFXMMU_LUT320L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT320L_EN           (0x1U<<0)
#define GFXMMU_LUT320L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT320L_EN_B_0X1     (0x1U<<0)

// LUT320H Configuration

#define GFXMMU_LUT320H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT320H_LO_0         (0x1U<<4)

// LUT321L Configuration

#define GFXMMU_LUT321L_LVB          (0xFFU<<16)
#define GFXMMU_LUT321L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT321L_FVB          (0xFFU<<8)
#define GFXMMU_LUT321L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT321L_EN           (0x1U<<0)
#define GFXMMU_LUT321L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT321L_EN_B_0X1     (0x1U<<0)

// LUT321H Configuration

#define GFXMMU_LUT321H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT321H_LO_0         (0x1U<<4)

// LUT322L Configuration

#define GFXMMU_LUT322L_LVB          (0xFFU<<16)
#define GFXMMU_LUT322L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT322L_FVB          (0xFFU<<8)
#define GFXMMU_LUT322L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT322L_EN           (0x1U<<0)
#define GFXMMU_LUT322L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT322L_EN_B_0X1     (0x1U<<0)

