Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT350H Configuration

#define GFXMMU_LUT350H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT350H_LO_0         (0x1U<<4)

// LUT351L Configuration

#define GFXMMU_LUT351L_LVB          (0xFFU<<16)
#define GFXMMU_LUT351L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT351L_FVB          (0xFFU<<8)
#define GFXMMU_LUT351L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT351L_EN           (0x1U<<0)
#define GFXMMU_LUT351L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT351L_EN_B_0X1     (0x1U<<0)

// LUT351H Configuration

#define GFXMMU_LUT351H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT351H_LO_0         (0x1U<<4)

// LUT352L Configuration

#define GFXMMU_LUT352L_LVB          (0xFFU<<16)
#define GFXMMU_LUT352L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT352L_FVB          (0xFFU<<8)
#define GFXMMU_LUT352L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT352L_EN           (0x1U<<0)
#define GFXMMU_LUT352L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT352L_EN_B_0X1     (0x1U<<0)

// LUT352H Configuration

#define GFXMMU_LUT352H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT352H_LO_0         (0x1U<<4)

// LUT353L Configuration

#define GFXMMU_LUT353L_LVB          (0xFFU<<16)
#define GFXMMU_LUT353L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT353L_FVB          (0xFFU<<8)
#define GFXMMU_LUT353L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT353L_EN           (0x1U<<0)
#define GFXMMU_LUT353L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT353L_EN_B_0X1     (0x1U<<0)

// LUT353H Configuration

#define GFXMMU_LUT353H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT353H_LO_0         (0x1U<<4)

// LUT354L Configuration

#define GFXMMU_LUT354L_LVB          (0xFFU<<16)
#define GFXMMU_LUT354L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT354L_FVB          (0xFFU<<8)
#define GFXMMU_LUT354L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT354L_EN           (0x1U<<0)
#define GFXMMU_LUT354L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT354L_EN_B_0X1     (0x1U<<0)

// LUT354H Configuration

#define GFXMMU_LUT354H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT354H_LO_0         (0x1U<<4)

// LUT355L Configuration

#define GFXMMU_LUT355L_LVB          (0xFFU<<16)
#define GFXMMU_LUT355L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT355L_FVB          (0xFFU<<8)
#define GFXMMU_LUT355L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT355L_EN           (0x1U<<0)
#define GFXMMU_LUT355L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT355L_EN_B_0X1     (0x1U<<0)

// LUT355H Configuration

#define GFXMMU_LUT355H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT355H_LO_0         (0x1U<<4)

// LUT356L Configuration

#define GFXMMU_LUT356L_LVB          (0xFFU<<16)
#define GFXMMU_LUT356L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT356L_FVB          (0xFFU<<8)
#define GFXMMU_LUT356L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT356L_EN           (0x1U<<0)
#define GFXMMU_LUT356L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT356L_EN_B_0X1     (0x1U<<0)

// LUT356H Configuration

#define GFXMMU_LUT356H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT356H_LO_0         (0x1U<<4)

// LUT357L Configuration

#define GFXMMU_LUT357L_LVB          (0xFFU<<16)
#define GFXMMU_LUT357L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT357L_FVB          (0xFFU<<8)
#define GFXMMU_LUT357L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT357L_EN           (0x1U<<0)
#define GFXMMU_LUT357L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT357L_EN_B_0X1     (0x1U<<0)

// LUT357H Configuration

#define GFXMMU_LUT357H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT357H_LO_0         (0x1U<<4)

// LUT358L Configuration

#define GFXMMU_LUT358L_LVB          (0xFFU<<16)
#define GFXMMU_LUT358L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT358L_FVB          (0xFFU<<8)
#define GFXMMU_LUT358L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT358L_EN           (0x1U<<0)
#define GFXMMU_LUT358L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT358L_EN_B_0X1     (0x1U<<0)

// LUT358H Configuration

#define GFXMMU_LUT358H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT358H_LO_0         (0x1U<<4)

// LUT359L Configuration

#define GFXMMU_LUT359L_LVB          (0xFFU<<16)
#define GFXMMU_LUT359L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT359L_FVB          (0xFFU<<8)
#define GFXMMU_LUT359L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT359L_EN           (0x1U<<0)
#define GFXMMU_LUT359L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT359L_EN_B_0X1     (0x1U<<0)

// LUT359H Configuration

#define GFXMMU_LUT359H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT359H_LO_0         (0x1U<<4)

// LUT360L Configuration

#define GFXMMU_LUT360L_LVB          (0xFFU<<16)
#define GFXMMU_LUT360L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT360L_FVB          (0xFFU<<8)
#define GFXMMU_LUT360L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT360L_EN           (0x1U<<0)
#define GFXMMU_LUT360L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT360L_EN_B_0X1     (0x1U<<0)

// LUT360H Configuration

#define GFXMMU_LUT360H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT360H_LO_0         (0x1U<<4)

// LUT361L Configuration

#define GFXMMU_LUT361L_LVB          (0xFFU<<16)
#define GFXMMU_LUT361L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT361L_FVB          (0xFFU<<8)
#define GFXMMU_LUT361L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT361L_EN           (0x1U<<0)
#define GFXMMU_LUT361L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT361L_EN_B_0X1     (0x1U<<0)

// LUT361H Configuration

#define GFXMMU_LUT361H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT361H_LO_0         (0x1U<<4)

// LUT362L Configuration

#define GFXMMU_LUT362L_LVB          (0xFFU<<16)
#define GFXMMU_LUT362L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT362L_FVB          (0xFFU<<8)
#define GFXMMU_LUT362L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT362L_EN           (0x1U<<0)
#define GFXMMU_LUT362L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT362L_EN_B_0X1     (0x1U<<0)

// LUT362H Configuration

#define GFXMMU_LUT362H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT362H_LO_0         (0x1U<<4)

// LUT363L Configuration

#define GFXMMU_LUT363L_LVB          (0xFFU<<16)
#define GFXMMU_LUT363L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT363L_FVB          (0xFFU<<8)
#define GFXMMU_LUT363L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT363L_EN           (0x1U<<0)
#define GFXMMU_LUT363L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT363L_EN_B_0X1     (0x1U<<0)

// LUT363H Configuration

