Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT363H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT363H_LO_0         (0x1U<<4)

// LUT364L Configuration

#define GFXMMU_LUT364L_LVB          (0xFFU<<16)
#define GFXMMU_LUT364L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT364L_FVB          (0xFFU<<8)
#define GFXMMU_LUT364L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT364L_EN           (0x1U<<0)
#define GFXMMU_LUT364L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT364L_EN_B_0X1     (0x1U<<0)

// LUT364H Configuration

#define GFXMMU_LUT364H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT364H_LO_0         (0x1U<<4)

// LUT365L Configuration

#define GFXMMU_LUT365L_LVB          (0xFFU<<16)
#define GFXMMU_LUT365L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT365L_FVB          (0xFFU<<8)
#define GFXMMU_LUT365L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT365L_EN           (0x1U<<0)
#define GFXMMU_LUT365L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT365L_EN_B_0X1     (0x1U<<0)

// LUT365H Configuration

#define GFXMMU_LUT365H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT365H_LO_0         (0x1U<<4)

// LUT366L Configuration

#define GFXMMU_LUT366L_LVB          (0xFFU<<16)
#define GFXMMU_LUT366L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT366L_FVB          (0xFFU<<8)
#define GFXMMU_LUT366L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT366L_EN           (0x1U<<0)
#define GFXMMU_LUT366L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT366L_EN_B_0X1     (0x1U<<0)

// LUT366H Configuration

#define GFXMMU_LUT366H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT366H_LO_0         (0x1U<<4)

// LUT367L Configuration

#define GFXMMU_LUT367L_LVB          (0xFFU<<16)
#define GFXMMU_LUT367L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT367L_FVB          (0xFFU<<8)
#define GFXMMU_LUT367L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT367L_EN           (0x1U<<0)
#define GFXMMU_LUT367L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT367L_EN_B_0X1     (0x1U<<0)

// LUT367H Configuration

#define GFXMMU_LUT367H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT367H_LO_0         (0x1U<<4)

// LUT368L Configuration

#define GFXMMU_LUT368L_LVB          (0xFFU<<16)
#define GFXMMU_LUT368L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT368L_FVB          (0xFFU<<8)
#define GFXMMU_LUT368L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT368L_EN           (0x1U<<0)
#define GFXMMU_LUT368L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT368L_EN_B_0X1     (0x1U<<0)

// LUT368H Configuration

#define GFXMMU_LUT368H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT368H_LO_0         (0x1U<<4)

// LUT369L Configuration

#define GFXMMU_LUT369L_LVB          (0xFFU<<16)
#define GFXMMU_LUT369L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT369L_FVB          (0xFFU<<8)
#define GFXMMU_LUT369L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT369L_EN           (0x1U<<0)
#define GFXMMU_LUT369L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT369L_EN_B_0X1     (0x1U<<0)

// LUT369H Configuration

#define GFXMMU_LUT369H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT369H_LO_0         (0x1U<<4)

// LUT370L Configuration

#define GFXMMU_LUT370L_LVB          (0xFFU<<16)
#define GFXMMU_LUT370L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT370L_FVB          (0xFFU<<8)
#define GFXMMU_LUT370L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT370L_EN           (0x1U<<0)
#define GFXMMU_LUT370L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT370L_EN_B_0X1     (0x1U<<0)

// LUT370H Configuration

#define GFXMMU_LUT370H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT370H_LO_0         (0x1U<<4)

// LUT371L Configuration

#define GFXMMU_LUT371L_LVB          (0xFFU<<16)
#define GFXMMU_LUT371L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT371L_FVB          (0xFFU<<8)
#define GFXMMU_LUT371L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT371L_EN           (0x1U<<0)
#define GFXMMU_LUT371L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT371L_EN_B_0X1     (0x1U<<0)

// LUT371H Configuration

#define GFXMMU_LUT371H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT371H_LO_0         (0x1U<<4)

// LUT372L Configuration

#define GFXMMU_LUT372L_LVB          (0xFFU<<16)
#define GFXMMU_LUT372L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT372L_FVB          (0xFFU<<8)
#define GFXMMU_LUT372L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT372L_EN           (0x1U<<0)
#define GFXMMU_LUT372L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT372L_EN_B_0X1     (0x1U<<0)

// LUT372H Configuration

#define GFXMMU_LUT372H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT372H_LO_0         (0x1U<<4)

// LUT373L Configuration

#define GFXMMU_LUT373L_LVB          (0xFFU<<16)
#define GFXMMU_LUT373L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT373L_FVB          (0xFFU<<8)
#define GFXMMU_LUT373L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT373L_EN           (0x1U<<0)
#define GFXMMU_LUT373L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT373L_EN_B_0X1     (0x1U<<0)

// LUT373H Configuration

#define GFXMMU_LUT373H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT373H_LO_0         (0x1U<<4)

// LUT374L Configuration

#define GFXMMU_LUT374L_LVB          (0xFFU<<16)
#define GFXMMU_LUT374L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT374L_FVB          (0xFFU<<8)
#define GFXMMU_LUT374L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT374L_EN           (0x1U<<0)
#define GFXMMU_LUT374L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT374L_EN_B_0X1     (0x1U<<0)

// LUT374H Configuration

#define GFXMMU_LUT374H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT374H_LO_0         (0x1U<<4)

// LUT375L Configuration

#define GFXMMU_LUT375L_LVB          (0xFFU<<16)
#define GFXMMU_LUT375L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT375L_FVB          (0xFFU<<8)
#define GFXMMU_LUT375L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT375L_EN           (0x1U<<0)
#define GFXMMU_LUT375L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT375L_EN_B_0X1     (0x1U<<0)

// LUT375H Configuration

#define GFXMMU_LUT375H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT375H_LO_0         (0x1U<<4)

// LUT376L Configuration

#define GFXMMU_LUT376L_LVB          (0xFFU<<16)
#define GFXMMU_LUT376L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT376L_FVB          (0xFFU<<8)
#define GFXMMU_LUT376L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT376L_EN           (0x1U<<0)
#define GFXMMU_LUT376L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT376L_EN_B_0X1     (0x1U<<0)

// LUT376H Configuration

#define GFXMMU_LUT376H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT376H_LO_0         (0x1U<<4)

// LUT377L Configuration

#define GFXMMU_LUT377L_LVB          (0xFFU<<16)
#define GFXMMU_LUT377L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT377L_FVB          (0xFFU<<8)
#define GFXMMU_LUT377L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT377L_EN           (0x1U<<0)
#define GFXMMU_LUT377L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT377L_EN_B_0X1     (0x1U<<0)

// LUT377H Configuration

#define GFXMMU_LUT377H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT377H_LO_0         (0x1U<<4)

// LUT378L Configuration

#define GFXMMU_LUT378L_LVB          (0xFFU<<16)
#define GFXMMU_LUT378L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT378L_FVB          (0xFFU<<8)
#define GFXMMU_LUT378L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT378L_EN           (0x1U<<0)
#define GFXMMU_LUT378L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT378L_EN_B_0X1     (0x1U<<0)

