Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT378H Configuration

#define GFXMMU_LUT378H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT378H_LO_0         (0x1U<<4)

// LUT379L Configuration

#define GFXMMU_LUT379L_LVB          (0xFFU<<16)
#define GFXMMU_LUT379L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT379L_FVB          (0xFFU<<8)
#define GFXMMU_LUT379L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT379L_EN           (0x1U<<0)
#define GFXMMU_LUT379L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT379L_EN_B_0X1     (0x1U<<0)

// LUT379H Configuration

#define GFXMMU_LUT379H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT379H_LO_0         (0x1U<<4)

// LUT380L Configuration

#define GFXMMU_LUT380L_LVB          (0xFFU<<16)
#define GFXMMU_LUT380L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT380L_FVB          (0xFFU<<8)
#define GFXMMU_LUT380L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT380L_EN           (0x1U<<0)
#define GFXMMU_LUT380L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT380L_EN_B_0X1     (0x1U<<0)

// LUT380H Configuration

#define GFXMMU_LUT380H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT380H_LO_0         (0x1U<<4)

// LUT381L Configuration

#define GFXMMU_LUT381L_LVB          (0xFFU<<16)
#define GFXMMU_LUT381L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT381L_FVB          (0xFFU<<8)
#define GFXMMU_LUT381L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT381L_EN           (0x1U<<0)
#define GFXMMU_LUT381L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT381L_EN_B_0X1     (0x1U<<0)

// LUT381H Configuration

#define GFXMMU_LUT381H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT381H_LO_0         (0x1U<<4)

// LUT382L Configuration

#define GFXMMU_LUT382L_LVB          (0xFFU<<16)
#define GFXMMU_LUT382L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT382L_FVB          (0xFFU<<8)
#define GFXMMU_LUT382L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT382L_EN           (0x1U<<0)
#define GFXMMU_LUT382L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT382L_EN_B_0X1     (0x1U<<0)

// LUT382H Configuration

#define GFXMMU_LUT382H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT382H_LO_0         (0x1U<<4)

// LUT383L Configuration

#define GFXMMU_LUT383L_LVB          (0xFFU<<16)
#define GFXMMU_LUT383L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT383L_FVB          (0xFFU<<8)
#define GFXMMU_LUT383L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT383L_EN           (0x1U<<0)
#define GFXMMU_LUT383L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT383L_EN_B_0X1     (0x1U<<0)

// LUT383H Configuration

#define GFXMMU_LUT383H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT383H_LO_0         (0x1U<<4)

// LUT384L Configuration

#define GFXMMU_LUT384L_LVB          (0xFFU<<16)
#define GFXMMU_LUT384L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT384L_FVB          (0xFFU<<8)
#define GFXMMU_LUT384L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT384L_EN           (0x1U<<0)
#define GFXMMU_LUT384L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT384L_EN_B_0X1     (0x1U<<0)

// LUT384H Configuration

#define GFXMMU_LUT384H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT384H_LO_0         (0x1U<<4)

// LUT385L Configuration

#define GFXMMU_LUT385L_LVB          (0xFFU<<16)
#define GFXMMU_LUT385L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT385L_FVB          (0xFFU<<8)
#define GFXMMU_LUT385L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT385L_EN           (0x1U<<0)
#define GFXMMU_LUT385L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT385L_EN_B_0X1     (0x1U<<0)

// LUT385H Configuration

#define GFXMMU_LUT385H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT385H_LO_0         (0x1U<<4)

// LUT386L Configuration

#define GFXMMU_LUT386L_LVB          (0xFFU<<16)
#define GFXMMU_LUT386L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT386L_FVB          (0xFFU<<8)
#define GFXMMU_LUT386L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT386L_EN           (0x1U<<0)
#define GFXMMU_LUT386L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT386L_EN_B_0X1     (0x1U<<0)

// LUT386H Configuration

#define GFXMMU_LUT386H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT386H_LO_0         (0x1U<<4)

// LUT387L Configuration

#define GFXMMU_LUT387L_LVB          (0xFFU<<16)
#define GFXMMU_LUT387L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT387L_FVB          (0xFFU<<8)
#define GFXMMU_LUT387L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT387L_EN           (0x1U<<0)
#define GFXMMU_LUT387L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT387L_EN_B_0X1     (0x1U<<0)

// LUT387H Configuration

#define GFXMMU_LUT387H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT387H_LO_0         (0x1U<<4)

// LUT388L Configuration

#define GFXMMU_LUT388L_LVB          (0xFFU<<16)
#define GFXMMU_LUT388L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT388L_FVB          (0xFFU<<8)
#define GFXMMU_LUT388L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT388L_EN           (0x1U<<0)
#define GFXMMU_LUT388L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT388L_EN_B_0X1     (0x1U<<0)

// LUT388H Configuration

#define GFXMMU_LUT388H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT388H_LO_0         (0x1U<<4)

// LUT389L Configuration

#define GFXMMU_LUT389L_LVB          (0xFFU<<16)
#define GFXMMU_LUT389L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT389L_FVB          (0xFFU<<8)
#define GFXMMU_LUT389L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT389L_EN           (0x1U<<0)
#define GFXMMU_LUT389L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT389L_EN_B_0X1     (0x1U<<0)

// LUT389H Configuration

#define GFXMMU_LUT389H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT389H_LO_0         (0x1U<<4)

// LUT390L Configuration

#define GFXMMU_LUT390L_LVB          (0xFFU<<16)
#define GFXMMU_LUT390L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT390L_FVB          (0xFFU<<8)
#define GFXMMU_LUT390L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT390L_EN           (0x1U<<0)
#define GFXMMU_LUT390L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT390L_EN_B_0X1     (0x1U<<0)

// LUT390H Configuration

#define GFXMMU_LUT390H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT390H_LO_0         (0x1U<<4)

// LUT391L Configuration

#define GFXMMU_LUT391L_LVB          (0xFFU<<16)
#define GFXMMU_LUT391L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT391L_FVB          (0xFFU<<8)
#define GFXMMU_LUT391L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT391L_EN           (0x1U<<0)
#define GFXMMU_LUT391L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT391L_EN_B_0X1     (0x1U<<0)

