Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT391H Configuration

#define GFXMMU_LUT391H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT391H_LO_0         (0x1U<<4)

// LUT392L Configuration

#define GFXMMU_LUT392L_LVB          (0xFFU<<16)
#define GFXMMU_LUT392L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT392L_FVB          (0xFFU<<8)
#define GFXMMU_LUT392L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT392L_EN           (0x1U<<0)
#define GFXMMU_LUT392L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT392L_EN_B_0X1     (0x1U<<0)

// LUT392H Configuration

#define GFXMMU_LUT392H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT392H_LO_0         (0x1U<<4)

// LUT393L Configuration

#define GFXMMU_LUT393L_LVB          (0xFFU<<16)
#define GFXMMU_LUT393L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT393L_FVB          (0xFFU<<8)
#define GFXMMU_LUT393L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT393L_EN           (0x1U<<0)
#define GFXMMU_LUT393L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT393L_EN_B_0X1     (0x1U<<0)

// LUT393H Configuration

#define GFXMMU_LUT393H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT393H_LO_0         (0x1U<<4)

// LUT394L Configuration

#define GFXMMU_LUT394L_LVB          (0xFFU<<16)
#define GFXMMU_LUT394L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT394L_FVB          (0xFFU<<8)
#define GFXMMU_LUT394L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT394L_EN           (0x1U<<0)
#define GFXMMU_LUT394L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT394L_EN_B_0X1     (0x1U<<0)

// LUT394H Configuration

#define GFXMMU_LUT394H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT394H_LO_0         (0x1U<<4)

// LUT395L Configuration

#define GFXMMU_LUT395L_LVB          (0xFFU<<16)
#define GFXMMU_LUT395L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT395L_FVB          (0xFFU<<8)
#define GFXMMU_LUT395L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT395L_EN           (0x1U<<0)
#define GFXMMU_LUT395L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT395L_EN_B_0X1     (0x1U<<0)

// LUT395H Configuration

#define GFXMMU_LUT395H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT395H_LO_0         (0x1U<<4)

// LUT396L Configuration

#define GFXMMU_LUT396L_LVB          (0xFFU<<16)
#define GFXMMU_LUT396L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT396L_FVB          (0xFFU<<8)
#define GFXMMU_LUT396L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT396L_EN           (0x1U<<0)
#define GFXMMU_LUT396L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT396L_EN_B_0X1     (0x1U<<0)

// LUT396H Configuration

#define GFXMMU_LUT396H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT396H_LO_0         (0x1U<<4)

// LUT397L Configuration

#define GFXMMU_LUT397L_LVB          (0xFFU<<16)
#define GFXMMU_LUT397L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT397L_FVB          (0xFFU<<8)
#define GFXMMU_LUT397L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT397L_EN           (0x1U<<0)
#define GFXMMU_LUT397L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT397L_EN_B_0X1     (0x1U<<0)

// LUT397H Configuration

#define GFXMMU_LUT397H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT397H_LO_0         (0x1U<<4)

// LUT398L Configuration

#define GFXMMU_LUT398L_LVB          (0xFFU<<16)
#define GFXMMU_LUT398L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT398L_FVB          (0xFFU<<8)
#define GFXMMU_LUT398L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT398L_EN           (0x1U<<0)
#define GFXMMU_LUT398L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT398L_EN_B_0X1     (0x1U<<0)

// LUT398H Configuration

#define GFXMMU_LUT398H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT398H_LO_0         (0x1U<<4)

// LUT399L Configuration

#define GFXMMU_LUT399L_LVB          (0xFFU<<16)
#define GFXMMU_LUT399L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT399L_FVB          (0xFFU<<8)
#define GFXMMU_LUT399L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT399L_EN           (0x1U<<0)
#define GFXMMU_LUT399L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT399L_EN_B_0X1     (0x1U<<0)

// LUT399H Configuration

#define GFXMMU_LUT399H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT399H_LO_0         (0x1U<<4)

// LUT400L Configuration

#define GFXMMU_LUT400L_LVB          (0xFFU<<16)
#define GFXMMU_LUT400L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT400L_FVB          (0xFFU<<8)
#define GFXMMU_LUT400L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT400L_EN           (0x1U<<0)
#define GFXMMU_LUT400L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT400L_EN_B_0X1     (0x1U<<0)

// LUT400H Configuration

#define GFXMMU_LUT400H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT400H_LO_0         (0x1U<<4)

// LUT401L Configuration

#define GFXMMU_LUT401L_LVB          (0xFFU<<16)
#define GFXMMU_LUT401L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT401L_FVB          (0xFFU<<8)
#define GFXMMU_LUT401L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT401L_EN           (0x1U<<0)
#define GFXMMU_LUT401L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT401L_EN_B_0X1     (0x1U<<0)

// LUT401H Configuration

#define GFXMMU_LUT401H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT401H_LO_0         (0x1U<<4)

// LUT402L Configuration

#define GFXMMU_LUT402L_LVB          (0xFFU<<16)
#define GFXMMU_LUT402L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT402L_FVB          (0xFFU<<8)
#define GFXMMU_LUT402L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT402L_EN           (0x1U<<0)
#define GFXMMU_LUT402L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT402L_EN_B_0X1     (0x1U<<0)

// LUT402H Configuration

#define GFXMMU_LUT402H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT402H_LO_0         (0x1U<<4)

// LUT403L Configuration

#define GFXMMU_LUT403L_LVB          (0xFFU<<16)
#define GFXMMU_LUT403L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT403L_FVB          (0xFFU<<8)
#define GFXMMU_LUT403L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT403L_EN           (0x1U<<0)
#define GFXMMU_LUT403L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT403L_EN_B_0X1     (0x1U<<0)

// LUT403H Configuration

#define GFXMMU_LUT403H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT403H_LO_0         (0x1U<<4)

// LUT404L Configuration

#define GFXMMU_LUT404L_LVB          (0xFFU<<16)
#define GFXMMU_LUT404L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT404L_FVB          (0xFFU<<8)
#define GFXMMU_LUT404L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT404L_EN           (0x1U<<0)
#define GFXMMU_LUT404L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT404L_EN_B_0X1     (0x1U<<0)

// LUT404H Configuration

#define GFXMMU_LUT404H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT404H_LO_0         (0x1U<<4)

// LUT405L Configuration

#define GFXMMU_LUT405L_LVB          (0xFFU<<16)
#define GFXMMU_LUT405L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT405L_FVB          (0xFFU<<8)
#define GFXMMU_LUT405L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT405L_EN           (0x1U<<0)
#define GFXMMU_LUT405L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT405L_EN_B_0X1     (0x1U<<0)

// LUT405H Configuration

#define GFXMMU_LUT405H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT405H_LO_0         (0x1U<<4)

// LUT406L Configuration

#define GFXMMU_LUT406L_LVB          (0xFFU<<16)
#define GFXMMU_LUT406L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT406L_FVB          (0xFFU<<8)
#define GFXMMU_LUT406L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT406L_EN           (0x1U<<0)
#define GFXMMU_LUT406L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT406L_EN_B_0X1     (0x1U<<0)

