Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT406H Configuration

#define GFXMMU_LUT406H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT406H_LO_0         (0x1U<<4)

// LUT407L Configuration

#define GFXMMU_LUT407L_LVB          (0xFFU<<16)
#define GFXMMU_LUT407L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT407L_FVB          (0xFFU<<8)
#define GFXMMU_LUT407L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT407L_EN           (0x1U<<0)
#define GFXMMU_LUT407L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT407L_EN_B_0X1     (0x1U<<0)

// LUT407H Configuration

#define GFXMMU_LUT407H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT407H_LO_0         (0x1U<<4)

// LUT408L Configuration

#define GFXMMU_LUT408L_LVB          (0xFFU<<16)
#define GFXMMU_LUT408L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT408L_FVB          (0xFFU<<8)
#define GFXMMU_LUT408L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT408L_EN           (0x1U<<0)
#define GFXMMU_LUT408L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT408L_EN_B_0X1     (0x1U<<0)

// LUT408H Configuration

#define GFXMMU_LUT408H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT408H_LO_0         (0x1U<<4)

// LUT409L Configuration

#define GFXMMU_LUT409L_LVB          (0xFFU<<16)
#define GFXMMU_LUT409L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT409L_FVB          (0xFFU<<8)
#define GFXMMU_LUT409L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT409L_EN           (0x1U<<0)
#define GFXMMU_LUT409L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT409L_EN_B_0X1     (0x1U<<0)

// LUT409H Configuration

#define GFXMMU_LUT409H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT409H_LO_0         (0x1U<<4)

// LUT410L Configuration

#define GFXMMU_LUT410L_LVB          (0xFFU<<16)
#define GFXMMU_LUT410L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT410L_FVB          (0xFFU<<8)
#define GFXMMU_LUT410L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT410L_EN           (0x1U<<0)
#define GFXMMU_LUT410L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT410L_EN_B_0X1     (0x1U<<0)

// LUT410H Configuration

#define GFXMMU_LUT410H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT410H_LO_0         (0x1U<<4)

// LUT411L Configuration

#define GFXMMU_LUT411L_LVB          (0xFFU<<16)
#define GFXMMU_LUT411L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT411L_FVB          (0xFFU<<8)
#define GFXMMU_LUT411L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT411L_EN           (0x1U<<0)
#define GFXMMU_LUT411L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT411L_EN_B_0X1     (0x1U<<0)

// LUT411H Configuration

#define GFXMMU_LUT411H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT411H_LO_0         (0x1U<<4)

// LUT412L Configuration

#define GFXMMU_LUT412L_LVB          (0xFFU<<16)
#define GFXMMU_LUT412L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT412L_FVB          (0xFFU<<8)
#define GFXMMU_LUT412L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT412L_EN           (0x1U<<0)
#define GFXMMU_LUT412L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT412L_EN_B_0X1     (0x1U<<0)

// LUT412H Configuration

#define GFXMMU_LUT412H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT412H_LO_0         (0x1U<<4)

// LUT413L Configuration

#define GFXMMU_LUT413L_LVB          (0xFFU<<16)
#define GFXMMU_LUT413L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT413L_FVB          (0xFFU<<8)
#define GFXMMU_LUT413L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT413L_EN           (0x1U<<0)
#define GFXMMU_LUT413L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT413L_EN_B_0X1     (0x1U<<0)

// LUT413H Configuration

#define GFXMMU_LUT413H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT413H_LO_0         (0x1U<<4)

// LUT414L Configuration

#define GFXMMU_LUT414L_LVB          (0xFFU<<16)
#define GFXMMU_LUT414L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT414L_FVB          (0xFFU<<8)
#define GFXMMU_LUT414L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT414L_EN           (0x1U<<0)
#define GFXMMU_LUT414L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT414L_EN_B_0X1     (0x1U<<0)

// LUT414H Configuration

#define GFXMMU_LUT414H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT414H_LO_0         (0x1U<<4)

// LUT415L Configuration

#define GFXMMU_LUT415L_LVB          (0xFFU<<16)
#define GFXMMU_LUT415L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT415L_FVB          (0xFFU<<8)
#define GFXMMU_LUT415L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT415L_EN           (0x1U<<0)
#define GFXMMU_LUT415L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT415L_EN_B_0X1     (0x1U<<0)

// LUT415H Configuration

#define GFXMMU_LUT415H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT415H_LO_0         (0x1U<<4)

// LUT416L Configuration

#define GFXMMU_LUT416L_LVB          (0xFFU<<16)
#define GFXMMU_LUT416L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT416L_FVB          (0xFFU<<8)
#define GFXMMU_LUT416L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT416L_EN           (0x1U<<0)
#define GFXMMU_LUT416L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT416L_EN_B_0X1     (0x1U<<0)

// LUT416H Configuration

#define GFXMMU_LUT416H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT416H_LO_0         (0x1U<<4)

// LUT417L Configuration

#define GFXMMU_LUT417L_LVB          (0xFFU<<16)
#define GFXMMU_LUT417L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT417L_FVB          (0xFFU<<8)
#define GFXMMU_LUT417L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT417L_EN           (0x1U<<0)
#define GFXMMU_LUT417L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT417L_EN_B_0X1     (0x1U<<0)

// LUT417H Configuration

#define GFXMMU_LUT417H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT417H_LO_0         (0x1U<<4)

// LUT418L Configuration

#define GFXMMU_LUT418L_LVB          (0xFFU<<16)
#define GFXMMU_LUT418L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT418L_FVB          (0xFFU<<8)
#define GFXMMU_LUT418L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT418L_EN           (0x1U<<0)
#define GFXMMU_LUT418L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT418L_EN_B_0X1     (0x1U<<0)

// LUT418H Configuration

#define GFXMMU_LUT418H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT418H_LO_0         (0x1U<<4)

// LUT419L Configuration

#define GFXMMU_LUT419L_LVB          (0xFFU<<16)
#define GFXMMU_LUT419L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT419L_FVB          (0xFFU<<8)
#define GFXMMU_LUT419L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT419L_EN           (0x1U<<0)
#define GFXMMU_LUT419L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT419L_EN_B_0X1     (0x1U<<0)

// LUT419H Configuration

#define GFXMMU_LUT419H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT419H_LO_0         (0x1U<<4)

