Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT434L Configuration

#define GFXMMU_LUT434L_LVB          (0xFFU<<16)
#define GFXMMU_LUT434L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT434L_FVB          (0xFFU<<8)
#define GFXMMU_LUT434L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT434L_EN           (0x1U<<0)
#define GFXMMU_LUT434L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT434L_EN_B_0X1     (0x1U<<0)

// LUT434H Configuration

#define GFXMMU_LUT434H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT434H_LO_0         (0x1U<<4)

// LUT435L Configuration

#define GFXMMU_LUT435L_LVB          (0xFFU<<16)
#define GFXMMU_LUT435L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT435L_FVB          (0xFFU<<8)
#define GFXMMU_LUT435L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT435L_EN           (0x1U<<0)
#define GFXMMU_LUT435L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT435L_EN_B_0X1     (0x1U<<0)

// LUT435H Configuration

#define GFXMMU_LUT435H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT435H_LO_0         (0x1U<<4)

// LUT436L Configuration

#define GFXMMU_LUT436L_LVB          (0xFFU<<16)
#define GFXMMU_LUT436L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT436L_FVB          (0xFFU<<8)
#define GFXMMU_LUT436L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT436L_EN           (0x1U<<0)
#define GFXMMU_LUT436L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT436L_EN_B_0X1     (0x1U<<0)

// LUT436H Configuration

#define GFXMMU_LUT436H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT436H_LO_0         (0x1U<<4)

// LUT437L Configuration

#define GFXMMU_LUT437L_LVB          (0xFFU<<16)
#define GFXMMU_LUT437L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT437L_FVB          (0xFFU<<8)
#define GFXMMU_LUT437L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT437L_EN           (0x1U<<0)
#define GFXMMU_LUT437L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT437L_EN_B_0X1     (0x1U<<0)

// LUT437H Configuration

#define GFXMMU_LUT437H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT437H_LO_0         (0x1U<<4)

// LUT438L Configuration

#define GFXMMU_LUT438L_LVB          (0xFFU<<16)
#define GFXMMU_LUT438L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT438L_FVB          (0xFFU<<8)
#define GFXMMU_LUT438L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT438L_EN           (0x1U<<0)
#define GFXMMU_LUT438L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT438L_EN_B_0X1     (0x1U<<0)

// LUT438H Configuration

#define GFXMMU_LUT438H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT438H_LO_0         (0x1U<<4)

// LUT439L Configuration

#define GFXMMU_LUT439L_LVB          (0xFFU<<16)
#define GFXMMU_LUT439L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT439L_FVB          (0xFFU<<8)
#define GFXMMU_LUT439L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT439L_EN           (0x1U<<0)
#define GFXMMU_LUT439L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT439L_EN_B_0X1     (0x1U<<0)

// LUT439H Configuration

#define GFXMMU_LUT439H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT439H_LO_0         (0x1U<<4)

// LUT440L Configuration

#define GFXMMU_LUT440L_LVB          (0xFFU<<16)
#define GFXMMU_LUT440L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT440L_FVB          (0xFFU<<8)
#define GFXMMU_LUT440L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT440L_EN           (0x1U<<0)
#define GFXMMU_LUT440L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT440L_EN_B_0X1     (0x1U<<0)

// LUT440H Configuration

#define GFXMMU_LUT440H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT440H_LO_0         (0x1U<<4)

// LUT441L Configuration

#define GFXMMU_LUT441L_LVB          (0xFFU<<16)
#define GFXMMU_LUT441L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT441L_FVB          (0xFFU<<8)
#define GFXMMU_LUT441L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT441L_EN           (0x1U<<0)
#define GFXMMU_LUT441L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT441L_EN_B_0X1     (0x1U<<0)

// LUT441H Configuration

#define GFXMMU_LUT441H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT441H_LO_0         (0x1U<<4)

// LUT442L Configuration

#define GFXMMU_LUT442L_LVB          (0xFFU<<16)
#define GFXMMU_LUT442L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT442L_FVB          (0xFFU<<8)
#define GFXMMU_LUT442L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT442L_EN           (0x1U<<0)
#define GFXMMU_LUT442L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT442L_EN_B_0X1     (0x1U<<0)

// LUT442H Configuration

#define GFXMMU_LUT442H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT442H_LO_0         (0x1U<<4)

// LUT443L Configuration

#define GFXMMU_LUT443L_LVB          (0xFFU<<16)
#define GFXMMU_LUT443L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT443L_FVB          (0xFFU<<8)
#define GFXMMU_LUT443L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT443L_EN           (0x1U<<0)
#define GFXMMU_LUT443L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT443L_EN_B_0X1     (0x1U<<0)

// LUT443H Configuration

#define GFXMMU_LUT443H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT443H_LO_0         (0x1U<<4)

// LUT444L Configuration

#define GFXMMU_LUT444L_LVB          (0xFFU<<16)
#define GFXMMU_LUT444L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT444L_FVB          (0xFFU<<8)
#define GFXMMU_LUT444L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT444L_EN           (0x1U<<0)
#define GFXMMU_LUT444L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT444L_EN_B_0X1     (0x1U<<0)

// LUT444H Configuration

#define GFXMMU_LUT444H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT444H_LO_0         (0x1U<<4)

// LUT445L Configuration

#define GFXMMU_LUT445L_LVB          (0xFFU<<16)
#define GFXMMU_LUT445L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT445L_FVB          (0xFFU<<8)
#define GFXMMU_LUT445L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT445L_EN           (0x1U<<0)
#define GFXMMU_LUT445L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT445L_EN_B_0X1     (0x1U<<0)

// LUT445H Configuration

#define GFXMMU_LUT445H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT445H_LO_0         (0x1U<<4)

// LUT446L Configuration

#define GFXMMU_LUT446L_LVB          (0xFFU<<16)
#define GFXMMU_LUT446L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT446L_FVB          (0xFFU<<8)
#define GFXMMU_LUT446L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT446L_EN           (0x1U<<0)
#define GFXMMU_LUT446L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT446L_EN_B_0X1     (0x1U<<0)

// LUT446H Configuration

#define GFXMMU_LUT446H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT446H_LO_0         (0x1U<<4)

// LUT447L Configuration

