Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT460L_LVB          (0xFFU<<16)
#define GFXMMU_LUT460L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT460L_FVB          (0xFFU<<8)
#define GFXMMU_LUT460L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT460L_EN           (0x1U<<0)
#define GFXMMU_LUT460L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT460L_EN_B_0X1     (0x1U<<0)

// LUT460H Configuration

#define GFXMMU_LUT460H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT460H_LO_0         (0x1U<<4)

// LUT461L Configuration

#define GFXMMU_LUT461L_LVB          (0xFFU<<16)
#define GFXMMU_LUT461L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT461L_FVB          (0xFFU<<8)
#define GFXMMU_LUT461L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT461L_EN           (0x1U<<0)
#define GFXMMU_LUT461L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT461L_EN_B_0X1     (0x1U<<0)

// LUT461H Configuration

#define GFXMMU_LUT461H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT461H_LO_0         (0x1U<<4)

// LUT462L Configuration

#define GFXMMU_LUT462L_LVB          (0xFFU<<16)
#define GFXMMU_LUT462L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT462L_FVB          (0xFFU<<8)
#define GFXMMU_LUT462L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT462L_EN           (0x1U<<0)
#define GFXMMU_LUT462L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT462L_EN_B_0X1     (0x1U<<0)

// LUT462H Configuration

#define GFXMMU_LUT462H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT462H_LO_0         (0x1U<<4)

// LUT463L Configuration

#define GFXMMU_LUT463L_LVB          (0xFFU<<16)
#define GFXMMU_LUT463L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT463L_FVB          (0xFFU<<8)
#define GFXMMU_LUT463L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT463L_EN           (0x1U<<0)
#define GFXMMU_LUT463L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT463L_EN_B_0X1     (0x1U<<0)

// LUT463H Configuration

#define GFXMMU_LUT463H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT463H_LO_0         (0x1U<<4)

// LUT464L Configuration

#define GFXMMU_LUT464L_LVB          (0xFFU<<16)
#define GFXMMU_LUT464L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT464L_FVB          (0xFFU<<8)
#define GFXMMU_LUT464L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT464L_EN           (0x1U<<0)
#define GFXMMU_LUT464L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT464L_EN_B_0X1     (0x1U<<0)

// LUT464H Configuration

#define GFXMMU_LUT464H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT464H_LO_0         (0x1U<<4)

// LUT465L Configuration

#define GFXMMU_LUT465L_LVB          (0xFFU<<16)
#define GFXMMU_LUT465L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT465L_FVB          (0xFFU<<8)
#define GFXMMU_LUT465L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT465L_EN           (0x1U<<0)
#define GFXMMU_LUT465L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT465L_EN_B_0X1     (0x1U<<0)

// LUT465H Configuration

#define GFXMMU_LUT465H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT465H_LO_0         (0x1U<<4)

// LUT466L Configuration

#define GFXMMU_LUT466L_LVB          (0xFFU<<16)
#define GFXMMU_LUT466L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT466L_FVB          (0xFFU<<8)
#define GFXMMU_LUT466L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT466L_EN           (0x1U<<0)
#define GFXMMU_LUT466L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT466L_EN_B_0X1     (0x1U<<0)

// LUT466H Configuration

#define GFXMMU_LUT466H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT466H_LO_0         (0x1U<<4)

// LUT467L Configuration

#define GFXMMU_LUT467L_LVB          (0xFFU<<16)
#define GFXMMU_LUT467L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT467L_FVB          (0xFFU<<8)
#define GFXMMU_LUT467L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT467L_EN           (0x1U<<0)
#define GFXMMU_LUT467L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT467L_EN_B_0X1     (0x1U<<0)

// LUT467H Configuration

#define GFXMMU_LUT467H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT467H_LO_0         (0x1U<<4)

// LUT468L Configuration

#define GFXMMU_LUT468L_LVB          (0xFFU<<16)
#define GFXMMU_LUT468L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT468L_FVB          (0xFFU<<8)
#define GFXMMU_LUT468L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT468L_EN           (0x1U<<0)
#define GFXMMU_LUT468L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT468L_EN_B_0X1     (0x1U<<0)

// LUT468H Configuration

#define GFXMMU_LUT468H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT468H_LO_0         (0x1U<<4)

// LUT469L Configuration

#define GFXMMU_LUT469L_LVB          (0xFFU<<16)
#define GFXMMU_LUT469L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT469L_FVB          (0xFFU<<8)
#define GFXMMU_LUT469L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT469L_EN           (0x1U<<0)
#define GFXMMU_LUT469L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT469L_EN_B_0X1     (0x1U<<0)

// LUT469H Configuration

#define GFXMMU_LUT469H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT469H_LO_0         (0x1U<<4)

// LUT470L Configuration

#define GFXMMU_LUT470L_LVB          (0xFFU<<16)
#define GFXMMU_LUT470L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT470L_FVB          (0xFFU<<8)
#define GFXMMU_LUT470L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT470L_EN           (0x1U<<0)
#define GFXMMU_LUT470L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT470L_EN_B_0X1     (0x1U<<0)

// LUT470H Configuration

#define GFXMMU_LUT470H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT470H_LO_0         (0x1U<<4)

// LUT471L Configuration

#define GFXMMU_LUT471L_LVB          (0xFFU<<16)
#define GFXMMU_LUT471L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT471L_FVB          (0xFFU<<8)
#define GFXMMU_LUT471L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT471L_EN           (0x1U<<0)
#define GFXMMU_LUT471L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT471L_EN_B_0X1     (0x1U<<0)

// LUT471H Configuration

#define GFXMMU_LUT471H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT471H_LO_0         (0x1U<<4)

// LUT472L Configuration

#define GFXMMU_LUT472L_LVB          (0xFFU<<16)
#define GFXMMU_LUT472L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT472L_FVB          (0xFFU<<8)
#define GFXMMU_LUT472L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT472L_EN           (0x1U<<0)
#define GFXMMU_LUT472L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT472L_EN_B_0X1     (0x1U<<0)

