Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT485H Configuration

#define GFXMMU_LUT485H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT485H_LO_0         (0x1U<<4)

// LUT486L Configuration

#define GFXMMU_LUT486L_LVB          (0xFFU<<16)
#define GFXMMU_LUT486L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT486L_FVB          (0xFFU<<8)
#define GFXMMU_LUT486L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT486L_EN           (0x1U<<0)
#define GFXMMU_LUT486L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT486L_EN_B_0X1     (0x1U<<0)

// LUT486H Configuration

#define GFXMMU_LUT486H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT486H_LO_0         (0x1U<<4)

// LUT487L Configuration

#define GFXMMU_LUT487L_LVB          (0xFFU<<16)
#define GFXMMU_LUT487L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT487L_FVB          (0xFFU<<8)
#define GFXMMU_LUT487L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT487L_EN           (0x1U<<0)
#define GFXMMU_LUT487L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT487L_EN_B_0X1     (0x1U<<0)

// LUT487H Configuration

#define GFXMMU_LUT487H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT487H_LO_0         (0x1U<<4)

// LUT488L Configuration

#define GFXMMU_LUT488L_LVB          (0xFFU<<16)
#define GFXMMU_LUT488L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT488L_FVB          (0xFFU<<8)
#define GFXMMU_LUT488L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT488L_EN           (0x1U<<0)
#define GFXMMU_LUT488L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT488L_EN_B_0X1     (0x1U<<0)

// LUT488H Configuration

#define GFXMMU_LUT488H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT488H_LO_0         (0x1U<<4)

// LUT489L Configuration

#define GFXMMU_LUT489L_LVB          (0xFFU<<16)
#define GFXMMU_LUT489L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT489L_FVB          (0xFFU<<8)
#define GFXMMU_LUT489L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT489L_EN           (0x1U<<0)
#define GFXMMU_LUT489L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT489L_EN_B_0X1     (0x1U<<0)

// LUT489H Configuration

#define GFXMMU_LUT489H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT489H_LO_0         (0x1U<<4)

// LUT490L Configuration

#define GFXMMU_LUT490L_LVB          (0xFFU<<16)
#define GFXMMU_LUT490L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT490L_FVB          (0xFFU<<8)
#define GFXMMU_LUT490L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT490L_EN           (0x1U<<0)
#define GFXMMU_LUT490L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT490L_EN_B_0X1     (0x1U<<0)

// LUT490H Configuration

#define GFXMMU_LUT490H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT490H_LO_0         (0x1U<<4)

// LUT491L Configuration

#define GFXMMU_LUT491L_LVB          (0xFFU<<16)
#define GFXMMU_LUT491L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT491L_FVB          (0xFFU<<8)
#define GFXMMU_LUT491L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT491L_EN           (0x1U<<0)
#define GFXMMU_LUT491L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT491L_EN_B_0X1     (0x1U<<0)

// LUT491H Configuration

#define GFXMMU_LUT491H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT491H_LO_0         (0x1U<<4)

// LUT492L Configuration

#define GFXMMU_LUT492L_LVB          (0xFFU<<16)
#define GFXMMU_LUT492L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT492L_FVB          (0xFFU<<8)
#define GFXMMU_LUT492L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT492L_EN           (0x1U<<0)
#define GFXMMU_LUT492L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT492L_EN_B_0X1     (0x1U<<0)

// LUT492H Configuration

#define GFXMMU_LUT492H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT492H_LO_0         (0x1U<<4)

// LUT493L Configuration

#define GFXMMU_LUT493L_LVB          (0xFFU<<16)
#define GFXMMU_LUT493L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT493L_FVB          (0xFFU<<8)
#define GFXMMU_LUT493L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT493L_EN           (0x1U<<0)
#define GFXMMU_LUT493L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT493L_EN_B_0X1     (0x1U<<0)

// LUT493H Configuration

#define GFXMMU_LUT493H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT493H_LO_0         (0x1U<<4)

// LUT494L Configuration

#define GFXMMU_LUT494L_LVB          (0xFFU<<16)
#define GFXMMU_LUT494L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT494L_FVB          (0xFFU<<8)
#define GFXMMU_LUT494L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT494L_EN           (0x1U<<0)
#define GFXMMU_LUT494L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT494L_EN_B_0X1     (0x1U<<0)

// LUT494H Configuration

#define GFXMMU_LUT494H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT494H_LO_0         (0x1U<<4)

// LUT495L Configuration

#define GFXMMU_LUT495L_LVB          (0xFFU<<16)
#define GFXMMU_LUT495L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT495L_FVB          (0xFFU<<8)
#define GFXMMU_LUT495L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT495L_EN           (0x1U<<0)
#define GFXMMU_LUT495L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT495L_EN_B_0X1     (0x1U<<0)

// LUT495H Configuration

#define GFXMMU_LUT495H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT495H_LO_0         (0x1U<<4)

// LUT496L Configuration

#define GFXMMU_LUT496L_LVB          (0xFFU<<16)
#define GFXMMU_LUT496L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT496L_FVB          (0xFFU<<8)
#define GFXMMU_LUT496L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT496L_EN           (0x1U<<0)
#define GFXMMU_LUT496L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT496L_EN_B_0X1     (0x1U<<0)

// LUT496H Configuration

#define GFXMMU_LUT496H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT496H_LO_0         (0x1U<<4)

// LUT497L Configuration

#define GFXMMU_LUT497L_LVB          (0xFFU<<16)
#define GFXMMU_LUT497L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT497L_FVB          (0xFFU<<8)
#define GFXMMU_LUT497L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT497L_EN           (0x1U<<0)
#define GFXMMU_LUT497L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT497L_EN_B_0X1     (0x1U<<0)

// LUT497H Configuration

#define GFXMMU_LUT497H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT497H_LO_0         (0x1U<<4)

// LUT498L Configuration

#define GFXMMU_LUT498L_LVB          (0xFFU<<16)
#define GFXMMU_LUT498L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT498L_FVB          (0xFFU<<8)
#define GFXMMU_LUT498L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT498L_EN           (0x1U<<0)
#define GFXMMU_LUT498L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT498L_EN_B_0X1     (0x1U<<0)

// LUT498H Configuration

