Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT525H Configuration

#define GFXMMU_LUT525H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT525H_LO_0         (0x1U<<4)

// LUT526L Configuration

#define GFXMMU_LUT526L_LVB          (0xFFU<<16)
#define GFXMMU_LUT526L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT526L_FVB          (0xFFU<<8)
#define GFXMMU_LUT526L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT526L_EN           (0x1U<<0)
#define GFXMMU_LUT526L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT526L_EN_B_0X1     (0x1U<<0)

// LUT526H Configuration

#define GFXMMU_LUT526H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT526H_LO_0         (0x1U<<4)

// LUT527L Configuration

#define GFXMMU_LUT527L_LVB          (0xFFU<<16)
#define GFXMMU_LUT527L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT527L_FVB          (0xFFU<<8)
#define GFXMMU_LUT527L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT527L_EN           (0x1U<<0)
#define GFXMMU_LUT527L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT527L_EN_B_0X1     (0x1U<<0)

// LUT527H Configuration

#define GFXMMU_LUT527H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT527H_LO_0         (0x1U<<4)

// LUT528L Configuration

#define GFXMMU_LUT528L_LVB          (0xFFU<<16)
#define GFXMMU_LUT528L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT528L_FVB          (0xFFU<<8)
#define GFXMMU_LUT528L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT528L_EN           (0x1U<<0)
#define GFXMMU_LUT528L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT528L_EN_B_0X1     (0x1U<<0)

// LUT528H Configuration

#define GFXMMU_LUT528H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT528H_LO_0         (0x1U<<4)

// LUT529L Configuration

#define GFXMMU_LUT529L_LVB          (0xFFU<<16)
#define GFXMMU_LUT529L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT529L_FVB          (0xFFU<<8)
#define GFXMMU_LUT529L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT529L_EN           (0x1U<<0)
#define GFXMMU_LUT529L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT529L_EN_B_0X1     (0x1U<<0)

// LUT529H Configuration

#define GFXMMU_LUT529H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT529H_LO_0         (0x1U<<4)

// LUT530L Configuration

#define GFXMMU_LUT530L_LVB          (0xFFU<<16)
#define GFXMMU_LUT530L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT530L_FVB          (0xFFU<<8)
#define GFXMMU_LUT530L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT530L_EN           (0x1U<<0)
#define GFXMMU_LUT530L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT530L_EN_B_0X1     (0x1U<<0)

// LUT530H Configuration

#define GFXMMU_LUT530H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT530H_LO_0         (0x1U<<4)

// LUT531L Configuration

#define GFXMMU_LUT531L_LVB          (0xFFU<<16)
#define GFXMMU_LUT531L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT531L_FVB          (0xFFU<<8)
#define GFXMMU_LUT531L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT531L_EN           (0x1U<<0)
#define GFXMMU_LUT531L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT531L_EN_B_0X1     (0x1U<<0)

// LUT531H Configuration

#define GFXMMU_LUT531H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT531H_LO_0         (0x1U<<4)

// LUT532L Configuration

#define GFXMMU_LUT532L_LVB          (0xFFU<<16)
#define GFXMMU_LUT532L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT532L_FVB          (0xFFU<<8)
#define GFXMMU_LUT532L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT532L_EN           (0x1U<<0)
#define GFXMMU_LUT532L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT532L_EN_B_0X1     (0x1U<<0)

// LUT532H Configuration

#define GFXMMU_LUT532H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT532H_LO_0         (0x1U<<4)

// LUT533L Configuration

#define GFXMMU_LUT533L_LVB          (0xFFU<<16)
#define GFXMMU_LUT533L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT533L_FVB          (0xFFU<<8)
#define GFXMMU_LUT533L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT533L_EN           (0x1U<<0)
#define GFXMMU_LUT533L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT533L_EN_B_0X1     (0x1U<<0)

// LUT533H Configuration

#define GFXMMU_LUT533H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT533H_LO_0         (0x1U<<4)

// LUT534L Configuration

#define GFXMMU_LUT534L_LVB          (0xFFU<<16)
#define GFXMMU_LUT534L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT534L_FVB          (0xFFU<<8)
#define GFXMMU_LUT534L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT534L_EN           (0x1U<<0)
#define GFXMMU_LUT534L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT534L_EN_B_0X1     (0x1U<<0)

// LUT534H Configuration

#define GFXMMU_LUT534H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT534H_LO_0         (0x1U<<4)

// LUT535L Configuration

#define GFXMMU_LUT535L_LVB          (0xFFU<<16)
#define GFXMMU_LUT535L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT535L_FVB          (0xFFU<<8)
#define GFXMMU_LUT535L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT535L_EN           (0x1U<<0)
#define GFXMMU_LUT535L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT535L_EN_B_0X1     (0x1U<<0)

// LUT535H Configuration

#define GFXMMU_LUT535H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT535H_LO_0         (0x1U<<4)

// LUT536L Configuration

#define GFXMMU_LUT536L_LVB          (0xFFU<<16)
#define GFXMMU_LUT536L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT536L_FVB          (0xFFU<<8)
#define GFXMMU_LUT536L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT536L_EN           (0x1U<<0)
#define GFXMMU_LUT536L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT536L_EN_B_0X1     (0x1U<<0)

// LUT536H Configuration

#define GFXMMU_LUT536H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT536H_LO_0         (0x1U<<4)

// LUT537L Configuration

#define GFXMMU_LUT537L_LVB          (0xFFU<<16)
#define GFXMMU_LUT537L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT537L_FVB          (0xFFU<<8)
#define GFXMMU_LUT537L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT537L_EN           (0x1U<<0)
#define GFXMMU_LUT537L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT537L_EN_B_0X1     (0x1U<<0)

// LUT537H Configuration

#define GFXMMU_LUT537H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT537H_LO_0         (0x1U<<4)

// LUT538L Configuration

#define GFXMMU_LUT538L_LVB          (0xFFU<<16)
#define GFXMMU_LUT538L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT538L_FVB          (0xFFU<<8)
#define GFXMMU_LUT538L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT538L_EN           (0x1U<<0)
#define GFXMMU_LUT538L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT538L_EN_B_0X1     (0x1U<<0)

// LUT538H Configuration

