Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT538H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT538H_LO_0         (0x1U<<4)

// LUT539L Configuration

#define GFXMMU_LUT539L_LVB          (0xFFU<<16)
#define GFXMMU_LUT539L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT539L_FVB          (0xFFU<<8)
#define GFXMMU_LUT539L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT539L_EN           (0x1U<<0)
#define GFXMMU_LUT539L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT539L_EN_B_0X1     (0x1U<<0)

// LUT539H Configuration

#define GFXMMU_LUT539H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT539H_LO_0         (0x1U<<4)

// LUT540L Configuration

#define GFXMMU_LUT540L_LVB          (0xFFU<<16)
#define GFXMMU_LUT540L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT540L_FVB          (0xFFU<<8)
#define GFXMMU_LUT540L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT540L_EN           (0x1U<<0)
#define GFXMMU_LUT540L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT540L_EN_B_0X1     (0x1U<<0)

// LUT540H Configuration

#define GFXMMU_LUT540H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT540H_LO_0         (0x1U<<4)

// LUT541L Configuration

#define GFXMMU_LUT541L_LVB          (0xFFU<<16)
#define GFXMMU_LUT541L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT541L_FVB          (0xFFU<<8)
#define GFXMMU_LUT541L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT541L_EN           (0x1U<<0)
#define GFXMMU_LUT541L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT541L_EN_B_0X1     (0x1U<<0)

// LUT541H Configuration

#define GFXMMU_LUT541H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT541H_LO_0         (0x1U<<4)

// LUT542L Configuration

#define GFXMMU_LUT542L_LVB          (0xFFU<<16)
#define GFXMMU_LUT542L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT542L_FVB          (0xFFU<<8)
#define GFXMMU_LUT542L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT542L_EN           (0x1U<<0)
#define GFXMMU_LUT542L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT542L_EN_B_0X1     (0x1U<<0)

// LUT542H Configuration

#define GFXMMU_LUT542H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT542H_LO_0         (0x1U<<4)

// LUT543L Configuration

#define GFXMMU_LUT543L_LVB          (0xFFU<<16)
#define GFXMMU_LUT543L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT543L_FVB          (0xFFU<<8)
#define GFXMMU_LUT543L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT543L_EN           (0x1U<<0)
#define GFXMMU_LUT543L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT543L_EN_B_0X1     (0x1U<<0)

// LUT543H Configuration

#define GFXMMU_LUT543H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT543H_LO_0         (0x1U<<4)

// LUT544L Configuration

#define GFXMMU_LUT544L_LVB          (0xFFU<<16)
#define GFXMMU_LUT544L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT544L_FVB          (0xFFU<<8)
#define GFXMMU_LUT544L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT544L_EN           (0x1U<<0)
#define GFXMMU_LUT544L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT544L_EN_B_0X1     (0x1U<<0)

// LUT544H Configuration

#define GFXMMU_LUT544H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT544H_LO_0         (0x1U<<4)

// LUT545L Configuration

#define GFXMMU_LUT545L_LVB          (0xFFU<<16)
#define GFXMMU_LUT545L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT545L_FVB          (0xFFU<<8)
#define GFXMMU_LUT545L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT545L_EN           (0x1U<<0)
#define GFXMMU_LUT545L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT545L_EN_B_0X1     (0x1U<<0)

// LUT545H Configuration

#define GFXMMU_LUT545H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT545H_LO_0         (0x1U<<4)

// LUT546L Configuration

#define GFXMMU_LUT546L_LVB          (0xFFU<<16)
#define GFXMMU_LUT546L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT546L_FVB          (0xFFU<<8)
#define GFXMMU_LUT546L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT546L_EN           (0x1U<<0)
#define GFXMMU_LUT546L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT546L_EN_B_0X1     (0x1U<<0)

// LUT546H Configuration

#define GFXMMU_LUT546H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT546H_LO_0         (0x1U<<4)

// LUT547L Configuration

#define GFXMMU_LUT547L_LVB          (0xFFU<<16)
#define GFXMMU_LUT547L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT547L_FVB          (0xFFU<<8)
#define GFXMMU_LUT547L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT547L_EN           (0x1U<<0)
#define GFXMMU_LUT547L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT547L_EN_B_0X1     (0x1U<<0)

// LUT547H Configuration

#define GFXMMU_LUT547H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT547H_LO_0         (0x1U<<4)

// LUT548L Configuration

#define GFXMMU_LUT548L_LVB          (0xFFU<<16)
#define GFXMMU_LUT548L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT548L_FVB          (0xFFU<<8)
#define GFXMMU_LUT548L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT548L_EN           (0x1U<<0)
#define GFXMMU_LUT548L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT548L_EN_B_0X1     (0x1U<<0)

// LUT548H Configuration

#define GFXMMU_LUT548H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT548H_LO_0         (0x1U<<4)

// LUT549L Configuration

#define GFXMMU_LUT549L_LVB          (0xFFU<<16)
#define GFXMMU_LUT549L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT549L_FVB          (0xFFU<<8)
#define GFXMMU_LUT549L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT549L_EN           (0x1U<<0)
#define GFXMMU_LUT549L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT549L_EN_B_0X1     (0x1U<<0)

// LUT549H Configuration

#define GFXMMU_LUT549H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT549H_LO_0         (0x1U<<4)

// LUT550L Configuration

#define GFXMMU_LUT550L_LVB          (0xFFU<<16)
#define GFXMMU_LUT550L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT550L_FVB          (0xFFU<<8)
#define GFXMMU_LUT550L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT550L_EN           (0x1U<<0)
#define GFXMMU_LUT550L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT550L_EN_B_0X1     (0x1U<<0)

// LUT550H Configuration

#define GFXMMU_LUT550H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT550H_LO_0         (0x1U<<4)

// LUT551L Configuration

#define GFXMMU_LUT551L_LVB          (0xFFU<<16)
#define GFXMMU_LUT551L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT551L_FVB          (0xFFU<<8)
#define GFXMMU_LUT551L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT551L_EN           (0x1U<<0)
#define GFXMMU_LUT551L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT551L_EN_B_0X1     (0x1U<<0)

