Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT551H Configuration

#define GFXMMU_LUT551H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT551H_LO_0         (0x1U<<4)

// LUT552L Configuration

#define GFXMMU_LUT552L_LVB          (0xFFU<<16)
#define GFXMMU_LUT552L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT552L_FVB          (0xFFU<<8)
#define GFXMMU_LUT552L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT552L_EN           (0x1U<<0)
#define GFXMMU_LUT552L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT552L_EN_B_0X1     (0x1U<<0)

// LUT552H Configuration

#define GFXMMU_LUT552H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT552H_LO_0         (0x1U<<4)

// LUT553L Configuration

#define GFXMMU_LUT553L_LVB          (0xFFU<<16)
#define GFXMMU_LUT553L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT553L_FVB          (0xFFU<<8)
#define GFXMMU_LUT553L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT553L_EN           (0x1U<<0)
#define GFXMMU_LUT553L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT553L_EN_B_0X1     (0x1U<<0)

// LUT553H Configuration

#define GFXMMU_LUT553H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT553H_LO_0         (0x1U<<4)

// LUT554L Configuration

#define GFXMMU_LUT554L_LVB          (0xFFU<<16)
#define GFXMMU_LUT554L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT554L_FVB          (0xFFU<<8)
#define GFXMMU_LUT554L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT554L_EN           (0x1U<<0)
#define GFXMMU_LUT554L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT554L_EN_B_0X1     (0x1U<<0)

// LUT554H Configuration

#define GFXMMU_LUT554H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT554H_LO_0         (0x1U<<4)

// LUT555L Configuration

#define GFXMMU_LUT555L_LVB          (0xFFU<<16)
#define GFXMMU_LUT555L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT555L_FVB          (0xFFU<<8)
#define GFXMMU_LUT555L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT555L_EN           (0x1U<<0)
#define GFXMMU_LUT555L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT555L_EN_B_0X1     (0x1U<<0)

// LUT555H Configuration

#define GFXMMU_LUT555H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT555H_LO_0         (0x1U<<4)

// LUT556L Configuration

#define GFXMMU_LUT556L_LVB          (0xFFU<<16)
#define GFXMMU_LUT556L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT556L_FVB          (0xFFU<<8)
#define GFXMMU_LUT556L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT556L_EN           (0x1U<<0)
#define GFXMMU_LUT556L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT556L_EN_B_0X1     (0x1U<<0)

// LUT556H Configuration

#define GFXMMU_LUT556H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT556H_LO_0         (0x1U<<4)

// LUT557L Configuration

#define GFXMMU_LUT557L_LVB          (0xFFU<<16)
#define GFXMMU_LUT557L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT557L_FVB          (0xFFU<<8)
#define GFXMMU_LUT557L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT557L_EN           (0x1U<<0)
#define GFXMMU_LUT557L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT557L_EN_B_0X1     (0x1U<<0)

// LUT557H Configuration

#define GFXMMU_LUT557H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT557H_LO_0         (0x1U<<4)

// LUT558L Configuration

#define GFXMMU_LUT558L_LVB          (0xFFU<<16)
#define GFXMMU_LUT558L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT558L_FVB          (0xFFU<<8)
#define GFXMMU_LUT558L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT558L_EN           (0x1U<<0)
#define GFXMMU_LUT558L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT558L_EN_B_0X1     (0x1U<<0)

// LUT558H Configuration

#define GFXMMU_LUT558H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT558H_LO_0         (0x1U<<4)

// LUT559L Configuration

#define GFXMMU_LUT559L_LVB          (0xFFU<<16)
#define GFXMMU_LUT559L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT559L_FVB          (0xFFU<<8)
#define GFXMMU_LUT559L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT559L_EN           (0x1U<<0)
#define GFXMMU_LUT559L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT559L_EN_B_0X1     (0x1U<<0)

// LUT559H Configuration

#define GFXMMU_LUT559H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT559H_LO_0         (0x1U<<4)

// LUT560L Configuration

#define GFXMMU_LUT560L_LVB          (0xFFU<<16)
#define GFXMMU_LUT560L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT560L_FVB          (0xFFU<<8)
#define GFXMMU_LUT560L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT560L_EN           (0x1U<<0)
#define GFXMMU_LUT560L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT560L_EN_B_0X1     (0x1U<<0)

// LUT560H Configuration

#define GFXMMU_LUT560H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT560H_LO_0         (0x1U<<4)

// LUT561L Configuration

#define GFXMMU_LUT561L_LVB          (0xFFU<<16)
#define GFXMMU_LUT561L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT561L_FVB          (0xFFU<<8)
#define GFXMMU_LUT561L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT561L_EN           (0x1U<<0)
#define GFXMMU_LUT561L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT561L_EN_B_0X1     (0x1U<<0)

// LUT561H Configuration

#define GFXMMU_LUT561H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT561H_LO_0         (0x1U<<4)

// LUT562L Configuration

#define GFXMMU_LUT562L_LVB          (0xFFU<<16)
#define GFXMMU_LUT562L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT562L_FVB          (0xFFU<<8)
#define GFXMMU_LUT562L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT562L_EN           (0x1U<<0)
#define GFXMMU_LUT562L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT562L_EN_B_0X1     (0x1U<<0)

// LUT562H Configuration

#define GFXMMU_LUT562H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT562H_LO_0         (0x1U<<4)

// LUT563L Configuration

#define GFXMMU_LUT563L_LVB          (0xFFU<<16)
#define GFXMMU_LUT563L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT563L_FVB          (0xFFU<<8)
#define GFXMMU_LUT563L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT563L_EN           (0x1U<<0)
#define GFXMMU_LUT563L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT563L_EN_B_0X1     (0x1U<<0)

// LUT563H Configuration

#define GFXMMU_LUT563H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT563H_LO_0         (0x1U<<4)

// LUT564L Configuration

#define GFXMMU_LUT564L_LVB          (0xFFU<<16)
#define GFXMMU_LUT564L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT564L_FVB          (0xFFU<<8)
#define GFXMMU_LUT564L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT564L_EN           (0x1U<<0)
#define GFXMMU_LUT564L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT564L_EN_B_0X1     (0x1U<<0)

// LUT564H Configuration

#define GFXMMU_LUT564H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT564H_LO_0         (0x1U<<4)

