Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT565L Configuration

#define GFXMMU_LUT565L_LVB          (0xFFU<<16)
#define GFXMMU_LUT565L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT565L_FVB          (0xFFU<<8)
#define GFXMMU_LUT565L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT565L_EN           (0x1U<<0)
#define GFXMMU_LUT565L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT565L_EN_B_0X1     (0x1U<<0)

// LUT565H Configuration

#define GFXMMU_LUT565H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT565H_LO_0         (0x1U<<4)

// LUT566L Configuration

#define GFXMMU_LUT566L_LVB          (0xFFU<<16)
#define GFXMMU_LUT566L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT566L_FVB          (0xFFU<<8)
#define GFXMMU_LUT566L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT566L_EN           (0x1U<<0)
#define GFXMMU_LUT566L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT566L_EN_B_0X1     (0x1U<<0)

// LUT566H Configuration

#define GFXMMU_LUT566H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT566H_LO_0         (0x1U<<4)

// LUT567L Configuration

#define GFXMMU_LUT567L_LVB          (0xFFU<<16)
#define GFXMMU_LUT567L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT567L_FVB          (0xFFU<<8)
#define GFXMMU_LUT567L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT567L_EN           (0x1U<<0)
#define GFXMMU_LUT567L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT567L_EN_B_0X1     (0x1U<<0)

// LUT567H Configuration

#define GFXMMU_LUT567H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT567H_LO_0         (0x1U<<4)

// LUT568L Configuration

#define GFXMMU_LUT568L_LVB          (0xFFU<<16)
#define GFXMMU_LUT568L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT568L_FVB          (0xFFU<<8)
#define GFXMMU_LUT568L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT568L_EN           (0x1U<<0)
#define GFXMMU_LUT568L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT568L_EN_B_0X1     (0x1U<<0)

// LUT568H Configuration

#define GFXMMU_LUT568H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT568H_LO_0         (0x1U<<4)

// LUT569L Configuration

#define GFXMMU_LUT569L_LVB          (0xFFU<<16)
#define GFXMMU_LUT569L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT569L_FVB          (0xFFU<<8)
#define GFXMMU_LUT569L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT569L_EN           (0x1U<<0)
#define GFXMMU_LUT569L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT569L_EN_B_0X1     (0x1U<<0)

// LUT569H Configuration

#define GFXMMU_LUT569H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT569H_LO_0         (0x1U<<4)

// LUT570L Configuration

#define GFXMMU_LUT570L_LVB          (0xFFU<<16)
#define GFXMMU_LUT570L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT570L_FVB          (0xFFU<<8)
#define GFXMMU_LUT570L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT570L_EN           (0x1U<<0)
#define GFXMMU_LUT570L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT570L_EN_B_0X1     (0x1U<<0)

// LUT570H Configuration

#define GFXMMU_LUT570H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT570H_LO_0         (0x1U<<4)

// LUT571L Configuration

#define GFXMMU_LUT571L_LVB          (0xFFU<<16)
#define GFXMMU_LUT571L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT571L_FVB          (0xFFU<<8)
#define GFXMMU_LUT571L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT571L_EN           (0x1U<<0)
#define GFXMMU_LUT571L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT571L_EN_B_0X1     (0x1U<<0)

// LUT571H Configuration

#define GFXMMU_LUT571H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT571H_LO_0         (0x1U<<4)

// LUT572L Configuration

#define GFXMMU_LUT572L_LVB          (0xFFU<<16)
#define GFXMMU_LUT572L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT572L_FVB          (0xFFU<<8)
#define GFXMMU_LUT572L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT572L_EN           (0x1U<<0)
#define GFXMMU_LUT572L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT572L_EN_B_0X1     (0x1U<<0)

// LUT572H Configuration

#define GFXMMU_LUT572H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT572H_LO_0         (0x1U<<4)

// LUT573L Configuration

#define GFXMMU_LUT573L_LVB          (0xFFU<<16)
#define GFXMMU_LUT573L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT573L_FVB          (0xFFU<<8)
#define GFXMMU_LUT573L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT573L_EN           (0x1U<<0)
#define GFXMMU_LUT573L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT573L_EN_B_0X1     (0x1U<<0)

// LUT573H Configuration

#define GFXMMU_LUT573H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT573H_LO_0         (0x1U<<4)

// LUT574L Configuration

#define GFXMMU_LUT574L_LVB          (0xFFU<<16)
#define GFXMMU_LUT574L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT574L_FVB          (0xFFU<<8)
#define GFXMMU_LUT574L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT574L_EN           (0x1U<<0)
#define GFXMMU_LUT574L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT574L_EN_B_0X1     (0x1U<<0)

// LUT574H Configuration

#define GFXMMU_LUT574H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT574H_LO_0         (0x1U<<4)

// LUT575L Configuration

#define GFXMMU_LUT575L_LVB          (0xFFU<<16)
#define GFXMMU_LUT575L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT575L_FVB          (0xFFU<<8)
#define GFXMMU_LUT575L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT575L_EN           (0x1U<<0)
#define GFXMMU_LUT575L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT575L_EN_B_0X1     (0x1U<<0)

// LUT575H Configuration

#define GFXMMU_LUT575H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT575H_LO_0         (0x1U<<4)

// LUT576L Configuration

#define GFXMMU_LUT576L_LVB          (0xFFU<<16)
#define GFXMMU_LUT576L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT576L_FVB          (0xFFU<<8)
#define GFXMMU_LUT576L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT576L_EN           (0x1U<<0)
#define GFXMMU_LUT576L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT576L_EN_B_0X1     (0x1U<<0)

// LUT576H Configuration

#define GFXMMU_LUT576H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT576H_LO_0         (0x1U<<4)

// LUT577L Configuration

#define GFXMMU_LUT577L_LVB          (0xFFU<<16)
#define GFXMMU_LUT577L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT577L_FVB          (0xFFU<<8)
#define GFXMMU_LUT577L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT577L_EN           (0x1U<<0)
#define GFXMMU_LUT577L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT577L_EN_B_0X1     (0x1U<<0)

// LUT577H Configuration

#define GFXMMU_LUT577H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT577H_LO_0         (0x1U<<4)

// LUT578L Configuration

#define GFXMMU_LUT578L_LVB          (0xFFU<<16)
#define GFXMMU_LUT578L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT578L_FVB          (0xFFU<<8)
#define GFXMMU_LUT578L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT578L_EN           (0x1U<<0)
#define GFXMMU_LUT578L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT578L_EN_B_0X1     (0x1U<<0)

// LUT578H Configuration

