Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT617H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT617H_LO_0         (0x1U<<4)

// LUT618L Configuration

#define GFXMMU_LUT618L_LVB          (0xFFU<<16)
#define GFXMMU_LUT618L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT618L_FVB          (0xFFU<<8)
#define GFXMMU_LUT618L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT618L_EN           (0x1U<<0)
#define GFXMMU_LUT618L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT618L_EN_B_0X1     (0x1U<<0)

// LUT618H Configuration

#define GFXMMU_LUT618H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT618H_LO_0         (0x1U<<4)

// LUT619L Configuration

#define GFXMMU_LUT619L_LVB          (0xFFU<<16)
#define GFXMMU_LUT619L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT619L_FVB          (0xFFU<<8)
#define GFXMMU_LUT619L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT619L_EN           (0x1U<<0)
#define GFXMMU_LUT619L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT619L_EN_B_0X1     (0x1U<<0)

// LUT619H Configuration

#define GFXMMU_LUT619H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT619H_LO_0         (0x1U<<4)

// LUT620L Configuration

#define GFXMMU_LUT620L_LVB          (0xFFU<<16)
#define GFXMMU_LUT620L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT620L_FVB          (0xFFU<<8)
#define GFXMMU_LUT620L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT620L_EN           (0x1U<<0)
#define GFXMMU_LUT620L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT620L_EN_B_0X1     (0x1U<<0)

// LUT620H Configuration

#define GFXMMU_LUT620H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT620H_LO_0         (0x1U<<4)

// LUT621L Configuration

#define GFXMMU_LUT621L_LVB          (0xFFU<<16)
#define GFXMMU_LUT621L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT621L_FVB          (0xFFU<<8)
#define GFXMMU_LUT621L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT621L_EN           (0x1U<<0)
#define GFXMMU_LUT621L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT621L_EN_B_0X1     (0x1U<<0)

// LUT621H Configuration

#define GFXMMU_LUT621H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT621H_LO_0         (0x1U<<4)

// LUT622L Configuration

#define GFXMMU_LUT622L_LVB          (0xFFU<<16)
#define GFXMMU_LUT622L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT622L_FVB          (0xFFU<<8)
#define GFXMMU_LUT622L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT622L_EN           (0x1U<<0)
#define GFXMMU_LUT622L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT622L_EN_B_0X1     (0x1U<<0)

// LUT622H Configuration

#define GFXMMU_LUT622H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT622H_LO_0         (0x1U<<4)

// LUT623L Configuration

#define GFXMMU_LUT623L_LVB          (0xFFU<<16)
#define GFXMMU_LUT623L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT623L_FVB          (0xFFU<<8)
#define GFXMMU_LUT623L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT623L_EN           (0x1U<<0)
#define GFXMMU_LUT623L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT623L_EN_B_0X1     (0x1U<<0)

// LUT623H Configuration

#define GFXMMU_LUT623H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT623H_LO_0         (0x1U<<4)

// LUT624L Configuration

#define GFXMMU_LUT624L_LVB          (0xFFU<<16)
#define GFXMMU_LUT624L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT624L_FVB          (0xFFU<<8)
#define GFXMMU_LUT624L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT624L_EN           (0x1U<<0)
#define GFXMMU_LUT624L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT624L_EN_B_0X1     (0x1U<<0)

// LUT624H Configuration

#define GFXMMU_LUT624H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT624H_LO_0         (0x1U<<4)

// LUT625L Configuration

#define GFXMMU_LUT625L_LVB          (0xFFU<<16)
#define GFXMMU_LUT625L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT625L_FVB          (0xFFU<<8)
#define GFXMMU_LUT625L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT625L_EN           (0x1U<<0)
#define GFXMMU_LUT625L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT625L_EN_B_0X1     (0x1U<<0)

// LUT625H Configuration

#define GFXMMU_LUT625H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT625H_LO_0         (0x1U<<4)

// LUT626L Configuration

#define GFXMMU_LUT626L_LVB          (0xFFU<<16)
#define GFXMMU_LUT626L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT626L_FVB          (0xFFU<<8)
#define GFXMMU_LUT626L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT626L_EN           (0x1U<<0)
#define GFXMMU_LUT626L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT626L_EN_B_0X1     (0x1U<<0)

// LUT626H Configuration

#define GFXMMU_LUT626H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT626H_LO_0         (0x1U<<4)

// LUT627L Configuration

#define GFXMMU_LUT627L_LVB          (0xFFU<<16)
#define GFXMMU_LUT627L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT627L_FVB          (0xFFU<<8)
#define GFXMMU_LUT627L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT627L_EN           (0x1U<<0)
#define GFXMMU_LUT627L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT627L_EN_B_0X1     (0x1U<<0)

// LUT627H Configuration

#define GFXMMU_LUT627H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT627H_LO_0         (0x1U<<4)

// LUT628L Configuration

#define GFXMMU_LUT628L_LVB          (0xFFU<<16)
#define GFXMMU_LUT628L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT628L_FVB          (0xFFU<<8)
#define GFXMMU_LUT628L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT628L_EN           (0x1U<<0)
#define GFXMMU_LUT628L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT628L_EN_B_0X1     (0x1U<<0)

// LUT628H Configuration

#define GFXMMU_LUT628H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT628H_LO_0         (0x1U<<4)

// LUT629L Configuration

#define GFXMMU_LUT629L_LVB          (0xFFU<<16)
#define GFXMMU_LUT629L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT629L_FVB          (0xFFU<<8)
#define GFXMMU_LUT629L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT629L_EN           (0x1U<<0)
#define GFXMMU_LUT629L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT629L_EN_B_0X1     (0x1U<<0)

// LUT629H Configuration

#define GFXMMU_LUT629H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT629H_LO_0         (0x1U<<4)

// LUT630L Configuration

#define GFXMMU_LUT630L_LVB          (0xFFU<<16)
#define GFXMMU_LUT630L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT630L_FVB          (0xFFU<<8)
#define GFXMMU_LUT630L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT630L_EN           (0x1U<<0)
#define GFXMMU_LUT630L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT630L_EN_B_0X1     (0x1U<<0)

// LUT630H Configuration

#define GFXMMU_LUT630H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT630H_LO_0         (0x1U<<4)

// LUT631L Configuration

