Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT631L_LVB          (0xFFU<<16)
#define GFXMMU_LUT631L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT631L_FVB          (0xFFU<<8)
#define GFXMMU_LUT631L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT631L_EN           (0x1U<<0)
#define GFXMMU_LUT631L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT631L_EN_B_0X1     (0x1U<<0)

// LUT631H Configuration

#define GFXMMU_LUT631H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT631H_LO_0         (0x1U<<4)

// LUT632L Configuration

#define GFXMMU_LUT632L_LVB          (0xFFU<<16)
#define GFXMMU_LUT632L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT632L_FVB          (0xFFU<<8)
#define GFXMMU_LUT632L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT632L_EN           (0x1U<<0)
#define GFXMMU_LUT632L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT632L_EN_B_0X1     (0x1U<<0)

// LUT632H Configuration

#define GFXMMU_LUT632H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT632H_LO_0         (0x1U<<4)

// LUT633L Configuration

#define GFXMMU_LUT633L_LVB          (0xFFU<<16)
#define GFXMMU_LUT633L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT633L_FVB          (0xFFU<<8)
#define GFXMMU_LUT633L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT633L_EN           (0x1U<<0)
#define GFXMMU_LUT633L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT633L_EN_B_0X1     (0x1U<<0)

// LUT633H Configuration

#define GFXMMU_LUT633H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT633H_LO_0         (0x1U<<4)

// LUT634L Configuration

#define GFXMMU_LUT634L_LVB          (0xFFU<<16)
#define GFXMMU_LUT634L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT634L_FVB          (0xFFU<<8)
#define GFXMMU_LUT634L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT634L_EN           (0x1U<<0)
#define GFXMMU_LUT634L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT634L_EN_B_0X1     (0x1U<<0)

// LUT634H Configuration

#define GFXMMU_LUT634H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT634H_LO_0         (0x1U<<4)

// LUT635L Configuration

#define GFXMMU_LUT635L_LVB          (0xFFU<<16)
#define GFXMMU_LUT635L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT635L_FVB          (0xFFU<<8)
#define GFXMMU_LUT635L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT635L_EN           (0x1U<<0)
#define GFXMMU_LUT635L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT635L_EN_B_0X1     (0x1U<<0)

// LUT635H Configuration

#define GFXMMU_LUT635H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT635H_LO_0         (0x1U<<4)

// LUT636L Configuration

#define GFXMMU_LUT636L_LVB          (0xFFU<<16)
#define GFXMMU_LUT636L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT636L_FVB          (0xFFU<<8)
#define GFXMMU_LUT636L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT636L_EN           (0x1U<<0)
#define GFXMMU_LUT636L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT636L_EN_B_0X1     (0x1U<<0)

// LUT636H Configuration

#define GFXMMU_LUT636H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT636H_LO_0         (0x1U<<4)

// LUT637L Configuration

#define GFXMMU_LUT637L_LVB          (0xFFU<<16)
#define GFXMMU_LUT637L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT637L_FVB          (0xFFU<<8)
#define GFXMMU_LUT637L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT637L_EN           (0x1U<<0)
#define GFXMMU_LUT637L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT637L_EN_B_0X1     (0x1U<<0)

// LUT637H Configuration

#define GFXMMU_LUT637H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT637H_LO_0         (0x1U<<4)

// LUT638L Configuration

#define GFXMMU_LUT638L_LVB          (0xFFU<<16)
#define GFXMMU_LUT638L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT638L_FVB          (0xFFU<<8)
#define GFXMMU_LUT638L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT638L_EN           (0x1U<<0)
#define GFXMMU_LUT638L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT638L_EN_B_0X1     (0x1U<<0)

// LUT638H Configuration

#define GFXMMU_LUT638H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT638H_LO_0         (0x1U<<4)

// LUT639L Configuration

#define GFXMMU_LUT639L_LVB          (0xFFU<<16)
#define GFXMMU_LUT639L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT639L_FVB          (0xFFU<<8)
#define GFXMMU_LUT639L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT639L_EN           (0x1U<<0)
#define GFXMMU_LUT639L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT639L_EN_B_0X1     (0x1U<<0)

// LUT639H Configuration

#define GFXMMU_LUT639H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT639H_LO_0         (0x1U<<4)

// LUT640L Configuration

#define GFXMMU_LUT640L_LVB          (0xFFU<<16)
#define GFXMMU_LUT640L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT640L_FVB          (0xFFU<<8)
#define GFXMMU_LUT640L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT640L_EN           (0x1U<<0)
#define GFXMMU_LUT640L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT640L_EN_B_0X1     (0x1U<<0)

// LUT640H Configuration

#define GFXMMU_LUT640H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT640H_LO_0         (0x1U<<4)

// LUT641L Configuration

#define GFXMMU_LUT641L_LVB          (0xFFU<<16)
#define GFXMMU_LUT641L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT641L_FVB          (0xFFU<<8)
#define GFXMMU_LUT641L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT641L_EN           (0x1U<<0)
#define GFXMMU_LUT641L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT641L_EN_B_0X1     (0x1U<<0)

// LUT641H Configuration

#define GFXMMU_LUT641H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT641H_LO_0         (0x1U<<4)

// LUT642L Configuration

#define GFXMMU_LUT642L_LVB          (0xFFU<<16)
#define GFXMMU_LUT642L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT642L_FVB          (0xFFU<<8)
#define GFXMMU_LUT642L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT642L_EN           (0x1U<<0)
#define GFXMMU_LUT642L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT642L_EN_B_0X1     (0x1U<<0)

// LUT642H Configuration

#define GFXMMU_LUT642H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT642H_LO_0         (0x1U<<4)

// LUT643L Configuration

#define GFXMMU_LUT643L_LVB          (0xFFU<<16)
#define GFXMMU_LUT643L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT643L_FVB          (0xFFU<<8)
#define GFXMMU_LUT643L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT643L_EN           (0x1U<<0)
#define GFXMMU_LUT643L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT643L_EN_B_0X1     (0x1U<<0)

// LUT643H Configuration

#define GFXMMU_LUT643H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT643H_LO_0         (0x1U<<4)

