Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT656H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT656H_LO_0         (0x1U<<4)

// LUT657L Configuration

#define GFXMMU_LUT657L_LVB          (0xFFU<<16)
#define GFXMMU_LUT657L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT657L_FVB          (0xFFU<<8)
#define GFXMMU_LUT657L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT657L_EN           (0x1U<<0)
#define GFXMMU_LUT657L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT657L_EN_B_0X1     (0x1U<<0)

// LUT657H Configuration

#define GFXMMU_LUT657H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT657H_LO_0         (0x1U<<4)

// LUT658L Configuration

#define GFXMMU_LUT658L_LVB          (0xFFU<<16)
#define GFXMMU_LUT658L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT658L_FVB          (0xFFU<<8)
#define GFXMMU_LUT658L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT658L_EN           (0x1U<<0)
#define GFXMMU_LUT658L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT658L_EN_B_0X1     (0x1U<<0)

// LUT658H Configuration

#define GFXMMU_LUT658H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT658H_LO_0         (0x1U<<4)

// LUT659L Configuration

#define GFXMMU_LUT659L_LVB          (0xFFU<<16)
#define GFXMMU_LUT659L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT659L_FVB          (0xFFU<<8)
#define GFXMMU_LUT659L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT659L_EN           (0x1U<<0)
#define GFXMMU_LUT659L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT659L_EN_B_0X1     (0x1U<<0)

// LUT659H Configuration

#define GFXMMU_LUT659H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT659H_LO_0         (0x1U<<4)

// LUT660L Configuration

#define GFXMMU_LUT660L_LVB          (0xFFU<<16)
#define GFXMMU_LUT660L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT660L_FVB          (0xFFU<<8)
#define GFXMMU_LUT660L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT660L_EN           (0x1U<<0)
#define GFXMMU_LUT660L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT660L_EN_B_0X1     (0x1U<<0)

// LUT660H Configuration

#define GFXMMU_LUT660H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT660H_LO_0         (0x1U<<4)

// LUT661L Configuration

#define GFXMMU_LUT661L_LVB          (0xFFU<<16)
#define GFXMMU_LUT661L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT661L_FVB          (0xFFU<<8)
#define GFXMMU_LUT661L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT661L_EN           (0x1U<<0)
#define GFXMMU_LUT661L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT661L_EN_B_0X1     (0x1U<<0)

// LUT661H Configuration

#define GFXMMU_LUT661H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT661H_LO_0         (0x1U<<4)

// LUT662L Configuration

#define GFXMMU_LUT662L_LVB          (0xFFU<<16)
#define GFXMMU_LUT662L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT662L_FVB          (0xFFU<<8)
#define GFXMMU_LUT662L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT662L_EN           (0x1U<<0)
#define GFXMMU_LUT662L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT662L_EN_B_0X1     (0x1U<<0)

// LUT662H Configuration

#define GFXMMU_LUT662H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT662H_LO_0         (0x1U<<4)

// LUT663L Configuration

#define GFXMMU_LUT663L_LVB          (0xFFU<<16)
#define GFXMMU_LUT663L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT663L_FVB          (0xFFU<<8)
#define GFXMMU_LUT663L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT663L_EN           (0x1U<<0)
#define GFXMMU_LUT663L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT663L_EN_B_0X1     (0x1U<<0)

// LUT663H Configuration

#define GFXMMU_LUT663H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT663H_LO_0         (0x1U<<4)

// LUT664L Configuration

#define GFXMMU_LUT664L_LVB          (0xFFU<<16)
#define GFXMMU_LUT664L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT664L_FVB          (0xFFU<<8)
#define GFXMMU_LUT664L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT664L_EN           (0x1U<<0)
#define GFXMMU_LUT664L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT664L_EN_B_0X1     (0x1U<<0)

// LUT664H Configuration

#define GFXMMU_LUT664H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT664H_LO_0         (0x1U<<4)

// LUT665L Configuration

#define GFXMMU_LUT665L_LVB          (0xFFU<<16)
#define GFXMMU_LUT665L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT665L_FVB          (0xFFU<<8)
#define GFXMMU_LUT665L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT665L_EN           (0x1U<<0)
#define GFXMMU_LUT665L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT665L_EN_B_0X1     (0x1U<<0)

// LUT665H Configuration

#define GFXMMU_LUT665H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT665H_LO_0         (0x1U<<4)

// LUT666L Configuration

#define GFXMMU_LUT666L_LVB          (0xFFU<<16)
#define GFXMMU_LUT666L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT666L_FVB          (0xFFU<<8)
#define GFXMMU_LUT666L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT666L_EN           (0x1U<<0)
#define GFXMMU_LUT666L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT666L_EN_B_0X1     (0x1U<<0)

// LUT666H Configuration

#define GFXMMU_LUT666H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT666H_LO_0         (0x1U<<4)

// LUT667L Configuration

#define GFXMMU_LUT667L_LVB          (0xFFU<<16)
#define GFXMMU_LUT667L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT667L_FVB          (0xFFU<<8)
#define GFXMMU_LUT667L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT667L_EN           (0x1U<<0)
#define GFXMMU_LUT667L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT667L_EN_B_0X1     (0x1U<<0)

// LUT667H Configuration

#define GFXMMU_LUT667H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT667H_LO_0         (0x1U<<4)

// LUT668L Configuration

#define GFXMMU_LUT668L_LVB          (0xFFU<<16)
#define GFXMMU_LUT668L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT668L_FVB          (0xFFU<<8)
#define GFXMMU_LUT668L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT668L_EN           (0x1U<<0)
#define GFXMMU_LUT668L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT668L_EN_B_0X1     (0x1U<<0)

// LUT668H Configuration

#define GFXMMU_LUT668H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT668H_LO_0         (0x1U<<4)

// LUT669L Configuration

#define GFXMMU_LUT669L_LVB          (0xFFU<<16)
#define GFXMMU_LUT669L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT669L_FVB          (0xFFU<<8)
#define GFXMMU_LUT669L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT669L_EN           (0x1U<<0)
#define GFXMMU_LUT669L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT669L_EN_B_0X1     (0x1U<<0)

// LUT669H Configuration

#define GFXMMU_LUT669H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT669H_LO_0         (0x1U<<4)

// LUT670L Configuration

#define GFXMMU_LUT670L_LVB          (0xFFU<<16)
#define GFXMMU_LUT670L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT670L_FVB          (0xFFU<<8)
#define GFXMMU_LUT670L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT670L_EN           (0x1U<<0)
#define GFXMMU_LUT670L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT670L_EN_B_0X1     (0x1U<<0)

