Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT670H Configuration

#define GFXMMU_LUT670H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT670H_LO_0         (0x1U<<4)

// LUT671L Configuration

#define GFXMMU_LUT671L_LVB          (0xFFU<<16)
#define GFXMMU_LUT671L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT671L_FVB          (0xFFU<<8)
#define GFXMMU_LUT671L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT671L_EN           (0x1U<<0)
#define GFXMMU_LUT671L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT671L_EN_B_0X1     (0x1U<<0)

// LUT671H Configuration

#define GFXMMU_LUT671H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT671H_LO_0         (0x1U<<4)

// LUT672L Configuration

#define GFXMMU_LUT672L_LVB          (0xFFU<<16)
#define GFXMMU_LUT672L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT672L_FVB          (0xFFU<<8)
#define GFXMMU_LUT672L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT672L_EN           (0x1U<<0)
#define GFXMMU_LUT672L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT672L_EN_B_0X1     (0x1U<<0)

// LUT672H Configuration

#define GFXMMU_LUT672H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT672H_LO_0         (0x1U<<4)

// LUT673L Configuration

#define GFXMMU_LUT673L_LVB          (0xFFU<<16)
#define GFXMMU_LUT673L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT673L_FVB          (0xFFU<<8)
#define GFXMMU_LUT673L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT673L_EN           (0x1U<<0)
#define GFXMMU_LUT673L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT673L_EN_B_0X1     (0x1U<<0)

// LUT673H Configuration

#define GFXMMU_LUT673H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT673H_LO_0         (0x1U<<4)

// LUT674L Configuration

#define GFXMMU_LUT674L_LVB          (0xFFU<<16)
#define GFXMMU_LUT674L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT674L_FVB          (0xFFU<<8)
#define GFXMMU_LUT674L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT674L_EN           (0x1U<<0)
#define GFXMMU_LUT674L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT674L_EN_B_0X1     (0x1U<<0)

// LUT674H Configuration

#define GFXMMU_LUT674H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT674H_LO_0         (0x1U<<4)

// LUT675L Configuration

#define GFXMMU_LUT675L_LVB          (0xFFU<<16)
#define GFXMMU_LUT675L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT675L_FVB          (0xFFU<<8)
#define GFXMMU_LUT675L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT675L_EN           (0x1U<<0)
#define GFXMMU_LUT675L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT675L_EN_B_0X1     (0x1U<<0)

// LUT675H Configuration

#define GFXMMU_LUT675H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT675H_LO_0         (0x1U<<4)

// LUT676L Configuration

#define GFXMMU_LUT676L_LVB          (0xFFU<<16)
#define GFXMMU_LUT676L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT676L_FVB          (0xFFU<<8)
#define GFXMMU_LUT676L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT676L_EN           (0x1U<<0)
#define GFXMMU_LUT676L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT676L_EN_B_0X1     (0x1U<<0)

// LUT676H Configuration

#define GFXMMU_LUT676H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT676H_LO_0         (0x1U<<4)

// LUT677L Configuration

#define GFXMMU_LUT677L_LVB          (0xFFU<<16)
#define GFXMMU_LUT677L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT677L_FVB          (0xFFU<<8)
#define GFXMMU_LUT677L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT677L_EN           (0x1U<<0)
#define GFXMMU_LUT677L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT677L_EN_B_0X1     (0x1U<<0)

// LUT677H Configuration

#define GFXMMU_LUT677H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT677H_LO_0         (0x1U<<4)

// LUT678L Configuration

#define GFXMMU_LUT678L_LVB          (0xFFU<<16)
#define GFXMMU_LUT678L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT678L_FVB          (0xFFU<<8)
#define GFXMMU_LUT678L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT678L_EN           (0x1U<<0)
#define GFXMMU_LUT678L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT678L_EN_B_0X1     (0x1U<<0)

// LUT678H Configuration

#define GFXMMU_LUT678H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT678H_LO_0         (0x1U<<4)

// LUT679L Configuration

#define GFXMMU_LUT679L_LVB          (0xFFU<<16)
#define GFXMMU_LUT679L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT679L_FVB          (0xFFU<<8)
#define GFXMMU_LUT679L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT679L_EN           (0x1U<<0)
#define GFXMMU_LUT679L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT679L_EN_B_0X1     (0x1U<<0)

// LUT679H Configuration

#define GFXMMU_LUT679H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT679H_LO_0         (0x1U<<4)

// LUT680L Configuration

#define GFXMMU_LUT680L_LVB          (0xFFU<<16)
#define GFXMMU_LUT680L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT680L_FVB          (0xFFU<<8)
#define GFXMMU_LUT680L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT680L_EN           (0x1U<<0)
#define GFXMMU_LUT680L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT680L_EN_B_0X1     (0x1U<<0)

// LUT680H Configuration

#define GFXMMU_LUT680H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT680H_LO_0         (0x1U<<4)

// LUT681L Configuration

#define GFXMMU_LUT681L_LVB          (0xFFU<<16)
#define GFXMMU_LUT681L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT681L_FVB          (0xFFU<<8)
#define GFXMMU_LUT681L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT681L_EN           (0x1U<<0)
#define GFXMMU_LUT681L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT681L_EN_B_0X1     (0x1U<<0)

// LUT681H Configuration

#define GFXMMU_LUT681H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT681H_LO_0         (0x1U<<4)

// LUT682L Configuration

#define GFXMMU_LUT682L_LVB          (0xFFU<<16)
#define GFXMMU_LUT682L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT682L_FVB          (0xFFU<<8)
#define GFXMMU_LUT682L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT682L_EN           (0x1U<<0)
#define GFXMMU_LUT682L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT682L_EN_B_0X1     (0x1U<<0)

// LUT682H Configuration

#define GFXMMU_LUT682H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT682H_LO_0         (0x1U<<4)

// LUT683L Configuration

#define GFXMMU_LUT683L_LVB          (0xFFU<<16)
#define GFXMMU_LUT683L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT683L_FVB          (0xFFU<<8)
#define GFXMMU_LUT683L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT683L_EN           (0x1U<<0)
#define GFXMMU_LUT683L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT683L_EN_B_0X1     (0x1U<<0)

// LUT683H Configuration

