Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT683H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT683H_LO_0         (0x1U<<4)

// LUT684L Configuration

#define GFXMMU_LUT684L_LVB          (0xFFU<<16)
#define GFXMMU_LUT684L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT684L_FVB          (0xFFU<<8)
#define GFXMMU_LUT684L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT684L_EN           (0x1U<<0)
#define GFXMMU_LUT684L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT684L_EN_B_0X1     (0x1U<<0)

// LUT684H Configuration

#define GFXMMU_LUT684H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT684H_LO_0         (0x1U<<4)

// LUT685L Configuration

#define GFXMMU_LUT685L_LVB          (0xFFU<<16)
#define GFXMMU_LUT685L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT685L_FVB          (0xFFU<<8)
#define GFXMMU_LUT685L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT685L_EN           (0x1U<<0)
#define GFXMMU_LUT685L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT685L_EN_B_0X1     (0x1U<<0)

// LUT685H Configuration

#define GFXMMU_LUT685H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT685H_LO_0         (0x1U<<4)

// LUT686L Configuration

#define GFXMMU_LUT686L_LVB          (0xFFU<<16)
#define GFXMMU_LUT686L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT686L_FVB          (0xFFU<<8)
#define GFXMMU_LUT686L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT686L_EN           (0x1U<<0)
#define GFXMMU_LUT686L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT686L_EN_B_0X1     (0x1U<<0)

// LUT686H Configuration

#define GFXMMU_LUT686H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT686H_LO_0         (0x1U<<4)

// LUT687L Configuration

#define GFXMMU_LUT687L_LVB          (0xFFU<<16)
#define GFXMMU_LUT687L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT687L_FVB          (0xFFU<<8)
#define GFXMMU_LUT687L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT687L_EN           (0x1U<<0)
#define GFXMMU_LUT687L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT687L_EN_B_0X1     (0x1U<<0)

// LUT687H Configuration

#define GFXMMU_LUT687H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT687H_LO_0         (0x1U<<4)

// LUT688L Configuration

#define GFXMMU_LUT688L_LVB          (0xFFU<<16)
#define GFXMMU_LUT688L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT688L_FVB          (0xFFU<<8)
#define GFXMMU_LUT688L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT688L_EN           (0x1U<<0)
#define GFXMMU_LUT688L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT688L_EN_B_0X1     (0x1U<<0)

// LUT688H Configuration

#define GFXMMU_LUT688H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT688H_LO_0         (0x1U<<4)

// LUT689L Configuration

#define GFXMMU_LUT689L_LVB          (0xFFU<<16)
#define GFXMMU_LUT689L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT689L_FVB          (0xFFU<<8)
#define GFXMMU_LUT689L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT689L_EN           (0x1U<<0)
#define GFXMMU_LUT689L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT689L_EN_B_0X1     (0x1U<<0)

// LUT689H Configuration

#define GFXMMU_LUT689H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT689H_LO_0         (0x1U<<4)

// LUT690L Configuration

#define GFXMMU_LUT690L_LVB          (0xFFU<<16)
#define GFXMMU_LUT690L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT690L_FVB          (0xFFU<<8)
#define GFXMMU_LUT690L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT690L_EN           (0x1U<<0)
#define GFXMMU_LUT690L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT690L_EN_B_0X1     (0x1U<<0)

// LUT690H Configuration

#define GFXMMU_LUT690H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT690H_LO_0         (0x1U<<4)

// LUT691L Configuration

#define GFXMMU_LUT691L_LVB          (0xFFU<<16)
#define GFXMMU_LUT691L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT691L_FVB          (0xFFU<<8)
#define GFXMMU_LUT691L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT691L_EN           (0x1U<<0)
#define GFXMMU_LUT691L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT691L_EN_B_0X1     (0x1U<<0)

// LUT691H Configuration

#define GFXMMU_LUT691H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT691H_LO_0         (0x1U<<4)

// LUT692L Configuration

#define GFXMMU_LUT692L_LVB          (0xFFU<<16)
#define GFXMMU_LUT692L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT692L_FVB          (0xFFU<<8)
#define GFXMMU_LUT692L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT692L_EN           (0x1U<<0)
#define GFXMMU_LUT692L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT692L_EN_B_0X1     (0x1U<<0)

// LUT692H Configuration

#define GFXMMU_LUT692H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT692H_LO_0         (0x1U<<4)

// LUT693L Configuration

#define GFXMMU_LUT693L_LVB          (0xFFU<<16)
#define GFXMMU_LUT693L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT693L_FVB          (0xFFU<<8)
#define GFXMMU_LUT693L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT693L_EN           (0x1U<<0)
#define GFXMMU_LUT693L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT693L_EN_B_0X1     (0x1U<<0)

// LUT693H Configuration

#define GFXMMU_LUT693H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT693H_LO_0         (0x1U<<4)

// LUT694L Configuration

#define GFXMMU_LUT694L_LVB          (0xFFU<<16)
#define GFXMMU_LUT694L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT694L_FVB          (0xFFU<<8)
#define GFXMMU_LUT694L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT694L_EN           (0x1U<<0)
#define GFXMMU_LUT694L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT694L_EN_B_0X1     (0x1U<<0)

// LUT694H Configuration

#define GFXMMU_LUT694H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT694H_LO_0         (0x1U<<4)

// LUT695L Configuration

#define GFXMMU_LUT695L_LVB          (0xFFU<<16)
#define GFXMMU_LUT695L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT695L_FVB          (0xFFU<<8)
#define GFXMMU_LUT695L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT695L_EN           (0x1U<<0)
#define GFXMMU_LUT695L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT695L_EN_B_0X1     (0x1U<<0)

// LUT695H Configuration

#define GFXMMU_LUT695H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT695H_LO_0         (0x1U<<4)

// LUT696L Configuration

#define GFXMMU_LUT696L_LVB          (0xFFU<<16)
#define GFXMMU_LUT696L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT696L_FVB          (0xFFU<<8)
#define GFXMMU_LUT696L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT696L_EN           (0x1U<<0)
#define GFXMMU_LUT696L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT696L_EN_B_0X1     (0x1U<<0)

// LUT696H Configuration

#define GFXMMU_LUT696H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT696H_LO_0         (0x1U<<4)

