Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT697L Configuration

#define GFXMMU_LUT697L_LVB          (0xFFU<<16)
#define GFXMMU_LUT697L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT697L_FVB          (0xFFU<<8)
#define GFXMMU_LUT697L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT697L_EN           (0x1U<<0)
#define GFXMMU_LUT697L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT697L_EN_B_0X1     (0x1U<<0)

// LUT697H Configuration

#define GFXMMU_LUT697H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT697H_LO_0         (0x1U<<4)

// LUT698L Configuration

#define GFXMMU_LUT698L_LVB          (0xFFU<<16)
#define GFXMMU_LUT698L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT698L_FVB          (0xFFU<<8)
#define GFXMMU_LUT698L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT698L_EN           (0x1U<<0)
#define GFXMMU_LUT698L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT698L_EN_B_0X1     (0x1U<<0)

// LUT698H Configuration

#define GFXMMU_LUT698H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT698H_LO_0         (0x1U<<4)

// LUT699L Configuration

#define GFXMMU_LUT699L_LVB          (0xFFU<<16)
#define GFXMMU_LUT699L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT699L_FVB          (0xFFU<<8)
#define GFXMMU_LUT699L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT699L_EN           (0x1U<<0)
#define GFXMMU_LUT699L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT699L_EN_B_0X1     (0x1U<<0)

// LUT699H Configuration

#define GFXMMU_LUT699H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT699H_LO_0         (0x1U<<4)

// LUT700L Configuration

#define GFXMMU_LUT700L_LVB          (0xFFU<<16)
#define GFXMMU_LUT700L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT700L_FVB          (0xFFU<<8)
#define GFXMMU_LUT700L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT700L_EN           (0x1U<<0)
#define GFXMMU_LUT700L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT700L_EN_B_0X1     (0x1U<<0)

// LUT700H Configuration

#define GFXMMU_LUT700H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT700H_LO_0         (0x1U<<4)

// LUT701L Configuration

#define GFXMMU_LUT701L_LVB          (0xFFU<<16)
#define GFXMMU_LUT701L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT701L_FVB          (0xFFU<<8)
#define GFXMMU_LUT701L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT701L_EN           (0x1U<<0)
#define GFXMMU_LUT701L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT701L_EN_B_0X1     (0x1U<<0)

// LUT701H Configuration

#define GFXMMU_LUT701H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT701H_LO_0         (0x1U<<4)

// LUT702L Configuration

#define GFXMMU_LUT702L_LVB          (0xFFU<<16)
#define GFXMMU_LUT702L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT702L_FVB          (0xFFU<<8)
#define GFXMMU_LUT702L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT702L_EN           (0x1U<<0)
#define GFXMMU_LUT702L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT702L_EN_B_0X1     (0x1U<<0)

// LUT702H Configuration

#define GFXMMU_LUT702H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT702H_LO_0         (0x1U<<4)

// LUT703L Configuration

#define GFXMMU_LUT703L_LVB          (0xFFU<<16)
#define GFXMMU_LUT703L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT703L_FVB          (0xFFU<<8)
#define GFXMMU_LUT703L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT703L_EN           (0x1U<<0)
#define GFXMMU_LUT703L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT703L_EN_B_0X1     (0x1U<<0)

// LUT703H Configuration

#define GFXMMU_LUT703H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT703H_LO_0         (0x1U<<4)

// LUT704L Configuration

#define GFXMMU_LUT704L_LVB          (0xFFU<<16)
#define GFXMMU_LUT704L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT704L_FVB          (0xFFU<<8)
#define GFXMMU_LUT704L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT704L_EN           (0x1U<<0)
#define GFXMMU_LUT704L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT704L_EN_B_0X1     (0x1U<<0)

// LUT704H Configuration

#define GFXMMU_LUT704H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT704H_LO_0         (0x1U<<4)

// LUT705L Configuration

#define GFXMMU_LUT705L_LVB          (0xFFU<<16)
#define GFXMMU_LUT705L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT705L_FVB          (0xFFU<<8)
#define GFXMMU_LUT705L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT705L_EN           (0x1U<<0)
#define GFXMMU_LUT705L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT705L_EN_B_0X1     (0x1U<<0)

// LUT705H Configuration

#define GFXMMU_LUT705H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT705H_LO_0         (0x1U<<4)

// LUT706L Configuration

#define GFXMMU_LUT706L_LVB          (0xFFU<<16)
#define GFXMMU_LUT706L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT706L_FVB          (0xFFU<<8)
#define GFXMMU_LUT706L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT706L_EN           (0x1U<<0)
#define GFXMMU_LUT706L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT706L_EN_B_0X1     (0x1U<<0)

// LUT706H Configuration

#define GFXMMU_LUT706H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT706H_LO_0         (0x1U<<4)

// LUT707L Configuration

#define GFXMMU_LUT707L_LVB          (0xFFU<<16)
#define GFXMMU_LUT707L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT707L_FVB          (0xFFU<<8)
#define GFXMMU_LUT707L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT707L_EN           (0x1U<<0)
#define GFXMMU_LUT707L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT707L_EN_B_0X1     (0x1U<<0)

// LUT707H Configuration

#define GFXMMU_LUT707H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT707H_LO_0         (0x1U<<4)

// LUT708L Configuration

#define GFXMMU_LUT708L_LVB          (0xFFU<<16)
#define GFXMMU_LUT708L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT708L_FVB          (0xFFU<<8)
#define GFXMMU_LUT708L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT708L_EN           (0x1U<<0)
#define GFXMMU_LUT708L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT708L_EN_B_0X1     (0x1U<<0)

// LUT708H Configuration

#define GFXMMU_LUT708H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT708H_LO_0         (0x1U<<4)

// LUT709L Configuration

#define GFXMMU_LUT709L_LVB          (0xFFU<<16)
#define GFXMMU_LUT709L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT709L_FVB          (0xFFU<<8)
#define GFXMMU_LUT709L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT709L_EN           (0x1U<<0)
#define GFXMMU_LUT709L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT709L_EN_B_0X1     (0x1U<<0)

