Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT709H Configuration

#define GFXMMU_LUT709H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT709H_LO_0         (0x1U<<4)

// LUT710L Configuration

#define GFXMMU_LUT710L_LVB          (0xFFU<<16)
#define GFXMMU_LUT710L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT710L_FVB          (0xFFU<<8)
#define GFXMMU_LUT710L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT710L_EN           (0x1U<<0)
#define GFXMMU_LUT710L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT710L_EN_B_0X1     (0x1U<<0)

// LUT710H Configuration

#define GFXMMU_LUT710H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT710H_LO_0         (0x1U<<4)

// LUT711L Configuration

#define GFXMMU_LUT711L_LVB          (0xFFU<<16)
#define GFXMMU_LUT711L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT711L_FVB          (0xFFU<<8)
#define GFXMMU_LUT711L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT711L_EN           (0x1U<<0)
#define GFXMMU_LUT711L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT711L_EN_B_0X1     (0x1U<<0)

// LUT711H Configuration

#define GFXMMU_LUT711H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT711H_LO_0         (0x1U<<4)

// LUT712L Configuration

#define GFXMMU_LUT712L_LVB          (0xFFU<<16)
#define GFXMMU_LUT712L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT712L_FVB          (0xFFU<<8)
#define GFXMMU_LUT712L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT712L_EN           (0x1U<<0)
#define GFXMMU_LUT712L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT712L_EN_B_0X1     (0x1U<<0)

// LUT712H Configuration

#define GFXMMU_LUT712H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT712H_LO_0         (0x1U<<4)

// LUT713L Configuration

#define GFXMMU_LUT713L_LVB          (0xFFU<<16)
#define GFXMMU_LUT713L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT713L_FVB          (0xFFU<<8)
#define GFXMMU_LUT713L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT713L_EN           (0x1U<<0)
#define GFXMMU_LUT713L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT713L_EN_B_0X1     (0x1U<<0)

// LUT713H Configuration

#define GFXMMU_LUT713H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT713H_LO_0         (0x1U<<4)

// LUT714L Configuration

#define GFXMMU_LUT714L_LVB          (0xFFU<<16)
#define GFXMMU_LUT714L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT714L_FVB          (0xFFU<<8)
#define GFXMMU_LUT714L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT714L_EN           (0x1U<<0)
#define GFXMMU_LUT714L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT714L_EN_B_0X1     (0x1U<<0)

// LUT714H Configuration

#define GFXMMU_LUT714H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT714H_LO_0         (0x1U<<4)

// LUT715L Configuration

#define GFXMMU_LUT715L_LVB          (0xFFU<<16)
#define GFXMMU_LUT715L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT715L_FVB          (0xFFU<<8)
#define GFXMMU_LUT715L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT715L_EN           (0x1U<<0)
#define GFXMMU_LUT715L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT715L_EN_B_0X1     (0x1U<<0)

// LUT715H Configuration

#define GFXMMU_LUT715H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT715H_LO_0         (0x1U<<4)

// LUT716L Configuration

#define GFXMMU_LUT716L_LVB          (0xFFU<<16)
#define GFXMMU_LUT716L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT716L_FVB          (0xFFU<<8)
#define GFXMMU_LUT716L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT716L_EN           (0x1U<<0)
#define GFXMMU_LUT716L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT716L_EN_B_0X1     (0x1U<<0)

// LUT716H Configuration

#define GFXMMU_LUT716H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT716H_LO_0         (0x1U<<4)

// LUT717L Configuration

#define GFXMMU_LUT717L_LVB          (0xFFU<<16)
#define GFXMMU_LUT717L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT717L_FVB          (0xFFU<<8)
#define GFXMMU_LUT717L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT717L_EN           (0x1U<<0)
#define GFXMMU_LUT717L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT717L_EN_B_0X1     (0x1U<<0)

// LUT717H Configuration

#define GFXMMU_LUT717H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT717H_LO_0         (0x1U<<4)

// LUT718L Configuration

#define GFXMMU_LUT718L_LVB          (0xFFU<<16)
#define GFXMMU_LUT718L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT718L_FVB          (0xFFU<<8)
#define GFXMMU_LUT718L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT718L_EN           (0x1U<<0)
#define GFXMMU_LUT718L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT718L_EN_B_0X1     (0x1U<<0)

// LUT718H Configuration

#define GFXMMU_LUT718H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT718H_LO_0         (0x1U<<4)

// LUT719L Configuration

#define GFXMMU_LUT719L_LVB          (0xFFU<<16)
#define GFXMMU_LUT719L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT719L_FVB          (0xFFU<<8)
#define GFXMMU_LUT719L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT719L_EN           (0x1U<<0)
#define GFXMMU_LUT719L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT719L_EN_B_0X1     (0x1U<<0)

// LUT719H Configuration

#define GFXMMU_LUT719H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT719H_LO_0         (0x1U<<4)

// LUT720L Configuration

#define GFXMMU_LUT720L_LVB          (0xFFU<<16)
#define GFXMMU_LUT720L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT720L_FVB          (0xFFU<<8)
#define GFXMMU_LUT720L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT720L_EN           (0x1U<<0)
#define GFXMMU_LUT720L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT720L_EN_B_0X1     (0x1U<<0)

// LUT720H Configuration

#define GFXMMU_LUT720H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT720H_LO_0         (0x1U<<4)

// LUT721L Configuration

#define GFXMMU_LUT721L_LVB          (0xFFU<<16)
#define GFXMMU_LUT721L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT721L_FVB          (0xFFU<<8)
#define GFXMMU_LUT721L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT721L_EN           (0x1U<<0)
#define GFXMMU_LUT721L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT721L_EN_B_0X1     (0x1U<<0)

// LUT721H Configuration

#define GFXMMU_LUT721H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT721H_LO_0         (0x1U<<4)

// LUT722L Configuration

#define GFXMMU_LUT722L_LVB          (0xFFU<<16)
#define GFXMMU_LUT722L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT722L_FVB          (0xFFU<<8)
#define GFXMMU_LUT722L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT722L_EN           (0x1U<<0)
#define GFXMMU_LUT722L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT722L_EN_B_0X1     (0x1U<<0)

// LUT722H Configuration

