Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT722H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT722H_LO_0         (0x1U<<4)

// LUT723L Configuration

#define GFXMMU_LUT723L_LVB          (0xFFU<<16)
#define GFXMMU_LUT723L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT723L_FVB          (0xFFU<<8)
#define GFXMMU_LUT723L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT723L_EN           (0x1U<<0)
#define GFXMMU_LUT723L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT723L_EN_B_0X1     (0x1U<<0)

// LUT723H Configuration

#define GFXMMU_LUT723H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT723H_LO_0         (0x1U<<4)

// LUT724L Configuration

#define GFXMMU_LUT724L_LVB          (0xFFU<<16)
#define GFXMMU_LUT724L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT724L_FVB          (0xFFU<<8)
#define GFXMMU_LUT724L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT724L_EN           (0x1U<<0)
#define GFXMMU_LUT724L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT724L_EN_B_0X1     (0x1U<<0)

// LUT724H Configuration

#define GFXMMU_LUT724H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT724H_LO_0         (0x1U<<4)

// LUT725L Configuration

#define GFXMMU_LUT725L_LVB          (0xFFU<<16)
#define GFXMMU_LUT725L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT725L_FVB          (0xFFU<<8)
#define GFXMMU_LUT725L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT725L_EN           (0x1U<<0)
#define GFXMMU_LUT725L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT725L_EN_B_0X1     (0x1U<<0)

// LUT725H Configuration

#define GFXMMU_LUT725H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT725H_LO_0         (0x1U<<4)

// LUT726L Configuration

#define GFXMMU_LUT726L_LVB          (0xFFU<<16)
#define GFXMMU_LUT726L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT726L_FVB          (0xFFU<<8)
#define GFXMMU_LUT726L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT726L_EN           (0x1U<<0)
#define GFXMMU_LUT726L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT726L_EN_B_0X1     (0x1U<<0)

// LUT726H Configuration

#define GFXMMU_LUT726H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT726H_LO_0         (0x1U<<4)

// LUT727L Configuration

#define GFXMMU_LUT727L_LVB          (0xFFU<<16)
#define GFXMMU_LUT727L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT727L_FVB          (0xFFU<<8)
#define GFXMMU_LUT727L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT727L_EN           (0x1U<<0)
#define GFXMMU_LUT727L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT727L_EN_B_0X1     (0x1U<<0)

// LUT727H Configuration

#define GFXMMU_LUT727H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT727H_LO_0         (0x1U<<4)

// LUT728L Configuration

#define GFXMMU_LUT728L_LVB          (0xFFU<<16)
#define GFXMMU_LUT728L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT728L_FVB          (0xFFU<<8)
#define GFXMMU_LUT728L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT728L_EN           (0x1U<<0)
#define GFXMMU_LUT728L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT728L_EN_B_0X1     (0x1U<<0)

// LUT728H Configuration

#define GFXMMU_LUT728H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT728H_LO_0         (0x1U<<4)

// LUT729L Configuration

#define GFXMMU_LUT729L_LVB          (0xFFU<<16)
#define GFXMMU_LUT729L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT729L_FVB          (0xFFU<<8)
#define GFXMMU_LUT729L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT729L_EN           (0x1U<<0)
#define GFXMMU_LUT729L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT729L_EN_B_0X1     (0x1U<<0)

// LUT729H Configuration

#define GFXMMU_LUT729H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT729H_LO_0         (0x1U<<4)

// LUT730L Configuration

#define GFXMMU_LUT730L_LVB          (0xFFU<<16)
#define GFXMMU_LUT730L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT730L_FVB          (0xFFU<<8)
#define GFXMMU_LUT730L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT730L_EN           (0x1U<<0)
#define GFXMMU_LUT730L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT730L_EN_B_0X1     (0x1U<<0)

// LUT730H Configuration

#define GFXMMU_LUT730H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT730H_LO_0         (0x1U<<4)

// LUT731L Configuration

#define GFXMMU_LUT731L_LVB          (0xFFU<<16)
#define GFXMMU_LUT731L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT731L_FVB          (0xFFU<<8)
#define GFXMMU_LUT731L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT731L_EN           (0x1U<<0)
#define GFXMMU_LUT731L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT731L_EN_B_0X1     (0x1U<<0)

// LUT731H Configuration

#define GFXMMU_LUT731H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT731H_LO_0         (0x1U<<4)

// LUT732L Configuration

#define GFXMMU_LUT732L_LVB          (0xFFU<<16)
#define GFXMMU_LUT732L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT732L_FVB          (0xFFU<<8)
#define GFXMMU_LUT732L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT732L_EN           (0x1U<<0)
#define GFXMMU_LUT732L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT732L_EN_B_0X1     (0x1U<<0)

// LUT732H Configuration

#define GFXMMU_LUT732H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT732H_LO_0         (0x1U<<4)

// LUT733L Configuration

#define GFXMMU_LUT733L_LVB          (0xFFU<<16)
#define GFXMMU_LUT733L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT733L_FVB          (0xFFU<<8)
#define GFXMMU_LUT733L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT733L_EN           (0x1U<<0)
#define GFXMMU_LUT733L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT733L_EN_B_0X1     (0x1U<<0)

// LUT733H Configuration

#define GFXMMU_LUT733H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT733H_LO_0         (0x1U<<4)

// LUT734L Configuration

#define GFXMMU_LUT734L_LVB          (0xFFU<<16)
#define GFXMMU_LUT734L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT734L_FVB          (0xFFU<<8)
#define GFXMMU_LUT734L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT734L_EN           (0x1U<<0)
#define GFXMMU_LUT734L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT734L_EN_B_0X1     (0x1U<<0)

// LUT734H Configuration

#define GFXMMU_LUT734H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT734H_LO_0         (0x1U<<4)

// LUT735L Configuration

#define GFXMMU_LUT735L_LVB          (0xFFU<<16)
#define GFXMMU_LUT735L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT735L_FVB          (0xFFU<<8)
#define GFXMMU_LUT735L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT735L_EN           (0x1U<<0)
#define GFXMMU_LUT735L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT735L_EN_B_0X1     (0x1U<<0)

