Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT749L Configuration

#define GFXMMU_LUT749L_LVB          (0xFFU<<16)
#define GFXMMU_LUT749L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT749L_FVB          (0xFFU<<8)
#define GFXMMU_LUT749L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT749L_EN           (0x1U<<0)
#define GFXMMU_LUT749L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT749L_EN_B_0X1     (0x1U<<0)

// LUT749H Configuration

#define GFXMMU_LUT749H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT749H_LO_0         (0x1U<<4)

// LUT750L Configuration

#define GFXMMU_LUT750L_LVB          (0xFFU<<16)
#define GFXMMU_LUT750L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT750L_FVB          (0xFFU<<8)
#define GFXMMU_LUT750L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT750L_EN           (0x1U<<0)
#define GFXMMU_LUT750L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT750L_EN_B_0X1     (0x1U<<0)

// LUT750H Configuration

#define GFXMMU_LUT750H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT750H_LO_0         (0x1U<<4)

// LUT751L Configuration

#define GFXMMU_LUT751L_LVB          (0xFFU<<16)
#define GFXMMU_LUT751L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT751L_FVB          (0xFFU<<8)
#define GFXMMU_LUT751L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT751L_EN           (0x1U<<0)
#define GFXMMU_LUT751L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT751L_EN_B_0X1     (0x1U<<0)

// LUT751H Configuration

#define GFXMMU_LUT751H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT751H_LO_0         (0x1U<<4)

// LUT752L Configuration

#define GFXMMU_LUT752L_LVB          (0xFFU<<16)
#define GFXMMU_LUT752L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT752L_FVB          (0xFFU<<8)
#define GFXMMU_LUT752L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT752L_EN           (0x1U<<0)
#define GFXMMU_LUT752L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT752L_EN_B_0X1     (0x1U<<0)

// LUT752H Configuration

#define GFXMMU_LUT752H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT752H_LO_0         (0x1U<<4)

// LUT753L Configuration

#define GFXMMU_LUT753L_LVB          (0xFFU<<16)
#define GFXMMU_LUT753L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT753L_FVB          (0xFFU<<8)
#define GFXMMU_LUT753L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT753L_EN           (0x1U<<0)
#define GFXMMU_LUT753L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT753L_EN_B_0X1     (0x1U<<0)

// LUT753H Configuration

#define GFXMMU_LUT753H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT753H_LO_0         (0x1U<<4)

// LUT754L Configuration

#define GFXMMU_LUT754L_LVB          (0xFFU<<16)
#define GFXMMU_LUT754L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT754L_FVB          (0xFFU<<8)
#define GFXMMU_LUT754L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT754L_EN           (0x1U<<0)
#define GFXMMU_LUT754L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT754L_EN_B_0X1     (0x1U<<0)

// LUT754H Configuration

#define GFXMMU_LUT754H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT754H_LO_0         (0x1U<<4)

// LUT755L Configuration

#define GFXMMU_LUT755L_LVB          (0xFFU<<16)
#define GFXMMU_LUT755L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT755L_FVB          (0xFFU<<8)
#define GFXMMU_LUT755L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT755L_EN           (0x1U<<0)
#define GFXMMU_LUT755L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT755L_EN_B_0X1     (0x1U<<0)

// LUT755H Configuration

#define GFXMMU_LUT755H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT755H_LO_0         (0x1U<<4)

// LUT756L Configuration

#define GFXMMU_LUT756L_LVB          (0xFFU<<16)
#define GFXMMU_LUT756L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT756L_FVB          (0xFFU<<8)
#define GFXMMU_LUT756L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT756L_EN           (0x1U<<0)
#define GFXMMU_LUT756L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT756L_EN_B_0X1     (0x1U<<0)

// LUT756H Configuration

#define GFXMMU_LUT756H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT756H_LO_0         (0x1U<<4)

// LUT757L Configuration

#define GFXMMU_LUT757L_LVB          (0xFFU<<16)
#define GFXMMU_LUT757L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT757L_FVB          (0xFFU<<8)
#define GFXMMU_LUT757L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT757L_EN           (0x1U<<0)
#define GFXMMU_LUT757L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT757L_EN_B_0X1     (0x1U<<0)

// LUT757H Configuration

#define GFXMMU_LUT757H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT757H_LO_0         (0x1U<<4)

// LUT758L Configuration

#define GFXMMU_LUT758L_LVB          (0xFFU<<16)
#define GFXMMU_LUT758L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT758L_FVB          (0xFFU<<8)
#define GFXMMU_LUT758L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT758L_EN           (0x1U<<0)
#define GFXMMU_LUT758L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT758L_EN_B_0X1     (0x1U<<0)

// LUT758H Configuration

#define GFXMMU_LUT758H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT758H_LO_0         (0x1U<<4)

// LUT759L Configuration

#define GFXMMU_LUT759L_LVB          (0xFFU<<16)
#define GFXMMU_LUT759L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT759L_FVB          (0xFFU<<8)
#define GFXMMU_LUT759L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT759L_EN           (0x1U<<0)
#define GFXMMU_LUT759L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT759L_EN_B_0X1     (0x1U<<0)

// LUT759H Configuration

#define GFXMMU_LUT759H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT759H_LO_0         (0x1U<<4)

// LUT760L Configuration

#define GFXMMU_LUT760L_LVB          (0xFFU<<16)
#define GFXMMU_LUT760L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT760L_FVB          (0xFFU<<8)
#define GFXMMU_LUT760L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT760L_EN           (0x1U<<0)
#define GFXMMU_LUT760L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT760L_EN_B_0X1     (0x1U<<0)

// LUT760H Configuration

#define GFXMMU_LUT760H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT760H_LO_0         (0x1U<<4)

// LUT761L Configuration

#define GFXMMU_LUT761L_LVB          (0xFFU<<16)
#define GFXMMU_LUT761L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT761L_FVB          (0xFFU<<8)
#define GFXMMU_LUT761L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT761L_EN           (0x1U<<0)
#define GFXMMU_LUT761L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT761L_EN_B_0X1     (0x1U<<0)

// LUT761H Configuration

