Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT787H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT787H_LO_0         (0x1U<<4)

// LUT788L Configuration

#define GFXMMU_LUT788L_LVB          (0xFFU<<16)
#define GFXMMU_LUT788L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT788L_FVB          (0xFFU<<8)
#define GFXMMU_LUT788L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT788L_EN           (0x1U<<0)
#define GFXMMU_LUT788L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT788L_EN_B_0X1     (0x1U<<0)

// LUT788H Configuration

#define GFXMMU_LUT788H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT788H_LO_0         (0x1U<<4)

// LUT789L Configuration

#define GFXMMU_LUT789L_LVB          (0xFFU<<16)
#define GFXMMU_LUT789L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT789L_FVB          (0xFFU<<8)
#define GFXMMU_LUT789L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT789L_EN           (0x1U<<0)
#define GFXMMU_LUT789L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT789L_EN_B_0X1     (0x1U<<0)

// LUT789H Configuration

#define GFXMMU_LUT789H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT789H_LO_0         (0x1U<<4)

// LUT790L Configuration

#define GFXMMU_LUT790L_LVB          (0xFFU<<16)
#define GFXMMU_LUT790L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT790L_FVB          (0xFFU<<8)
#define GFXMMU_LUT790L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT790L_EN           (0x1U<<0)
#define GFXMMU_LUT790L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT790L_EN_B_0X1     (0x1U<<0)

// LUT790H Configuration

#define GFXMMU_LUT790H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT790H_LO_0         (0x1U<<4)

// LUT791L Configuration

#define GFXMMU_LUT791L_LVB          (0xFFU<<16)
#define GFXMMU_LUT791L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT791L_FVB          (0xFFU<<8)
#define GFXMMU_LUT791L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT791L_EN           (0x1U<<0)
#define GFXMMU_LUT791L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT791L_EN_B_0X1     (0x1U<<0)

// LUT791H Configuration

#define GFXMMU_LUT791H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT791H_LO_0         (0x1U<<4)

// LUT792L Configuration

#define GFXMMU_LUT792L_LVB          (0xFFU<<16)
#define GFXMMU_LUT792L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT792L_FVB          (0xFFU<<8)
#define GFXMMU_LUT792L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT792L_EN           (0x1U<<0)
#define GFXMMU_LUT792L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT792L_EN_B_0X1     (0x1U<<0)

// LUT792H Configuration

#define GFXMMU_LUT792H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT792H_LO_0         (0x1U<<4)

// LUT793L Configuration

#define GFXMMU_LUT793L_LVB          (0xFFU<<16)
#define GFXMMU_LUT793L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT793L_FVB          (0xFFU<<8)
#define GFXMMU_LUT793L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT793L_EN           (0x1U<<0)
#define GFXMMU_LUT793L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT793L_EN_B_0X1     (0x1U<<0)

// LUT793H Configuration

#define GFXMMU_LUT793H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT793H_LO_0         (0x1U<<4)

// LUT794L Configuration

#define GFXMMU_LUT794L_LVB          (0xFFU<<16)
#define GFXMMU_LUT794L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT794L_FVB          (0xFFU<<8)
#define GFXMMU_LUT794L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT794L_EN           (0x1U<<0)
#define GFXMMU_LUT794L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT794L_EN_B_0X1     (0x1U<<0)

// LUT794H Configuration

#define GFXMMU_LUT794H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT794H_LO_0         (0x1U<<4)

// LUT795L Configuration

#define GFXMMU_LUT795L_LVB          (0xFFU<<16)
#define GFXMMU_LUT795L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT795L_FVB          (0xFFU<<8)
#define GFXMMU_LUT795L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT795L_EN           (0x1U<<0)
#define GFXMMU_LUT795L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT795L_EN_B_0X1     (0x1U<<0)

// LUT795H Configuration

#define GFXMMU_LUT795H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT795H_LO_0         (0x1U<<4)

// LUT796L Configuration

#define GFXMMU_LUT796L_LVB          (0xFFU<<16)
#define GFXMMU_LUT796L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT796L_FVB          (0xFFU<<8)
#define GFXMMU_LUT796L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT796L_EN           (0x1U<<0)
#define GFXMMU_LUT796L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT796L_EN_B_0X1     (0x1U<<0)

// LUT796H Configuration

#define GFXMMU_LUT796H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT796H_LO_0         (0x1U<<4)

// LUT797L Configuration

#define GFXMMU_LUT797L_LVB          (0xFFU<<16)
#define GFXMMU_LUT797L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT797L_FVB          (0xFFU<<8)
#define GFXMMU_LUT797L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT797L_EN           (0x1U<<0)
#define GFXMMU_LUT797L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT797L_EN_B_0X1     (0x1U<<0)

// LUT797H Configuration

#define GFXMMU_LUT797H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT797H_LO_0         (0x1U<<4)

// LUT798L Configuration

#define GFXMMU_LUT798L_LVB          (0xFFU<<16)
#define GFXMMU_LUT798L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT798L_FVB          (0xFFU<<8)
#define GFXMMU_LUT798L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT798L_EN           (0x1U<<0)
#define GFXMMU_LUT798L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT798L_EN_B_0X1     (0x1U<<0)

// LUT798H Configuration

#define GFXMMU_LUT798H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT798H_LO_0         (0x1U<<4)

// LUT799L Configuration

#define GFXMMU_LUT799L_LVB          (0xFFU<<16)
#define GFXMMU_LUT799L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT799L_FVB          (0xFFU<<8)
#define GFXMMU_LUT799L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT799L_EN           (0x1U<<0)
#define GFXMMU_LUT799L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT799L_EN_B_0X1     (0x1U<<0)

// LUT799H Configuration

#define GFXMMU_LUT799H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT799H_LO_0         (0x1U<<4)

// LUT800L Configuration

#define GFXMMU_LUT800L_LVB          (0xFFU<<16)
#define GFXMMU_LUT800L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT800L_FVB          (0xFFU<<8)
#define GFXMMU_LUT800L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT800L_EN           (0x1U<<0)
#define GFXMMU_LUT800L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT800L_EN_B_0X1     (0x1U<<0)

// LUT800H Configuration

#define GFXMMU_LUT800H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT800H_LO_0         (0x1U<<4)

