Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT801L Configuration

#define GFXMMU_LUT801L_LVB          (0xFFU<<16)
#define GFXMMU_LUT801L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT801L_FVB          (0xFFU<<8)
#define GFXMMU_LUT801L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT801L_EN           (0x1U<<0)
#define GFXMMU_LUT801L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT801L_EN_B_0X1     (0x1U<<0)

// LUT801H Configuration

#define GFXMMU_LUT801H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT801H_LO_0         (0x1U<<4)

// LUT802L Configuration

#define GFXMMU_LUT802L_LVB          (0xFFU<<16)
#define GFXMMU_LUT802L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT802L_FVB          (0xFFU<<8)
#define GFXMMU_LUT802L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT802L_EN           (0x1U<<0)
#define GFXMMU_LUT802L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT802L_EN_B_0X1     (0x1U<<0)

// LUT802H Configuration

#define GFXMMU_LUT802H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT802H_LO_0         (0x1U<<4)

// LUT803L Configuration

#define GFXMMU_LUT803L_LVB          (0xFFU<<16)
#define GFXMMU_LUT803L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT803L_FVB          (0xFFU<<8)
#define GFXMMU_LUT803L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT803L_EN           (0x1U<<0)
#define GFXMMU_LUT803L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT803L_EN_B_0X1     (0x1U<<0)

// LUT803H Configuration

#define GFXMMU_LUT803H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT803H_LO_0         (0x1U<<4)

// LUT804L Configuration

#define GFXMMU_LUT804L_LVB          (0xFFU<<16)
#define GFXMMU_LUT804L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT804L_FVB          (0xFFU<<8)
#define GFXMMU_LUT804L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT804L_EN           (0x1U<<0)
#define GFXMMU_LUT804L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT804L_EN_B_0X1     (0x1U<<0)

// LUT804H Configuration

#define GFXMMU_LUT804H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT804H_LO_0         (0x1U<<4)

// LUT805L Configuration

#define GFXMMU_LUT805L_LVB          (0xFFU<<16)
#define GFXMMU_LUT805L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT805L_FVB          (0xFFU<<8)
#define GFXMMU_LUT805L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT805L_EN           (0x1U<<0)
#define GFXMMU_LUT805L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT805L_EN_B_0X1     (0x1U<<0)

// LUT805H Configuration

#define GFXMMU_LUT805H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT805H_LO_0         (0x1U<<4)

// LUT806L Configuration

#define GFXMMU_LUT806L_LVB          (0xFFU<<16)
#define GFXMMU_LUT806L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT806L_FVB          (0xFFU<<8)
#define GFXMMU_LUT806L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT806L_EN           (0x1U<<0)
#define GFXMMU_LUT806L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT806L_EN_B_0X1     (0x1U<<0)

// LUT806H Configuration

#define GFXMMU_LUT806H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT806H_LO_0         (0x1U<<4)

// LUT807L Configuration

#define GFXMMU_LUT807L_LVB          (0xFFU<<16)
#define GFXMMU_LUT807L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT807L_FVB          (0xFFU<<8)
#define GFXMMU_LUT807L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT807L_EN           (0x1U<<0)
#define GFXMMU_LUT807L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT807L_EN_B_0X1     (0x1U<<0)

// LUT807H Configuration

#define GFXMMU_LUT807H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT807H_LO_0         (0x1U<<4)

// LUT808L Configuration

#define GFXMMU_LUT808L_LVB          (0xFFU<<16)
#define GFXMMU_LUT808L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT808L_FVB          (0xFFU<<8)
#define GFXMMU_LUT808L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT808L_EN           (0x1U<<0)
#define GFXMMU_LUT808L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT808L_EN_B_0X1     (0x1U<<0)

// LUT808H Configuration

#define GFXMMU_LUT808H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT808H_LO_0         (0x1U<<4)

// LUT809L Configuration

#define GFXMMU_LUT809L_LVB          (0xFFU<<16)
#define GFXMMU_LUT809L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT809L_FVB          (0xFFU<<8)
#define GFXMMU_LUT809L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT809L_EN           (0x1U<<0)
#define GFXMMU_LUT809L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT809L_EN_B_0X1     (0x1U<<0)

// LUT809H Configuration

#define GFXMMU_LUT809H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT809H_LO_0         (0x1U<<4)

// LUT810L Configuration

#define GFXMMU_LUT810L_LVB          (0xFFU<<16)
#define GFXMMU_LUT810L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT810L_FVB          (0xFFU<<8)
#define GFXMMU_LUT810L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT810L_EN           (0x1U<<0)
#define GFXMMU_LUT810L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT810L_EN_B_0X1     (0x1U<<0)

// LUT810H Configuration

#define GFXMMU_LUT810H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT810H_LO_0         (0x1U<<4)

// LUT811L Configuration

#define GFXMMU_LUT811L_LVB          (0xFFU<<16)
#define GFXMMU_LUT811L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT811L_FVB          (0xFFU<<8)
#define GFXMMU_LUT811L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT811L_EN           (0x1U<<0)
#define GFXMMU_LUT811L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT811L_EN_B_0X1     (0x1U<<0)

// LUT811H Configuration

#define GFXMMU_LUT811H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT811H_LO_0         (0x1U<<4)

// LUT812L Configuration

#define GFXMMU_LUT812L_LVB          (0xFFU<<16)
#define GFXMMU_LUT812L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT812L_FVB          (0xFFU<<8)
#define GFXMMU_LUT812L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT812L_EN           (0x1U<<0)
#define GFXMMU_LUT812L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT812L_EN_B_0X1     (0x1U<<0)

// LUT812H Configuration

#define GFXMMU_LUT812H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT812H_LO_0         (0x1U<<4)

// LUT813L Configuration

#define GFXMMU_LUT813L_LVB          (0xFFU<<16)
#define GFXMMU_LUT813L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT813L_FVB          (0xFFU<<8)
#define GFXMMU_LUT813L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT813L_EN           (0x1U<<0)
#define GFXMMU_LUT813L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT813L_EN_B_0X1     (0x1U<<0)

// LUT813H Configuration

#define GFXMMU_LUT813H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT813H_LO_0         (0x1U<<4)

// LUT814L Configuration

#define GFXMMU_LUT814L_LVB          (0xFFU<<16)
#define GFXMMU_LUT814L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT814L_FVB          (0xFFU<<8)
#define GFXMMU_LUT814L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT814L_EN           (0x1U<<0)
#define GFXMMU_LUT814L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT814L_EN_B_0X1     (0x1U<<0)

// LUT814H Configuration

#define GFXMMU_LUT814H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT814H_LO_0         (0x1U<<4)

