Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT827H Configuration

#define GFXMMU_LUT827H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT827H_LO_0         (0x1U<<4)

// LUT828L Configuration

#define GFXMMU_LUT828L_LVB          (0xFFU<<16)
#define GFXMMU_LUT828L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT828L_FVB          (0xFFU<<8)
#define GFXMMU_LUT828L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT828L_EN           (0x1U<<0)
#define GFXMMU_LUT828L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT828L_EN_B_0X1     (0x1U<<0)

// LUT828H Configuration

#define GFXMMU_LUT828H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT828H_LO_0         (0x1U<<4)

// LUT829L Configuration

#define GFXMMU_LUT829L_LVB          (0xFFU<<16)
#define GFXMMU_LUT829L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT829L_FVB          (0xFFU<<8)
#define GFXMMU_LUT829L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT829L_EN           (0x1U<<0)
#define GFXMMU_LUT829L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT829L_EN_B_0X1     (0x1U<<0)

// LUT829H Configuration

#define GFXMMU_LUT829H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT829H_LO_0         (0x1U<<4)

// LUT830L Configuration

#define GFXMMU_LUT830L_LVB          (0xFFU<<16)
#define GFXMMU_LUT830L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT830L_FVB          (0xFFU<<8)
#define GFXMMU_LUT830L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT830L_EN           (0x1U<<0)
#define GFXMMU_LUT830L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT830L_EN_B_0X1     (0x1U<<0)

// LUT830H Configuration

#define GFXMMU_LUT830H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT830H_LO_0         (0x1U<<4)

// LUT831L Configuration

#define GFXMMU_LUT831L_LVB          (0xFFU<<16)
#define GFXMMU_LUT831L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT831L_FVB          (0xFFU<<8)
#define GFXMMU_LUT831L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT831L_EN           (0x1U<<0)
#define GFXMMU_LUT831L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT831L_EN_B_0X1     (0x1U<<0)

// LUT831H Configuration

#define GFXMMU_LUT831H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT831H_LO_0         (0x1U<<4)

// LUT832L Configuration

#define GFXMMU_LUT832L_LVB          (0xFFU<<16)
#define GFXMMU_LUT832L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT832L_FVB          (0xFFU<<8)
#define GFXMMU_LUT832L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT832L_EN           (0x1U<<0)
#define GFXMMU_LUT832L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT832L_EN_B_0X1     (0x1U<<0)

// LUT832H Configuration

#define GFXMMU_LUT832H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT832H_LO_0         (0x1U<<4)

// LUT833L Configuration

#define GFXMMU_LUT833L_LVB          (0xFFU<<16)
#define GFXMMU_LUT833L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT833L_FVB          (0xFFU<<8)
#define GFXMMU_LUT833L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT833L_EN           (0x1U<<0)
#define GFXMMU_LUT833L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT833L_EN_B_0X1     (0x1U<<0)

// LUT833H Configuration

#define GFXMMU_LUT833H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT833H_LO_0         (0x1U<<4)

// LUT834L Configuration

#define GFXMMU_LUT834L_LVB          (0xFFU<<16)
#define GFXMMU_LUT834L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT834L_FVB          (0xFFU<<8)
#define GFXMMU_LUT834L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT834L_EN           (0x1U<<0)
#define GFXMMU_LUT834L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT834L_EN_B_0X1     (0x1U<<0)

// LUT834H Configuration

#define GFXMMU_LUT834H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT834H_LO_0         (0x1U<<4)

// LUT835L Configuration

#define GFXMMU_LUT835L_LVB          (0xFFU<<16)
#define GFXMMU_LUT835L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT835L_FVB          (0xFFU<<8)
#define GFXMMU_LUT835L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT835L_EN           (0x1U<<0)
#define GFXMMU_LUT835L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT835L_EN_B_0X1     (0x1U<<0)

// LUT835H Configuration

#define GFXMMU_LUT835H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT835H_LO_0         (0x1U<<4)

// LUT836L Configuration

#define GFXMMU_LUT836L_LVB          (0xFFU<<16)
#define GFXMMU_LUT836L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT836L_FVB          (0xFFU<<8)
#define GFXMMU_LUT836L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT836L_EN           (0x1U<<0)
#define GFXMMU_LUT836L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT836L_EN_B_0X1     (0x1U<<0)

// LUT836H Configuration

#define GFXMMU_LUT836H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT836H_LO_0         (0x1U<<4)

// LUT837L Configuration

#define GFXMMU_LUT837L_LVB          (0xFFU<<16)
#define GFXMMU_LUT837L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT837L_FVB          (0xFFU<<8)
#define GFXMMU_LUT837L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT837L_EN           (0x1U<<0)
#define GFXMMU_LUT837L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT837L_EN_B_0X1     (0x1U<<0)

// LUT837H Configuration

#define GFXMMU_LUT837H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT837H_LO_0         (0x1U<<4)

// LUT838L Configuration

#define GFXMMU_LUT838L_LVB          (0xFFU<<16)
#define GFXMMU_LUT838L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT838L_FVB          (0xFFU<<8)
#define GFXMMU_LUT838L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT838L_EN           (0x1U<<0)
#define GFXMMU_LUT838L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT838L_EN_B_0X1     (0x1U<<0)

// LUT838H Configuration

#define GFXMMU_LUT838H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT838H_LO_0         (0x1U<<4)

// LUT839L Configuration

#define GFXMMU_LUT839L_LVB          (0xFFU<<16)
#define GFXMMU_LUT839L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT839L_FVB          (0xFFU<<8)
#define GFXMMU_LUT839L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT839L_EN           (0x1U<<0)
#define GFXMMU_LUT839L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT839L_EN_B_0X1     (0x1U<<0)

// LUT839H Configuration

#define GFXMMU_LUT839H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT839H_LO_0         (0x1U<<4)

// LUT840L Configuration

#define GFXMMU_LUT840L_LVB          (0xFFU<<16)
#define GFXMMU_LUT840L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT840L_FVB          (0xFFU<<8)
#define GFXMMU_LUT840L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT840L_EN           (0x1U<<0)
#define GFXMMU_LUT840L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT840L_EN_B_0X1     (0x1U<<0)

// LUT840H Configuration

#define GFXMMU_LUT840H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT840H_LO_0         (0x1U<<4)

// LUT841L Configuration

