Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT841L_LVB          (0xFFU<<16)
#define GFXMMU_LUT841L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT841L_FVB          (0xFFU<<8)
#define GFXMMU_LUT841L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT841L_EN           (0x1U<<0)
#define GFXMMU_LUT841L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT841L_EN_B_0X1     (0x1U<<0)

// LUT841H Configuration

#define GFXMMU_LUT841H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT841H_LO_0         (0x1U<<4)

// LUT842L Configuration

#define GFXMMU_LUT842L_LVB          (0xFFU<<16)
#define GFXMMU_LUT842L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT842L_FVB          (0xFFU<<8)
#define GFXMMU_LUT842L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT842L_EN           (0x1U<<0)
#define GFXMMU_LUT842L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT842L_EN_B_0X1     (0x1U<<0)

// LUT842H Configuration

#define GFXMMU_LUT842H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT842H_LO_0         (0x1U<<4)

// LUT843L Configuration

#define GFXMMU_LUT843L_LVB          (0xFFU<<16)
#define GFXMMU_LUT843L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT843L_FVB          (0xFFU<<8)
#define GFXMMU_LUT843L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT843L_EN           (0x1U<<0)
#define GFXMMU_LUT843L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT843L_EN_B_0X1     (0x1U<<0)

// LUT843H Configuration

#define GFXMMU_LUT843H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT843H_LO_0         (0x1U<<4)

// LUT844L Configuration

#define GFXMMU_LUT844L_LVB          (0xFFU<<16)
#define GFXMMU_LUT844L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT844L_FVB          (0xFFU<<8)
#define GFXMMU_LUT844L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT844L_EN           (0x1U<<0)
#define GFXMMU_LUT844L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT844L_EN_B_0X1     (0x1U<<0)

// LUT844H Configuration

#define GFXMMU_LUT844H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT844H_LO_0         (0x1U<<4)

// LUT845L Configuration

#define GFXMMU_LUT845L_LVB          (0xFFU<<16)
#define GFXMMU_LUT845L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT845L_FVB          (0xFFU<<8)
#define GFXMMU_LUT845L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT845L_EN           (0x1U<<0)
#define GFXMMU_LUT845L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT845L_EN_B_0X1     (0x1U<<0)

// LUT845H Configuration

#define GFXMMU_LUT845H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT845H_LO_0         (0x1U<<4)

// LUT846L Configuration

#define GFXMMU_LUT846L_LVB          (0xFFU<<16)
#define GFXMMU_LUT846L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT846L_FVB          (0xFFU<<8)
#define GFXMMU_LUT846L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT846L_EN           (0x1U<<0)
#define GFXMMU_LUT846L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT846L_EN_B_0X1     (0x1U<<0)

// LUT846H Configuration

#define GFXMMU_LUT846H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT846H_LO_0         (0x1U<<4)

// LUT847L Configuration

#define GFXMMU_LUT847L_LVB          (0xFFU<<16)
#define GFXMMU_LUT847L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT847L_FVB          (0xFFU<<8)
#define GFXMMU_LUT847L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT847L_EN           (0x1U<<0)
#define GFXMMU_LUT847L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT847L_EN_B_0X1     (0x1U<<0)

// LUT847H Configuration

#define GFXMMU_LUT847H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT847H_LO_0         (0x1U<<4)

// LUT848L Configuration

#define GFXMMU_LUT848L_LVB          (0xFFU<<16)
#define GFXMMU_LUT848L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT848L_FVB          (0xFFU<<8)
#define GFXMMU_LUT848L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT848L_EN           (0x1U<<0)
#define GFXMMU_LUT848L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT848L_EN_B_0X1     (0x1U<<0)

// LUT848H Configuration

#define GFXMMU_LUT848H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT848H_LO_0         (0x1U<<4)

// LUT849L Configuration

#define GFXMMU_LUT849L_LVB          (0xFFU<<16)
#define GFXMMU_LUT849L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT849L_FVB          (0xFFU<<8)
#define GFXMMU_LUT849L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT849L_EN           (0x1U<<0)
#define GFXMMU_LUT849L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT849L_EN_B_0X1     (0x1U<<0)

// LUT849H Configuration

#define GFXMMU_LUT849H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT849H_LO_0         (0x1U<<4)

// LUT850L Configuration

#define GFXMMU_LUT850L_LVB          (0xFFU<<16)
#define GFXMMU_LUT850L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT850L_FVB          (0xFFU<<8)
#define GFXMMU_LUT850L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT850L_EN           (0x1U<<0)
#define GFXMMU_LUT850L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT850L_EN_B_0X1     (0x1U<<0)

// LUT850H Configuration

#define GFXMMU_LUT850H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT850H_LO_0         (0x1U<<4)

// LUT851L Configuration

#define GFXMMU_LUT851L_LVB          (0xFFU<<16)
#define GFXMMU_LUT851L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT851L_FVB          (0xFFU<<8)
#define GFXMMU_LUT851L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT851L_EN           (0x1U<<0)
#define GFXMMU_LUT851L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT851L_EN_B_0X1     (0x1U<<0)

// LUT851H Configuration

#define GFXMMU_LUT851H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT851H_LO_0         (0x1U<<4)

// LUT852L Configuration

#define GFXMMU_LUT852L_LVB          (0xFFU<<16)
#define GFXMMU_LUT852L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT852L_FVB          (0xFFU<<8)
#define GFXMMU_LUT852L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT852L_EN           (0x1U<<0)
#define GFXMMU_LUT852L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT852L_EN_B_0X1     (0x1U<<0)

// LUT852H Configuration

#define GFXMMU_LUT852H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT852H_LO_0         (0x1U<<4)

// LUT853L Configuration

#define GFXMMU_LUT853L_LVB          (0xFFU<<16)
#define GFXMMU_LUT853L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT853L_FVB          (0xFFU<<8)
#define GFXMMU_LUT853L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT853L_EN           (0x1U<<0)
#define GFXMMU_LUT853L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT853L_EN_B_0X1     (0x1U<<0)

