Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT867L Configuration

#define GFXMMU_LUT867L_LVB          (0xFFU<<16)
#define GFXMMU_LUT867L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT867L_FVB          (0xFFU<<8)
#define GFXMMU_LUT867L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT867L_EN           (0x1U<<0)
#define GFXMMU_LUT867L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT867L_EN_B_0X1     (0x1U<<0)

// LUT867H Configuration

#define GFXMMU_LUT867H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT867H_LO_0         (0x1U<<4)

// LUT868L Configuration

#define GFXMMU_LUT868L_LVB          (0xFFU<<16)
#define GFXMMU_LUT868L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT868L_FVB          (0xFFU<<8)
#define GFXMMU_LUT868L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT868L_EN           (0x1U<<0)
#define GFXMMU_LUT868L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT868L_EN_B_0X1     (0x1U<<0)

// LUT868H Configuration

#define GFXMMU_LUT868H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT868H_LO_0         (0x1U<<4)

// LUT869L Configuration

#define GFXMMU_LUT869L_LVB          (0xFFU<<16)
#define GFXMMU_LUT869L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT869L_FVB          (0xFFU<<8)
#define GFXMMU_LUT869L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT869L_EN           (0x1U<<0)
#define GFXMMU_LUT869L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT869L_EN_B_0X1     (0x1U<<0)

// LUT869H Configuration

#define GFXMMU_LUT869H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT869H_LO_0         (0x1U<<4)

// LUT870L Configuration

#define GFXMMU_LUT870L_LVB          (0xFFU<<16)
#define GFXMMU_LUT870L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT870L_FVB          (0xFFU<<8)
#define GFXMMU_LUT870L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT870L_EN           (0x1U<<0)
#define GFXMMU_LUT870L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT870L_EN_B_0X1     (0x1U<<0)

// LUT870H Configuration

#define GFXMMU_LUT870H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT870H_LO_0         (0x1U<<4)

// LUT871L Configuration

#define GFXMMU_LUT871L_LVB          (0xFFU<<16)
#define GFXMMU_LUT871L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT871L_FVB          (0xFFU<<8)
#define GFXMMU_LUT871L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT871L_EN           (0x1U<<0)
#define GFXMMU_LUT871L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT871L_EN_B_0X1     (0x1U<<0)

// LUT871H Configuration

#define GFXMMU_LUT871H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT871H_LO_0         (0x1U<<4)

// LUT872L Configuration

#define GFXMMU_LUT872L_LVB          (0xFFU<<16)
#define GFXMMU_LUT872L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT872L_FVB          (0xFFU<<8)
#define GFXMMU_LUT872L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT872L_EN           (0x1U<<0)
#define GFXMMU_LUT872L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT872L_EN_B_0X1     (0x1U<<0)

// LUT872H Configuration

#define GFXMMU_LUT872H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT872H_LO_0         (0x1U<<4)

// LUT873L Configuration

#define GFXMMU_LUT873L_LVB          (0xFFU<<16)
#define GFXMMU_LUT873L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT873L_FVB          (0xFFU<<8)
#define GFXMMU_LUT873L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT873L_EN           (0x1U<<0)
#define GFXMMU_LUT873L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT873L_EN_B_0X1     (0x1U<<0)

// LUT873H Configuration

#define GFXMMU_LUT873H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT873H_LO_0         (0x1U<<4)

// LUT874L Configuration

#define GFXMMU_LUT874L_LVB          (0xFFU<<16)
#define GFXMMU_LUT874L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT874L_FVB          (0xFFU<<8)
#define GFXMMU_LUT874L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT874L_EN           (0x1U<<0)
#define GFXMMU_LUT874L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT874L_EN_B_0X1     (0x1U<<0)

// LUT874H Configuration

#define GFXMMU_LUT874H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT874H_LO_0         (0x1U<<4)

// LUT875L Configuration

#define GFXMMU_LUT875L_LVB          (0xFFU<<16)
#define GFXMMU_LUT875L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT875L_FVB          (0xFFU<<8)
#define GFXMMU_LUT875L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT875L_EN           (0x1U<<0)
#define GFXMMU_LUT875L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT875L_EN_B_0X1     (0x1U<<0)

// LUT875H Configuration

#define GFXMMU_LUT875H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT875H_LO_0         (0x1U<<4)

// LUT876L Configuration

#define GFXMMU_LUT876L_LVB          (0xFFU<<16)
#define GFXMMU_LUT876L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT876L_FVB          (0xFFU<<8)
#define GFXMMU_LUT876L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT876L_EN           (0x1U<<0)
#define GFXMMU_LUT876L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT876L_EN_B_0X1     (0x1U<<0)

// LUT876H Configuration

#define GFXMMU_LUT876H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT876H_LO_0         (0x1U<<4)

// LUT877L Configuration

#define GFXMMU_LUT877L_LVB          (0xFFU<<16)
#define GFXMMU_LUT877L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT877L_FVB          (0xFFU<<8)
#define GFXMMU_LUT877L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT877L_EN           (0x1U<<0)
#define GFXMMU_LUT877L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT877L_EN_B_0X1     (0x1U<<0)

// LUT877H Configuration

#define GFXMMU_LUT877H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT877H_LO_0         (0x1U<<4)

// LUT878L Configuration

#define GFXMMU_LUT878L_LVB          (0xFFU<<16)
#define GFXMMU_LUT878L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT878L_FVB          (0xFFU<<8)
#define GFXMMU_LUT878L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT878L_EN           (0x1U<<0)
#define GFXMMU_LUT878L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT878L_EN_B_0X1     (0x1U<<0)

// LUT878H Configuration

#define GFXMMU_LUT878H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT878H_LO_0         (0x1U<<4)

// LUT879L Configuration

#define GFXMMU_LUT879L_LVB          (0xFFU<<16)
#define GFXMMU_LUT879L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT879L_FVB          (0xFFU<<8)
#define GFXMMU_LUT879L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT879L_EN           (0x1U<<0)
#define GFXMMU_LUT879L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT879L_EN_B_0X1     (0x1U<<0)

// LUT879H Configuration

#define GFXMMU_LUT879H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT879H_LO_0         (0x1U<<4)

// LUT880L Configuration

#define GFXMMU_LUT880L_LVB          (0xFFU<<16)
#define GFXMMU_LUT880L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT880L_FVB          (0xFFU<<8)
#define GFXMMU_LUT880L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT880L_EN           (0x1U<<0)
#define GFXMMU_LUT880L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT880L_EN_B_0X1     (0x1U<<0)

