Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT880H Configuration

#define GFXMMU_LUT880H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT880H_LO_0         (0x1U<<4)

// LUT881L Configuration

#define GFXMMU_LUT881L_LVB          (0xFFU<<16)
#define GFXMMU_LUT881L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT881L_FVB          (0xFFU<<8)
#define GFXMMU_LUT881L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT881L_EN           (0x1U<<0)
#define GFXMMU_LUT881L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT881L_EN_B_0X1     (0x1U<<0)

// LUT881H Configuration

#define GFXMMU_LUT881H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT881H_LO_0         (0x1U<<4)

// LUT882L Configuration

#define GFXMMU_LUT882L_LVB          (0xFFU<<16)
#define GFXMMU_LUT882L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT882L_FVB          (0xFFU<<8)
#define GFXMMU_LUT882L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT882L_EN           (0x1U<<0)
#define GFXMMU_LUT882L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT882L_EN_B_0X1     (0x1U<<0)

// LUT882H Configuration

#define GFXMMU_LUT882H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT882H_LO_0         (0x1U<<4)

// LUT883L Configuration

#define GFXMMU_LUT883L_LVB          (0xFFU<<16)
#define GFXMMU_LUT883L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT883L_FVB          (0xFFU<<8)
#define GFXMMU_LUT883L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT883L_EN           (0x1U<<0)
#define GFXMMU_LUT883L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT883L_EN_B_0X1     (0x1U<<0)

// LUT883H Configuration

#define GFXMMU_LUT883H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT883H_LO_0         (0x1U<<4)

// LUT884L Configuration

#define GFXMMU_LUT884L_LVB          (0xFFU<<16)
#define GFXMMU_LUT884L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT884L_FVB          (0xFFU<<8)
#define GFXMMU_LUT884L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT884L_EN           (0x1U<<0)
#define GFXMMU_LUT884L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT884L_EN_B_0X1     (0x1U<<0)

// LUT884H Configuration

#define GFXMMU_LUT884H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT884H_LO_0         (0x1U<<4)

// LUT885L Configuration

#define GFXMMU_LUT885L_LVB          (0xFFU<<16)
#define GFXMMU_LUT885L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT885L_FVB          (0xFFU<<8)
#define GFXMMU_LUT885L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT885L_EN           (0x1U<<0)
#define GFXMMU_LUT885L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT885L_EN_B_0X1     (0x1U<<0)

// LUT885H Configuration

#define GFXMMU_LUT885H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT885H_LO_0         (0x1U<<4)

// LUT886L Configuration

#define GFXMMU_LUT886L_LVB          (0xFFU<<16)
#define GFXMMU_LUT886L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT886L_FVB          (0xFFU<<8)
#define GFXMMU_LUT886L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT886L_EN           (0x1U<<0)
#define GFXMMU_LUT886L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT886L_EN_B_0X1     (0x1U<<0)

// LUT886H Configuration

#define GFXMMU_LUT886H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT886H_LO_0         (0x1U<<4)

// LUT887L Configuration

#define GFXMMU_LUT887L_LVB          (0xFFU<<16)
#define GFXMMU_LUT887L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT887L_FVB          (0xFFU<<8)
#define GFXMMU_LUT887L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT887L_EN           (0x1U<<0)
#define GFXMMU_LUT887L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT887L_EN_B_0X1     (0x1U<<0)

// LUT887H Configuration

#define GFXMMU_LUT887H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT887H_LO_0         (0x1U<<4)

// LUT888L Configuration

#define GFXMMU_LUT888L_LVB          (0xFFU<<16)
#define GFXMMU_LUT888L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT888L_FVB          (0xFFU<<8)
#define GFXMMU_LUT888L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT888L_EN           (0x1U<<0)
#define GFXMMU_LUT888L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT888L_EN_B_0X1     (0x1U<<0)

// LUT888H Configuration

#define GFXMMU_LUT888H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT888H_LO_0         (0x1U<<4)

// LUT889L Configuration

#define GFXMMU_LUT889L_LVB          (0xFFU<<16)
#define GFXMMU_LUT889L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT889L_FVB          (0xFFU<<8)
#define GFXMMU_LUT889L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT889L_EN           (0x1U<<0)
#define GFXMMU_LUT889L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT889L_EN_B_0X1     (0x1U<<0)

// LUT889H Configuration

#define GFXMMU_LUT889H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT889H_LO_0         (0x1U<<4)

// LUT890L Configuration

#define GFXMMU_LUT890L_LVB          (0xFFU<<16)
#define GFXMMU_LUT890L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT890L_FVB          (0xFFU<<8)
#define GFXMMU_LUT890L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT890L_EN           (0x1U<<0)
#define GFXMMU_LUT890L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT890L_EN_B_0X1     (0x1U<<0)

// LUT890H Configuration

#define GFXMMU_LUT890H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT890H_LO_0         (0x1U<<4)

// LUT891L Configuration

#define GFXMMU_LUT891L_LVB          (0xFFU<<16)
#define GFXMMU_LUT891L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT891L_FVB          (0xFFU<<8)
#define GFXMMU_LUT891L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT891L_EN           (0x1U<<0)
#define GFXMMU_LUT891L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT891L_EN_B_0X1     (0x1U<<0)

// LUT891H Configuration

#define GFXMMU_LUT891H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT891H_LO_0         (0x1U<<4)

// LUT892L Configuration

#define GFXMMU_LUT892L_LVB          (0xFFU<<16)
#define GFXMMU_LUT892L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT892L_FVB          (0xFFU<<8)
#define GFXMMU_LUT892L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT892L_EN           (0x1U<<0)
#define GFXMMU_LUT892L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT892L_EN_B_0X1     (0x1U<<0)

// LUT892H Configuration

#define GFXMMU_LUT892H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT892H_LO_0         (0x1U<<4)

// LUT893L Configuration

#define GFXMMU_LUT893L_LVB          (0xFFU<<16)
#define GFXMMU_LUT893L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT893L_FVB          (0xFFU<<8)
#define GFXMMU_LUT893L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT893L_EN           (0x1U<<0)
#define GFXMMU_LUT893L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT893L_EN_B_0X1     (0x1U<<0)

// LUT893H Configuration

#define GFXMMU_LUT893H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT893H_LO_0         (0x1U<<4)

// LUT894L Configuration

#define GFXMMU_LUT894L_LVB          (0xFFU<<16)
#define GFXMMU_LUT894L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT894L_FVB          (0xFFU<<8)
#define GFXMMU_LUT894L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT894L_EN           (0x1U<<0)
#define GFXMMU_LUT894L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT894L_EN_B_0X1     (0x1U<<0)

