Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT894H Configuration

#define GFXMMU_LUT894H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT894H_LO_0         (0x1U<<4)

// LUT895L Configuration

#define GFXMMU_LUT895L_LVB          (0xFFU<<16)
#define GFXMMU_LUT895L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT895L_FVB          (0xFFU<<8)
#define GFXMMU_LUT895L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT895L_EN           (0x1U<<0)
#define GFXMMU_LUT895L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT895L_EN_B_0X1     (0x1U<<0)

// LUT895H Configuration

#define GFXMMU_LUT895H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT895H_LO_0         (0x1U<<4)

// LUT896L Configuration

#define GFXMMU_LUT896L_LVB          (0xFFU<<16)
#define GFXMMU_LUT896L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT896L_FVB          (0xFFU<<8)
#define GFXMMU_LUT896L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT896L_EN           (0x1U<<0)
#define GFXMMU_LUT896L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT896L_EN_B_0X1     (0x1U<<0)

// LUT896H Configuration

#define GFXMMU_LUT896H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT896H_LO_0         (0x1U<<4)

// LUT897L Configuration

#define GFXMMU_LUT897L_LVB          (0xFFU<<16)
#define GFXMMU_LUT897L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT897L_FVB          (0xFFU<<8)
#define GFXMMU_LUT897L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT897L_EN           (0x1U<<0)
#define GFXMMU_LUT897L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT897L_EN_B_0X1     (0x1U<<0)

// LUT897H Configuration

#define GFXMMU_LUT897H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT897H_LO_0         (0x1U<<4)

// LUT898L Configuration

#define GFXMMU_LUT898L_LVB          (0xFFU<<16)
#define GFXMMU_LUT898L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT898L_FVB          (0xFFU<<8)
#define GFXMMU_LUT898L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT898L_EN           (0x1U<<0)
#define GFXMMU_LUT898L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT898L_EN_B_0X1     (0x1U<<0)

// LUT898H Configuration

#define GFXMMU_LUT898H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT898H_LO_0         (0x1U<<4)

// LUT899L Configuration

#define GFXMMU_LUT899L_LVB          (0xFFU<<16)
#define GFXMMU_LUT899L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT899L_FVB          (0xFFU<<8)
#define GFXMMU_LUT899L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT899L_EN           (0x1U<<0)
#define GFXMMU_LUT899L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT899L_EN_B_0X1     (0x1U<<0)

// LUT899H Configuration

#define GFXMMU_LUT899H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT899H_LO_0         (0x1U<<4)

// LUT900L Configuration

#define GFXMMU_LUT900L_LVB          (0xFFU<<16)
#define GFXMMU_LUT900L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT900L_FVB          (0xFFU<<8)
#define GFXMMU_LUT900L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT900L_EN           (0x1U<<0)
#define GFXMMU_LUT900L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT900L_EN_B_0X1     (0x1U<<0)

// LUT900H Configuration

#define GFXMMU_LUT900H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT900H_LO_0         (0x1U<<4)

// LUT901L Configuration

#define GFXMMU_LUT901L_LVB          (0xFFU<<16)
#define GFXMMU_LUT901L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT901L_FVB          (0xFFU<<8)
#define GFXMMU_LUT901L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT901L_EN           (0x1U<<0)
#define GFXMMU_LUT901L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT901L_EN_B_0X1     (0x1U<<0)

// LUT901H Configuration

#define GFXMMU_LUT901H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT901H_LO_0         (0x1U<<4)

// LUT902L Configuration

#define GFXMMU_LUT902L_LVB          (0xFFU<<16)
#define GFXMMU_LUT902L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT902L_FVB          (0xFFU<<8)
#define GFXMMU_LUT902L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT902L_EN           (0x1U<<0)
#define GFXMMU_LUT902L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT902L_EN_B_0X1     (0x1U<<0)

// LUT902H Configuration

#define GFXMMU_LUT902H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT902H_LO_0         (0x1U<<4)

// LUT903L Configuration

#define GFXMMU_LUT903L_LVB          (0xFFU<<16)
#define GFXMMU_LUT903L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT903L_FVB          (0xFFU<<8)
#define GFXMMU_LUT903L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT903L_EN           (0x1U<<0)
#define GFXMMU_LUT903L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT903L_EN_B_0X1     (0x1U<<0)

// LUT903H Configuration

#define GFXMMU_LUT903H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT903H_LO_0         (0x1U<<4)

// LUT904L Configuration

#define GFXMMU_LUT904L_LVB          (0xFFU<<16)
#define GFXMMU_LUT904L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT904L_FVB          (0xFFU<<8)
#define GFXMMU_LUT904L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT904L_EN           (0x1U<<0)
#define GFXMMU_LUT904L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT904L_EN_B_0X1     (0x1U<<0)

// LUT904H Configuration

#define GFXMMU_LUT904H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT904H_LO_0         (0x1U<<4)

// LUT905L Configuration

#define GFXMMU_LUT905L_LVB          (0xFFU<<16)
#define GFXMMU_LUT905L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT905L_FVB          (0xFFU<<8)
#define GFXMMU_LUT905L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT905L_EN           (0x1U<<0)
#define GFXMMU_LUT905L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT905L_EN_B_0X1     (0x1U<<0)

// LUT905H Configuration

#define GFXMMU_LUT905H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT905H_LO_0         (0x1U<<4)

// LUT906L Configuration

#define GFXMMU_LUT906L_LVB          (0xFFU<<16)
#define GFXMMU_LUT906L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT906L_FVB          (0xFFU<<8)
#define GFXMMU_LUT906L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT906L_EN           (0x1U<<0)
#define GFXMMU_LUT906L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT906L_EN_B_0X1     (0x1U<<0)

// LUT906H Configuration

#define GFXMMU_LUT906H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT906H_LO_0         (0x1U<<4)

// LUT907L Configuration

#define GFXMMU_LUT907L_LVB          (0xFFU<<16)
#define GFXMMU_LUT907L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT907L_FVB          (0xFFU<<8)
#define GFXMMU_LUT907L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT907L_EN           (0x1U<<0)
#define GFXMMU_LUT907L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT907L_EN_B_0X1     (0x1U<<0)

// LUT907H Configuration

#define GFXMMU_LUT907H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT907H_LO_0         (0x1U<<4)

// LUT908L Configuration

#define GFXMMU_LUT908L_LVB          (0xFFU<<16)
#define GFXMMU_LUT908L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT908L_FVB          (0xFFU<<8)
#define GFXMMU_LUT908L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT908L_EN           (0x1U<<0)
#define GFXMMU_LUT908L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT908L_EN_B_0X1     (0x1U<<0)

