Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT934H Configuration

#define GFXMMU_LUT934H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT934H_LO_0         (0x1U<<4)

// LUT935L Configuration

#define GFXMMU_LUT935L_LVB          (0xFFU<<16)
#define GFXMMU_LUT935L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT935L_FVB          (0xFFU<<8)
#define GFXMMU_LUT935L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT935L_EN           (0x1U<<0)
#define GFXMMU_LUT935L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT935L_EN_B_0X1     (0x1U<<0)

// LUT935H Configuration

#define GFXMMU_LUT935H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT935H_LO_0         (0x1U<<4)

// LUT936L Configuration

#define GFXMMU_LUT936L_LVB          (0xFFU<<16)
#define GFXMMU_LUT936L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT936L_FVB          (0xFFU<<8)
#define GFXMMU_LUT936L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT936L_EN           (0x1U<<0)
#define GFXMMU_LUT936L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT936L_EN_B_0X1     (0x1U<<0)

// LUT936H Configuration

#define GFXMMU_LUT936H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT936H_LO_0         (0x1U<<4)

// LUT937L Configuration

#define GFXMMU_LUT937L_LVB          (0xFFU<<16)
#define GFXMMU_LUT937L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT937L_FVB          (0xFFU<<8)
#define GFXMMU_LUT937L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT937L_EN           (0x1U<<0)
#define GFXMMU_LUT937L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT937L_EN_B_0X1     (0x1U<<0)

// LUT937H Configuration

#define GFXMMU_LUT937H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT937H_LO_0         (0x1U<<4)

// LUT938L Configuration

#define GFXMMU_LUT938L_LVB          (0xFFU<<16)
#define GFXMMU_LUT938L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT938L_FVB          (0xFFU<<8)
#define GFXMMU_LUT938L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT938L_EN           (0x1U<<0)
#define GFXMMU_LUT938L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT938L_EN_B_0X1     (0x1U<<0)

// LUT938H Configuration

#define GFXMMU_LUT938H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT938H_LO_0         (0x1U<<4)

// LUT939L Configuration

#define GFXMMU_LUT939L_LVB          (0xFFU<<16)
#define GFXMMU_LUT939L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT939L_FVB          (0xFFU<<8)
#define GFXMMU_LUT939L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT939L_EN           (0x1U<<0)
#define GFXMMU_LUT939L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT939L_EN_B_0X1     (0x1U<<0)

// LUT939H Configuration

#define GFXMMU_LUT939H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT939H_LO_0         (0x1U<<4)

// LUT940L Configuration

#define GFXMMU_LUT940L_LVB          (0xFFU<<16)
#define GFXMMU_LUT940L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT940L_FVB          (0xFFU<<8)
#define GFXMMU_LUT940L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT940L_EN           (0x1U<<0)
#define GFXMMU_LUT940L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT940L_EN_B_0X1     (0x1U<<0)

// LUT940H Configuration

#define GFXMMU_LUT940H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT940H_LO_0         (0x1U<<4)

// LUT941L Configuration

#define GFXMMU_LUT941L_LVB          (0xFFU<<16)
#define GFXMMU_LUT941L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT941L_FVB          (0xFFU<<8)
#define GFXMMU_LUT941L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT941L_EN           (0x1U<<0)
#define GFXMMU_LUT941L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT941L_EN_B_0X1     (0x1U<<0)

// LUT941H Configuration

#define GFXMMU_LUT941H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT941H_LO_0         (0x1U<<4)

// LUT942L Configuration

#define GFXMMU_LUT942L_LVB          (0xFFU<<16)
#define GFXMMU_LUT942L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT942L_FVB          (0xFFU<<8)
#define GFXMMU_LUT942L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT942L_EN           (0x1U<<0)
#define GFXMMU_LUT942L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT942L_EN_B_0X1     (0x1U<<0)

// LUT942H Configuration

#define GFXMMU_LUT942H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT942H_LO_0         (0x1U<<4)

// LUT943L Configuration

#define GFXMMU_LUT943L_LVB          (0xFFU<<16)
#define GFXMMU_LUT943L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT943L_FVB          (0xFFU<<8)
#define GFXMMU_LUT943L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT943L_EN           (0x1U<<0)
#define GFXMMU_LUT943L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT943L_EN_B_0X1     (0x1U<<0)

// LUT943H Configuration

#define GFXMMU_LUT943H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT943H_LO_0         (0x1U<<4)

// LUT944L Configuration

#define GFXMMU_LUT944L_LVB          (0xFFU<<16)
#define GFXMMU_LUT944L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT944L_FVB          (0xFFU<<8)
#define GFXMMU_LUT944L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT944L_EN           (0x1U<<0)
#define GFXMMU_LUT944L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT944L_EN_B_0X1     (0x1U<<0)

// LUT944H Configuration

#define GFXMMU_LUT944H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT944H_LO_0         (0x1U<<4)

// LUT945L Configuration

#define GFXMMU_LUT945L_LVB          (0xFFU<<16)
#define GFXMMU_LUT945L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT945L_FVB          (0xFFU<<8)
#define GFXMMU_LUT945L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT945L_EN           (0x1U<<0)
#define GFXMMU_LUT945L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT945L_EN_B_0X1     (0x1U<<0)

// LUT945H Configuration

#define GFXMMU_LUT945H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT945H_LO_0         (0x1U<<4)

// LUT946L Configuration

#define GFXMMU_LUT946L_LVB          (0xFFU<<16)
#define GFXMMU_LUT946L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT946L_FVB          (0xFFU<<8)
#define GFXMMU_LUT946L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT946L_EN           (0x1U<<0)
#define GFXMMU_LUT946L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT946L_EN_B_0X1     (0x1U<<0)

// LUT946H Configuration

#define GFXMMU_LUT946H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT946H_LO_0         (0x1U<<4)

// LUT947L Configuration

#define GFXMMU_LUT947L_LVB          (0xFFU<<16)
#define GFXMMU_LUT947L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT947L_FVB          (0xFFU<<8)
#define GFXMMU_LUT947L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT947L_EN           (0x1U<<0)
#define GFXMMU_LUT947L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT947L_EN_B_0X1     (0x1U<<0)

// LUT947H Configuration

#define GFXMMU_LUT947H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT947H_LO_0         (0x1U<<4)

