Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT948L Configuration

#define GFXMMU_LUT948L_LVB          (0xFFU<<16)
#define GFXMMU_LUT948L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT948L_FVB          (0xFFU<<8)
#define GFXMMU_LUT948L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT948L_EN           (0x1U<<0)
#define GFXMMU_LUT948L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT948L_EN_B_0X1     (0x1U<<0)

// LUT948H Configuration

#define GFXMMU_LUT948H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT948H_LO_0         (0x1U<<4)

// LUT949L Configuration

#define GFXMMU_LUT949L_LVB          (0xFFU<<16)
#define GFXMMU_LUT949L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT949L_FVB          (0xFFU<<8)
#define GFXMMU_LUT949L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT949L_EN           (0x1U<<0)
#define GFXMMU_LUT949L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT949L_EN_B_0X1     (0x1U<<0)

// LUT949H Configuration

#define GFXMMU_LUT949H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT949H_LO_0         (0x1U<<4)

// LUT950L Configuration

#define GFXMMU_LUT950L_LVB          (0xFFU<<16)
#define GFXMMU_LUT950L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT950L_FVB          (0xFFU<<8)
#define GFXMMU_LUT950L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT950L_EN           (0x1U<<0)
#define GFXMMU_LUT950L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT950L_EN_B_0X1     (0x1U<<0)

// LUT950H Configuration

#define GFXMMU_LUT950H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT950H_LO_0         (0x1U<<4)

// LUT951L Configuration

#define GFXMMU_LUT951L_LVB          (0xFFU<<16)
#define GFXMMU_LUT951L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT951L_FVB          (0xFFU<<8)
#define GFXMMU_LUT951L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT951L_EN           (0x1U<<0)
#define GFXMMU_LUT951L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT951L_EN_B_0X1     (0x1U<<0)

// LUT951H Configuration

#define GFXMMU_LUT951H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT951H_LO_0         (0x1U<<4)

// LUT952L Configuration

#define GFXMMU_LUT952L_LVB          (0xFFU<<16)
#define GFXMMU_LUT952L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT952L_FVB          (0xFFU<<8)
#define GFXMMU_LUT952L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT952L_EN           (0x1U<<0)
#define GFXMMU_LUT952L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT952L_EN_B_0X1     (0x1U<<0)

// LUT952H Configuration

#define GFXMMU_LUT952H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT952H_LO_0         (0x1U<<4)

// LUT953L Configuration

#define GFXMMU_LUT953L_LVB          (0xFFU<<16)
#define GFXMMU_LUT953L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT953L_FVB          (0xFFU<<8)
#define GFXMMU_LUT953L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT953L_EN           (0x1U<<0)
#define GFXMMU_LUT953L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT953L_EN_B_0X1     (0x1U<<0)

// LUT953H Configuration

#define GFXMMU_LUT953H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT953H_LO_0         (0x1U<<4)

// LUT954L Configuration

#define GFXMMU_LUT954L_LVB          (0xFFU<<16)
#define GFXMMU_LUT954L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT954L_FVB          (0xFFU<<8)
#define GFXMMU_LUT954L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT954L_EN           (0x1U<<0)
#define GFXMMU_LUT954L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT954L_EN_B_0X1     (0x1U<<0)

// LUT954H Configuration

#define GFXMMU_LUT954H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT954H_LO_0         (0x1U<<4)

// LUT955L Configuration

#define GFXMMU_LUT955L_LVB          (0xFFU<<16)
#define GFXMMU_LUT955L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT955L_FVB          (0xFFU<<8)
#define GFXMMU_LUT955L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT955L_EN           (0x1U<<0)
#define GFXMMU_LUT955L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT955L_EN_B_0X1     (0x1U<<0)

// LUT955H Configuration

#define GFXMMU_LUT955H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT955H_LO_0         (0x1U<<4)

// LUT956L Configuration

#define GFXMMU_LUT956L_LVB          (0xFFU<<16)
#define GFXMMU_LUT956L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT956L_FVB          (0xFFU<<8)
#define GFXMMU_LUT956L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT956L_EN           (0x1U<<0)
#define GFXMMU_LUT956L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT956L_EN_B_0X1     (0x1U<<0)

// LUT956H Configuration

#define GFXMMU_LUT956H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT956H_LO_0         (0x1U<<4)

// LUT957L Configuration

#define GFXMMU_LUT957L_LVB          (0xFFU<<16)
#define GFXMMU_LUT957L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT957L_FVB          (0xFFU<<8)
#define GFXMMU_LUT957L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT957L_EN           (0x1U<<0)
#define GFXMMU_LUT957L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT957L_EN_B_0X1     (0x1U<<0)

// LUT957H Configuration

#define GFXMMU_LUT957H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT957H_LO_0         (0x1U<<4)

// LUT958L Configuration

#define GFXMMU_LUT958L_LVB          (0xFFU<<16)
#define GFXMMU_LUT958L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT958L_FVB          (0xFFU<<8)
#define GFXMMU_LUT958L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT958L_EN           (0x1U<<0)
#define GFXMMU_LUT958L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT958L_EN_B_0X1     (0x1U<<0)

// LUT958H Configuration

#define GFXMMU_LUT958H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT958H_LO_0         (0x1U<<4)

// LUT959L Configuration

#define GFXMMU_LUT959L_LVB          (0xFFU<<16)
#define GFXMMU_LUT959L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT959L_FVB          (0xFFU<<8)
#define GFXMMU_LUT959L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT959L_EN           (0x1U<<0)
#define GFXMMU_LUT959L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT959L_EN_B_0X1     (0x1U<<0)

// LUT959H Configuration

#define GFXMMU_LUT959H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT959H_LO_0         (0x1U<<4)

// LUT960L Configuration

#define GFXMMU_LUT960L_LVB          (0xFFU<<16)
#define GFXMMU_LUT960L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT960L_FVB          (0xFFU<<8)
#define GFXMMU_LUT960L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT960L_EN           (0x1U<<0)
#define GFXMMU_LUT960L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT960L_EN_B_0X1     (0x1U<<0)

// LUT960H Configuration

#define GFXMMU_LUT960H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT960H_LO_0         (0x1U<<4)

// LUT961L Configuration

#define GFXMMU_LUT961L_LVB          (0xFFU<<16)
#define GFXMMU_LUT961L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT961L_FVB          (0xFFU<<8)
#define GFXMMU_LUT961L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT961L_EN           (0x1U<<0)
#define GFXMMU_LUT961L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT961L_EN_B_0X1     (0x1U<<0)

// LUT961H Configuration

#define GFXMMU_LUT961H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT961H_LO_0         (0x1U<<4)

// LUT962L Configuration

#define GFXMMU_LUT962L_LVB          (0xFFU<<16)
#define GFXMMU_LUT962L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT962L_FVB          (0xFFU<<8)
#define GFXMMU_LUT962L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT962L_EN           (0x1U<<0)
#define GFXMMU_LUT962L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT962L_EN_B_0X1     (0x1U<<0)

