Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT962H Configuration

#define GFXMMU_LUT962H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT962H_LO_0         (0x1U<<4)

// LUT963L Configuration

#define GFXMMU_LUT963L_LVB          (0xFFU<<16)
#define GFXMMU_LUT963L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT963L_FVB          (0xFFU<<8)
#define GFXMMU_LUT963L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT963L_EN           (0x1U<<0)
#define GFXMMU_LUT963L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT963L_EN_B_0X1     (0x1U<<0)

// LUT963H Configuration

#define GFXMMU_LUT963H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT963H_LO_0         (0x1U<<4)

// LUT964L Configuration

#define GFXMMU_LUT964L_LVB          (0xFFU<<16)
#define GFXMMU_LUT964L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT964L_FVB          (0xFFU<<8)
#define GFXMMU_LUT964L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT964L_EN           (0x1U<<0)
#define GFXMMU_LUT964L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT964L_EN_B_0X1     (0x1U<<0)

// LUT964H Configuration

#define GFXMMU_LUT964H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT964H_LO_0         (0x1U<<4)

// LUT965L Configuration

#define GFXMMU_LUT965L_LVB          (0xFFU<<16)
#define GFXMMU_LUT965L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT965L_FVB          (0xFFU<<8)
#define GFXMMU_LUT965L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT965L_EN           (0x1U<<0)
#define GFXMMU_LUT965L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT965L_EN_B_0X1     (0x1U<<0)

// LUT965H Configuration

#define GFXMMU_LUT965H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT965H_LO_0         (0x1U<<4)

// LUT966L Configuration

#define GFXMMU_LUT966L_LVB          (0xFFU<<16)
#define GFXMMU_LUT966L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT966L_FVB          (0xFFU<<8)
#define GFXMMU_LUT966L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT966L_EN           (0x1U<<0)
#define GFXMMU_LUT966L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT966L_EN_B_0X1     (0x1U<<0)

// LUT966H Configuration

#define GFXMMU_LUT966H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT966H_LO_0         (0x1U<<4)

// LUT967L Configuration

#define GFXMMU_LUT967L_LVB          (0xFFU<<16)
#define GFXMMU_LUT967L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT967L_FVB          (0xFFU<<8)
#define GFXMMU_LUT967L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT967L_EN           (0x1U<<0)
#define GFXMMU_LUT967L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT967L_EN_B_0X1     (0x1U<<0)

// LUT967H Configuration

#define GFXMMU_LUT967H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT967H_LO_0         (0x1U<<4)

// LUT968L Configuration

#define GFXMMU_LUT968L_LVB          (0xFFU<<16)
#define GFXMMU_LUT968L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT968L_FVB          (0xFFU<<8)
#define GFXMMU_LUT968L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT968L_EN           (0x1U<<0)
#define GFXMMU_LUT968L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT968L_EN_B_0X1     (0x1U<<0)

// LUT968H Configuration

#define GFXMMU_LUT968H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT968H_LO_0         (0x1U<<4)

// LUT969L Configuration

#define GFXMMU_LUT969L_LVB          (0xFFU<<16)
#define GFXMMU_LUT969L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT969L_FVB          (0xFFU<<8)
#define GFXMMU_LUT969L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT969L_EN           (0x1U<<0)
#define GFXMMU_LUT969L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT969L_EN_B_0X1     (0x1U<<0)

// LUT969H Configuration

#define GFXMMU_LUT969H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT969H_LO_0         (0x1U<<4)

// LUT970L Configuration

#define GFXMMU_LUT970L_LVB          (0xFFU<<16)
#define GFXMMU_LUT970L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT970L_FVB          (0xFFU<<8)
#define GFXMMU_LUT970L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT970L_EN           (0x1U<<0)
#define GFXMMU_LUT970L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT970L_EN_B_0X1     (0x1U<<0)

// LUT970H Configuration

#define GFXMMU_LUT970H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT970H_LO_0         (0x1U<<4)

// LUT971L Configuration

#define GFXMMU_LUT971L_LVB          (0xFFU<<16)
#define GFXMMU_LUT971L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT971L_FVB          (0xFFU<<8)
#define GFXMMU_LUT971L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT971L_EN           (0x1U<<0)
#define GFXMMU_LUT971L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT971L_EN_B_0X1     (0x1U<<0)

// LUT971H Configuration

#define GFXMMU_LUT971H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT971H_LO_0         (0x1U<<4)

// LUT972L Configuration

#define GFXMMU_LUT972L_LVB          (0xFFU<<16)
#define GFXMMU_LUT972L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT972L_FVB          (0xFFU<<8)
#define GFXMMU_LUT972L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT972L_EN           (0x1U<<0)
#define GFXMMU_LUT972L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT972L_EN_B_0X1     (0x1U<<0)

// LUT972H Configuration

#define GFXMMU_LUT972H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT972H_LO_0         (0x1U<<4)

// LUT973L Configuration

#define GFXMMU_LUT973L_LVB          (0xFFU<<16)
#define GFXMMU_LUT973L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT973L_FVB          (0xFFU<<8)
#define GFXMMU_LUT973L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT973L_EN           (0x1U<<0)
#define GFXMMU_LUT973L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT973L_EN_B_0X1     (0x1U<<0)

// LUT973H Configuration

#define GFXMMU_LUT973H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT973H_LO_0         (0x1U<<4)

// LUT974L Configuration

#define GFXMMU_LUT974L_LVB          (0xFFU<<16)
#define GFXMMU_LUT974L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT974L_FVB          (0xFFU<<8)
#define GFXMMU_LUT974L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT974L_EN           (0x1U<<0)
#define GFXMMU_LUT974L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT974L_EN_B_0X1     (0x1U<<0)

// LUT974H Configuration

#define GFXMMU_LUT974H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT974H_LO_0         (0x1U<<4)

// LUT975L Configuration

#define GFXMMU_LUT975L_LVB          (0xFFU<<16)
#define GFXMMU_LUT975L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT975L_FVB          (0xFFU<<8)
#define GFXMMU_LUT975L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT975L_EN           (0x1U<<0)
#define GFXMMU_LUT975L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT975L_EN_B_0X1     (0x1U<<0)

// LUT975H Configuration

#define GFXMMU_LUT975H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT975H_LO_0         (0x1U<<4)

// LUT976L Configuration

#define GFXMMU_LUT976L_LVB          (0xFFU<<16)
#define GFXMMU_LUT976L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT976L_FVB          (0xFFU<<8)
#define GFXMMU_LUT976L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT976L_EN           (0x1U<<0)
#define GFXMMU_LUT976L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT976L_EN_B_0X1     (0x1U<<0)

