Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
#define GFXMMU_LUT990L_LVB          (0xFFU<<16)
#define GFXMMU_LUT990L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT990L_FVB          (0xFFU<<8)
#define GFXMMU_LUT990L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT990L_EN           (0x1U<<0)
#define GFXMMU_LUT990L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT990L_EN_B_0X1     (0x1U<<0)

// LUT990H Configuration

#define GFXMMU_LUT990H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT990H_LO_0         (0x1U<<4)

// LUT991L Configuration

#define GFXMMU_LUT991L_LVB          (0xFFU<<16)
#define GFXMMU_LUT991L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT991L_FVB          (0xFFU<<8)
#define GFXMMU_LUT991L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT991L_EN           (0x1U<<0)
#define GFXMMU_LUT991L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT991L_EN_B_0X1     (0x1U<<0)

// LUT991H Configuration

#define GFXMMU_LUT991H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT991H_LO_0         (0x1U<<4)

// LUT992L Configuration

#define GFXMMU_LUT992L_LVB          (0xFFU<<16)
#define GFXMMU_LUT992L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT992L_FVB          (0xFFU<<8)
#define GFXMMU_LUT992L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT992L_EN           (0x1U<<0)
#define GFXMMU_LUT992L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT992L_EN_B_0X1     (0x1U<<0)

// LUT992H Configuration

#define GFXMMU_LUT992H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT992H_LO_0         (0x1U<<4)

// LUT993L Configuration

#define GFXMMU_LUT993L_LVB          (0xFFU<<16)
#define GFXMMU_LUT993L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT993L_FVB          (0xFFU<<8)
#define GFXMMU_LUT993L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT993L_EN           (0x1U<<0)
#define GFXMMU_LUT993L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT993L_EN_B_0X1     (0x1U<<0)

// LUT993H Configuration

#define GFXMMU_LUT993H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT993H_LO_0         (0x1U<<4)

// LUT994L Configuration

#define GFXMMU_LUT994L_LVB          (0xFFU<<16)
#define GFXMMU_LUT994L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT994L_FVB          (0xFFU<<8)
#define GFXMMU_LUT994L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT994L_EN           (0x1U<<0)
#define GFXMMU_LUT994L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT994L_EN_B_0X1     (0x1U<<0)

// LUT994H Configuration

#define GFXMMU_LUT994H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT994H_LO_0         (0x1U<<4)

// LUT995L Configuration

#define GFXMMU_LUT995L_LVB          (0xFFU<<16)
#define GFXMMU_LUT995L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT995L_FVB          (0xFFU<<8)
#define GFXMMU_LUT995L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT995L_EN           (0x1U<<0)
#define GFXMMU_LUT995L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT995L_EN_B_0X1     (0x1U<<0)

// LUT995H Configuration

#define GFXMMU_LUT995H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT995H_LO_0         (0x1U<<4)

// LUT996L Configuration

#define GFXMMU_LUT996L_LVB          (0xFFU<<16)
#define GFXMMU_LUT996L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT996L_FVB          (0xFFU<<8)
#define GFXMMU_LUT996L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT996L_EN           (0x1U<<0)
#define GFXMMU_LUT996L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT996L_EN_B_0X1     (0x1U<<0)

// LUT996H Configuration

#define GFXMMU_LUT996H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT996H_LO_0         (0x1U<<4)

// LUT997L Configuration

#define GFXMMU_LUT997L_LVB          (0xFFU<<16)
#define GFXMMU_LUT997L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT997L_FVB          (0xFFU<<8)
#define GFXMMU_LUT997L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT997L_EN           (0x1U<<0)
#define GFXMMU_LUT997L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT997L_EN_B_0X1     (0x1U<<0)

// LUT997H Configuration

#define GFXMMU_LUT997H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT997H_LO_0         (0x1U<<4)

// LUT998L Configuration

#define GFXMMU_LUT998L_LVB          (0xFFU<<16)
#define GFXMMU_LUT998L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT998L_FVB          (0xFFU<<8)
#define GFXMMU_LUT998L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT998L_EN           (0x1U<<0)
#define GFXMMU_LUT998L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT998L_EN_B_0X1     (0x1U<<0)

// LUT998H Configuration

#define GFXMMU_LUT998H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT998H_LO_0         (0x1U<<4)

// LUT999L Configuration

#define GFXMMU_LUT999L_LVB          (0xFFU<<16)
#define GFXMMU_LUT999L_LVB_0        (0x1U<<16)
#define GFXMMU_LUT999L_FVB          (0xFFU<<8)
#define GFXMMU_LUT999L_FVB_0        (0x1U<<8)
#define GFXMMU_LUT999L_EN           (0x1U<<0)
#define GFXMMU_LUT999L_EN_B_0X0     (0x0U<<0)
#define GFXMMU_LUT999L_EN_B_0X1     (0x1U<<0)

// LUT999H Configuration

#define GFXMMU_LUT999H_LO           (0x3FFFFU<<4)
#define GFXMMU_LUT999H_LO_0         (0x1U<<4)

// LUT1000L Configuration

#define GFXMMU_LUT1000L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1000L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1000L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1000L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1000L_EN          (0x1U<<0)
#define GFXMMU_LUT1000L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1000L_EN_B_0X1    (0x1U<<0)

// LUT1000H Configuration

#define GFXMMU_LUT1000H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1000H_LO_0        (0x1U<<4)

// LUT1001L Configuration

#define GFXMMU_LUT1001L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1001L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1001L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1001L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1001L_EN          (0x1U<<0)
#define GFXMMU_LUT1001L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1001L_EN_B_0X1    (0x1U<<0)

// LUT1001H Configuration

#define GFXMMU_LUT1001H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1001H_LO_0        (0x1U<<4)

// LUT1002L Configuration

#define GFXMMU_LUT1002L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1002L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1002L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1002L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1002L_EN          (0x1U<<0)
#define GFXMMU_LUT1002L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1002L_EN_B_0X1    (0x1U<<0)

// LUT1002H Configuration

#define GFXMMU_LUT1002H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1002H_LO_0        (0x1U<<4)

// LUT1003L Configuration

#define GFXMMU_LUT1003L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1003L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1003L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1003L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1003L_EN          (0x1U<<0)
#define GFXMMU_LUT1003L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1003L_EN_B_0X1    (0x1U<<0)

