Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gfxmmu.h
// LUT1017H Configuration

#define GFXMMU_LUT1017H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1017H_LO_0        (0x1U<<4)

// LUT1018L Configuration

#define GFXMMU_LUT1018L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1018L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1018L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1018L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1018L_EN          (0x1U<<0)
#define GFXMMU_LUT1018L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1018L_EN_B_0X1    (0x1U<<0)

// LUT1018H Configuration

#define GFXMMU_LUT1018H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1018H_LO_0        (0x1U<<4)

// LUT1019L Configuration

#define GFXMMU_LUT1019L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1019L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1019L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1019L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1019L_EN          (0x1U<<0)
#define GFXMMU_LUT1019L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1019L_EN_B_0X1    (0x1U<<0)

// LUT1019H Configuration

#define GFXMMU_LUT1019H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1019H_LO_0        (0x1U<<4)

// LUT1020L Configuration

#define GFXMMU_LUT1020L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1020L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1020L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1020L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1020L_EN          (0x1U<<0)
#define GFXMMU_LUT1020L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1020L_EN_B_0X1    (0x1U<<0)

// LUT1020H Configuration

#define GFXMMU_LUT1020H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1020H_LO_0        (0x1U<<4)

// LUT1021L Configuration

#define GFXMMU_LUT1021L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1021L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1021L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1021L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1021L_EN          (0x1U<<0)
#define GFXMMU_LUT1021L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1021L_EN_B_0X1    (0x1U<<0)

// LUT1021H Configuration

#define GFXMMU_LUT1021H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1021H_LO_0        (0x1U<<4)

// LUT1022L Configuration

#define GFXMMU_LUT1022L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1022L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1022L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1022L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1022L_EN          (0x1U<<0)
#define GFXMMU_LUT1022L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1022L_EN_B_0X1    (0x1U<<0)

// LUT1022H Configuration

#define GFXMMU_LUT1022H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1022H_LO_0        (0x1U<<4)

// LUT1023L Configuration

#define GFXMMU_LUT1023L_LVB         (0xFFU<<16)
#define GFXMMU_LUT1023L_LVB_0       (0x1U<<16)
#define GFXMMU_LUT1023L_FVB         (0xFFU<<8)
#define GFXMMU_LUT1023L_FVB_0       (0x1U<<8)
#define GFXMMU_LUT1023L_EN          (0x1U<<0)
#define GFXMMU_LUT1023L_EN_B_0X0    (0x0U<<0)
#define GFXMMU_LUT1023L_EN_B_0X1    (0x1U<<0)

// LUT1023H Configuration

#define GFXMMU_LUT1023H_LO          (0x3FFFFU<<4)
#define GFXMMU_LUT1023H_LO_0        (0x1U<<4)
